{"id":453,"date":"2022-07-08T22:49:32","date_gmt":"2022-07-08T14:49:32","guid":{"rendered":"http:\/\/localhost:8000\/wordpress\/?p=453"},"modified":"2022-12-12T19:59:38","modified_gmt":"2022-12-12T11:59:38","slug":"%e8%ae%a1%e7%ae%97%e6%9c%ba%e7%bd%91%e7%bb%9c04-%e8%bf%90%e8%be%93%e5%b1%82%e6%a6%82%e7%8e%87%e4%b8%8eudp%e5%8d%8f%e8%ae%ae","status":"publish","type":"post","link":"http:\/\/localhost:8000\/wordpress\/archives\/453","title":{"rendered":"\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u89c8\u4e0eUDP\u534f\u8bae"},"content":{"rendered":"\n<h2>\u8fd0\u8f93\u5c42\u6982\u8ff0<\/h2>\n\n<p>\u8fd0\u8f93\u5c42\u534f\u8bae\u4e3a\u8fd0\u884c\u5728\u4e0d\u540c\u4e3b\u673a\u4e0a\u7684\u5e94\u7528\u8fdb\u7a0b\u4e4b\u95f4\u63d0\u4f9b\u4e86\u903b\u8f91\u901a\u4fe1(logic communication)\u529f\u80fd\uff0c\u5373\u4e3b\u673a\u4e4b\u95f4\u8868\u73b0\u5f97\u50cf\u76f4\u63a5\u76f8\u8fde\u3002\u4e0b\u56fe\u5c55\u793a\u4e86\u8fd9\u79cd\u5c01\u88c5\u601d\u8def\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-transport-layer.jpg\" alt=\"\" width=\"400\">\n    <figcaption>\u8fd0\u8f93\u5c42\u534f\u8bae\u7684\u5de5\u4f5c\u539f\u7406<\/figcaption>\n<\/figure>\n\n<p>\u8fd0\u8f93\u5c42\u534f\u8bae\u662f\u5728\u4e3b\u673a\u4e0a\u800c\u4e0d\u662f\u8def\u7531\u5668\u5185\u5b9e\u73b0\u7684\u3002\u5728\u53d1\u9001\u7aef\uff0c\u8fd0\u8f93\u5c42\u5c06\u53d1\u9001\u5e94\u7528\u7a0b\u5e8f\u8fdb\u7a0b\u63a5\u6536\u5230\u7684\u62a5\u6587\u8f6c\u6362\u6210\u8fd0\u8f93\u5c42\u62a5\u6587\u6bb5\uff0c\u7136\u540e\u4f20\u9012\u7ed9\u7f51\u7edc\u5c42\u3002<\/p>\n\n<p>\u7f51\u7edc\u5e94\u7528\u7a0b\u5e8f\u53ef\u4ee5\u4f7f\u7528\u591a\u79cd\u8fd0\u8f93\u5c42\u534f\u8bae\uff0c\u4e92\u8054\u7f51\u4e0a\u4e3b\u8981\u4f7f\u7528\u7684\u4e24\u79cd\u8fd0\u8f93\u5c42\u534f\u8bae\u662f TCP(Transmission Control Protocol, \u4f20\u8f93\u63a7\u5236\u534f\u8bae)\u548c UDP(User Datagram Protocol, \u7528\u6237\u6570\u636e\u62a5\u534f\u8bae)\u3002<\/p>\n\n<p>\u4e00\u53f0\u4e3b\u673a\u4e0a\u53ef\u80fd\u540c\u65f6\u5b58\u5728\u82e5\u5e72\u4e2a\u5957\u63a5\u5b57\uff0c<strong>\u591a\u8def\u5206\u89e3<\/strong>(demultiplexing)\u786e\u4fdd\u8fd0\u8f93\u5c42\u62a5\u6587\u6bb5\u4e2d\u7684\u6570\u636e\u4ea4\u4ed8\u5230\u6b63\u786e\u7684\u5957\u63a5\u5b57\u3002<strong>\u591a\u8def\u590d\u7528<\/strong>(multiplexing)\u5219\u5c06\u6e90\u4e3b\u673a\u4e0d\u540c\u5957\u63a5\u5b57\u53d1\u751f\u7684\u6570\u636e\u5757\u5c01\u88c5\u4e0a\u4fbf\u4e8e\u5206\u89e3\u7684\u9996\u90e8\u4fe1\u606f\uff0c\u5e76\u5c06\u751f\u6210\u7684\u62a5\u6587\u6bb5\u4f20\u9012\u5230\u7f51\u7edc\u5c42\u3002<\/p>\n\n<p>\u4e3a\u4e86\u5b9e\u73b0\u591a\u8def\u590d\u7528\u670d\u52a1\uff0c\u5957\u63a5\u5b57\u9700\u8981\u6709\u552f\u4e00\u6807\u8bc6\uff0c\u5e76\u4e14\u8fd0\u8f93\u5c42\u7684\u6bcf\u4e2a\u62a5\u6587\u6bb5\u5177\u6709\u7279\u6b8a\u5b57\u6bb5\u6765\u6307\u793a\u8be5\u62a5\u6587\u6240\u8981\u4ea4\u4ed8\u5230\u7684\u5957\u63a5\u5b57\uff1b\u4e3a\u4e86\u5b9e\u73b0\u591a\u8def\u5206\u89e3\u670d\u52a1\uff0c\u5728\u4e3b\u673a\u4e0a\u7684\u6bcf\u4e2a\u5957\u63a5\u5b57\u80fd\u591f\u5206\u914d\u4e00\u4e2a\u7aef\u53e3\u53f7\uff0c\u5f53\u62a5\u6587\u6bb5\u5230\u8fbe\u4e3b\u673a\u65f6\uff0c\u8fd0\u8f93\u5c42\u68c0\u67e5\u62a5\u6587\u6bb5\u4e2d\u7684\u76ee\u7684\u7aef\u53e3\u53f7\uff0c\u5e76\u5c06\u5176\u5b9a\u5411\u5230\u76f8\u5e94\u7684\u5957\u63a5\u5b57\u3002\u7136\u540e\u62a5\u6587\u6bb5\u4e2d\u7684\u6570\u636e\u901a\u8fc7\u5957\u63a5\u5b57\u8fdb\u5165\u5176\u6240\u8fde\u63a5\u7684\u8fdb\u7a0b\u3002<\/p>\n\n<p>\u4e0b\u56fe\u5c55\u793a\u4e86\u591a\u8def\u5206\u89e3\u4e0e\u591a\u8def\u590d\u7528\u7684\u601d\u8def\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-multiplexing.jpg\" alt=\"\" width=\"490\">\n    <figcaption>\u591a\u8def\u590d\u7528\u4e0e\u591a\u8def\u5206\u89e3<\/figcaption>\n<\/figure>\n\n<p>\u8fdb\u7a0b\u7684\u8f7d\u4f53\u662f\u64cd\u4f5c\u7cfb\u7edf\uff0c\u56e0\u6b64\u53ea\u80fd\u7531\u64cd\u4f5c\u7cfb\u7edf\u6765\u5b9e\u73b0\u8fd0\u8f93\u5c42\u534f\u8bae\uff0c\u5b8c\u6210\u591a\u8def\u5206\u89e3\u4e0e\u591a\u8def\u590d\u7528\u3002<\/p>\n\n<ul>\n    <li><strong>\u65e0\u8fde\u63a5\u7684\u591a\u8def\u590d\u7528\u4e0e\u591a\u8def\u5206\u89e3<\/strong><\/li>\n<\/ul> \n\n<p>\u5728\u4e3b\u673a\u4e0a\u8fd0\u884c\u7684 Python \u7a0b\u5e8f\u901a\u8fc7\u4ee5\u4e0b\u4ee3\u7801\u521b\u5efa\u4e00\u4e2a UDP \u5957\u63a5\u5b57\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span style=\"color: #24292e;\">client<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">=<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #6f42c1;\">socket<\/span><span style=\"color: #24292e;\">(<\/span><span style=\"color: #6f42c1;\">socket<\/span><span style=\"color: #24292e;\">.<\/span><span style=\"color: #24292e;\">AF_INET<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #6f42c1;\">socket<\/span><span style=\"color: #24292e;\">.<\/span><span style=\"color: #24292e;\">SOCK_DGRAM<\/span><span style=\"color: #24292e;\">)<\/span><\/div><\/div>\n\n<p>\u5f53\u4f7f\u7528\u8fd9\u79cd\u65b9\u5f0f\u521b\u5efa\u4e00\u4e2a UDP \u5957\u63a5\u5b57\u65f6\uff0c\u8bb8\u591a\u64cd\u4f5c\u7cfb\u7edf\u7684\u8fd0\u8f93\u5c42\u4f1a\u81ea\u52a8\u4e3a\u8be5\u5957\u63a5\u5b57\u4ece\u5176\u5b83\u7aef\u53e3 49152~65535 \u5185\u5206\u914d\u4e00\u4e2a\u672a\u88ab\u5176\u5b83\u5e94\u7528\u7a0b\u5e8f\u5360\u7528\u7684\u7aef\u53e3\u53f7\u3002\u5f53\u7136\uff0c\u4e5f\u53ef\u4ee5\u4f7f\u7528\u5957\u63a5\u5b57\u7684 <code>.bind()<\/code> \u65b9\u6cd5\u5173\u8054\u4e00\u4e2a\u7279\u5b9a\u7684\u7aef\u53e3\u53f7\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span style=\"color: #24292e;\">client<\/span><span style=\"color: #24292e;\">.bind((<\/span><span style=\"color: #032f62;\">''<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #005cc5;\">13284<\/span><span style=\"color: #24292e;\">))<\/span><\/div><\/div>\n\n<p>\u901a\u5e38\uff0c\u5e94\u7528\u7a0b\u5e8f\u7684\u5ba2\u6237\u7aef\u4f1a\u8ba9\u8fd0\u8f93\u5c42\u81ea\u52a8\u4e14\u900f\u660e\u5730\u5206\u914d\u7aef\u53e3\u53f7\uff0c\u800c\u670d\u52a1\u5668\u7aef\u5219\u5206\u914d\u4e00\u4e2a\u7279\u5b9a\u7684\u7aef\u53e3\u53f7\u3002<\/p>\n\n<p>UDP \u5728\u53d1\u9001\u65f6\uff0c\u9700\u8981\u5728\u62a5\u6587\u4e2d\u5305\u542b\u76ee\u7684\u5957\u63a5\u5b57\u7684\u7aef\u53e3\u53f7\u3002\u5f53 UDP \u62a5\u6587\u6bb5\u5230\u8fbe\u65f6\uff0c\u63a5\u6536\u4e3b\u673a\u7684\u8fd0\u8f93\u5c42\u4f1a\u68c0\u67e5\u62a5\u6587\u4e2d\u7684\u76ee\u7684\u7aef\u53e3\u53f7\uff0c\u901a\u8fc7\u83b7\u5f97\u7684\u7aef\u53e3\u53f7\u4fe1\u606f\u53ef\u4ee5\u5c06\u6bcf\u4e2a\u62a5\u6587\u6bb5\u5b9a\u5411\u5206\u89e3\u5230\u76f8\u5e94\u7684\u5957\u63a5\u5b57\uff0c\u8fdb\u800c\u5c06\u62a5\u6587\u4ea4\u4ed8\u7ed9\u5bf9\u5e94\u7684\u5e94\u7528\u7a0b\u5e8f\u3002<\/p>\n\n<p>\u4e00\u4e2a UDP \u5957\u63a5\u5b57\u7531\u4e24\u4e2a\u5143\u7d20\u7684\u5143\u7ec4 (\u76ee\u7684 IP \u5730\u5740, \u76ee\u7684\u7aef\u53e3\u53f7) \u6807\u8bc6\uff0c\u5982\u679c\u4e24\u4e2a UDP \u62a5\u6587\u5177\u6709\u76f8\u540c\u7684\u76ee\u7684 IP \u5730\u5740\u548c\u76ee\u7684\u7aef\u53e3\u53f7\uff0c\u5b83\u4eec\u5c06\u901a\u8fc7\u76f8\u540c\u7684\u76ee\u7684\u5957\u63a5\u5b57\u88ab\u5b9a\u5411\u5230\u76f8\u540c\u7684\u8fdb\u7a0b\u3002<\/p>\n\n<ul>\n    <li><strong>\u9762\u5411\u8fde\u63a5\u7684\u591a\u8def\u590d\u7528\u4e0e\u591a\u8def\u5206\u89e3<\/strong><\/li>\n<\/ul>\n\n<p>\u4e0d\u540c\u4e8e UDP \u534f\u8bae\uff0cTCP \u6709\u4e00\u4e2a\u521d\u59cb\u5957\u63a5\u5b57\u7528\u4e8e\u5efa\u7acb\u8fde\u63a5\u8bf7\u6c42\uff0c\u5f53\u8fdb\u7a0b\u4e3b\u673a\u63a5\u6536\u5230\u5b9a\u5411\u5230\u521d\u59cb\u5957\u63a5\u5b57\u7684\u8bf7\u6c42\u8fde\u63a5\u62a5\u6587\u540e\uff0c\u521d\u59cb\u5957\u63a5\u5b57\u6839\u636e\u8be5\u62a5\u6587\u521b\u5efa\u4e00\u4e2a\u65b0\u7684\u5957\u63a5\u5b57\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span style=\"color: #24292e;\">connection<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #24292e;\">address<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">=<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #24292e;\">server<\/span><span style=\"color: #24292e;\">.accept()<\/span><\/div><\/div>\n\n<p>\u5bf9\u4e8e\u6bcf\u4e00\u4e2a\u8fde\u63a5\uff0c\u90fd\u4f1a\u521b\u5efa\u4e00\u4e2a\u5355\u72ec\u7684 TCP \u5957\u63a5\u5b57\u3002\u56e0\u6b64\u4e00\u4e2a TCP \u5957\u63a5\u5b57\u7531\u4e00\u4e2a\u56db\u4e2a\u5143\u7d20\u7684\u5143\u7ec4 (\u6e90 IP \u5730\u5740, \u6e90\u7aef\u53e3\u53f7, \u76ee\u7684 IP \u5730\u5740, \u76ee\u7684\u7aef\u53e3\u53f7) \u6807\u8bc6\uff0c\u4e24\u4e2a\u5177\u6709\u4e0d\u540c\u6e90 IP \u5730\u5740\u6216\u6e90\u7aef\u53e3\u53f7\u7684 TCP \u5230\u8fbe\u62a5\u6587\u6bb5\uff08\u9664\u4e86\u521d\u59cb\u521b\u5efa\u8fde\u63a5\u8bf7\u6c42\u7684\u62a5\u6587\u6bb5\uff09\u65f6\uff0c\u5c06\u88ab\u5b9a\u5411\u5230\u4e24\u4e2a\u4e0d\u540c\u7684\u5957\u63a5\u5b57\u3002<\/p>\n\n<blockquote>\n    <p>\u6ce8\u610f\uff0cTCP \u5728\u521b\u5efa\u4e00\u4e2a\u65b0\u7684\u8fde\u63a5\u5957\u63a5\u5b57\u65f6\uff0c\u5e76\u6ca1\u6709\u7528\u5230\u4e00\u4e2a\u65b0\u7684\u7aef\u53e3\u53f7\u3002\u5957\u63a5\u5b57\u8fd8\u662f\u4f1a\u4ece\u4e4b\u524d\u7684\u7aef\u53e3\u91cc\u53d6\u51fa\u62a5\u6587\u6bb5\uff0c\u5e76\u6839\u636e\u6807\u8bc6\u5143\u7ec4\u7684\u5185\u5bb9\u8f6c\u4ea4\u7ed9\u6b63\u786e\u7684\u8fde\u63a5\u3002<\/p>\n<\/blockquote>\n\n<p>\u8fd9\u4e5f\u5c31\u63ed\u793a\u4e86\u4e3a\u4ec0\u4e48 TCP \u5957\u63a5\u5b57\u7a0b\u5e8f\u9700\u8981\u4f7f\u7528\u4ee5\u4e0b\u4ee3\u7801\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span style=\"color: #24292e;\">server.listen(<\/span><span style=\"color: #005cc5;\">5<\/span><span style=\"color: #24292e;\">)<\/span><\/div><\/div>\n\n<p>\u6709\u65f6\u540c\u65f6\u8bf7\u6c42\u7684\u8fde\u63a5\u6570\u8fc7\u591a\uff0c\u670d\u52a1\u4e3b\u673a\u9700\u8981\u4e3a\u4e00\u4e2a\u7aef\u53e3\u7ef4\u6301\u5f88\u591a\u8fde\u63a5\uff0c\u9020\u6210\u8d1f\u8f7d\u8fc7\u5927\uff0c\u56e0\u6b64\u9700\u8981\u8be5\u4ee3\u7801\u63a7\u5236\u4e00\u4e2a TCP \u5728\u76f8\u540c\u65f6\u95f4\u5185\u7684\u6700\u5927\u8fde\u63a5\u6570\u3002<\/p>\n\n<h2>\u65e0\u8fde\u63a5\u8fd0\u8f93\uff1aUDP<\/h2>\n\n<h3>UDP \u534f\u8bae\u6982\u8ff0<\/h3>\n\n<p>UDP \u53ea\u5bf9\u8fd0\u8f93\u534f\u8bae\u505a\u6700\u5c11\u7684\u5de5\u4f5c\uff0c\u9664\u4e86\u590d\u7528\/\u5206\u89e3\u4e0e\u529f\u80fd\u4ee5\u53ca\u5c11\u91cf\u9519\u8bef\u68c0\u6d4b\u5916\uff0c\u51e0\u4e4e\u6ca1\u6709\u589e\u52a0\u522b\u7684\u529f\u80fd\u3002<\/p>\n\n<p>UDP \u4ece\u8fdb\u7a0b\u5f97\u5230\u6570\u636e\u540e\uff0c\u9644\u52a0\u4e0a\u7528\u4e8e\u591a\u8def\u590d\u7528\/\u5206\u89e3\u670d\u52a1\u7684\u6e90\u7aef\u53e3\u53f7\u5b57\u6bb5\u548c\u76ee\u7684\u7aef\u53e3\u53f7\u5b57\u6bb5\uff0c\u52a0\u4e0a\u5176\u5b83\u5b57\u6bb5\u540e\u5c06\u5f62\u6210\u7684\u62a5\u6587\u6bb5\u4ea4\u7ed9\u7f51\u7edc\u5c42\u3002\u7f51\u7edc\u5c42\u5c06\u8be5\u8fd0\u8f93\u5c42\u62a5\u6587\u6bb5\u5c01\u88c5\u5230\u4e00\u4e2a IP \u6570\u636e\u62a5\u4e2d\uff0c\u7136\u540e\u4ea4\u4ed8\u7ed9\u63a5\u6536\u4e3b\u673a\u3002\u5982\u679c\u8be5\u62a5\u6587\u6bb5\u5230\u8fbe\u63a5\u6536\u4e3b\u673a\uff0cUDP \u4f7f\u7528\u76ee\u7684\u7aef\u53e3\u53f7\u5c06\u62a5\u6587\u6bb5\u4e2d\u7684\u6570\u636e\u4ea4\u4ed8\u7ed9\u6b63\u786e\u7684\u8fdb\u7a0b\u3002<\/p>\n\n<p>\u4f7f\u7528 UDP \u65f6\uff0c\u5728\u53d1\u9001\u62a5\u6587\u524d\uff0c\u53d1\u9001\u65b9\u548c\u63a5\u6536\u65b9\u7684\u8fd0\u8f93\u5c42\u4e4b\u95f4\u6ca1\u6709\u4efb\u4f55\u901a\u4fe1\uff0c\u56e0\u6b64 UDP \u88ab\u79f0\u4e3a\u662f<strong>\u65e0\u8fde\u63a5<\/strong>\u8fd0\u8f93\u3002<\/p>\n\n<p>UDP \u4e3b\u8981\u6709\u4ee5\u4e0b\u4f18\u70b9\uff1a<\/p>\n\n<ul>\n    <li>UDP \u53ef\u4ee5\u7cbe\u786e\u5730\u63a7\u5236\u53d1\u9001\u7684\u6570\u636e\u4ee5\u53ca\u4f55\u65f6\u53d1\u9001\u6570\u636e\uff1aUDP \u4f1a\u76f4\u63a5\u53d1\u9001\u6570\u636e\uff0c\u800c TCP \u4e3a\u4e86\u4fdd\u8bc1\u6570\u636e\u80fd\u53ef\u9760\u4f20\u8f93\uff0c\u4f1a\u786e\u8ba4\u76ee\u7684\u4e3b\u673a\u63a5\u6536\u540e\u624d\u8fdb\u884c\u4e0b\u4e00\u6b21\u53d1\u9001\u3002\u5728\u4e0d\u5e0c\u671b\u6570\u636e\u4f20\u8f93\u4f1a\u6709\u8fc7\u591a\u5ef6\u8fdf\u5e76\u4e14\u80fd\u5bb9\u5fcd\u4e00\u5b9a\u4e22\u5931\u65f6\uff0c\u53ef\u4ee5\u4f7f\u7528 UDP \u3002<\/li>\n    \n    <li>UDP \u65e0\u9700\u5efa\u7acb\u8fde\u63a5\uff0c\u4e5f\u6ca1\u6709\u8fde\u63a5\u72b6\u6001\uff0c\u56e0\u6b64 UDP \u4e0d\u4f1a\u5f15\u5165\u5efa\u7acb\u8fde\u63a5\u7684\u65f6\u5ef6\uff0c\u64cd\u4f5c\u7cfb\u7edf\u4e5f\u65e0\u9700\u4e3a\u4e86\u7ef4\u62a4\u8fde\u63a5\u6267\u884c\u989d\u5916\u7684\u64cd\u4f5c\u5e76\u5360\u7528\u989d\u5916\u7684\u7f13\u5b58\uff0c\u56e0\u6b64\u53ef\u4ee5\u652f\u6301\u66f4\u591a\u6d3b\u8dc3\u7684\u8fde\u63a5\u6570\u3002<\/li>\n<\/ul>\n\n<p>UDP \u62a5\u6587\u6bb5\u76f8\u5bf9 TCP \u66f4\u52a0\u7b80\u5355\u3002\u4e0b\u56fe\u5c55\u793a\u4e86 UDP \u62a5\u6587\u6bb5\u7684\u7ed3\u6784\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-udp-message.jpg\" alt=\"\" width=\"250\">\n    <figcaption>UDP \u62a5\u6587\u6bb5\u7ed3\u6784<\/figcaption>\n<\/figure>\n\n<p>UDP \u62a5\u6587\u6bb5\u9996\u90e8\u53ea\u6709 4 \u4e2a\u5b57\u6bb5\uff0c\u6bcf\u4e2a\u5b57\u6bb5\u7531\u4e24\u4e2a\u5b57\u8282\u7ec4\u6210\u3002\u7aef\u53e3\u53f7\u5b57\u6bb5\u7528\u4e8e\u4f7f\u76ee\u7684\u4e3b\u673a\u6267\u884c\u5206\u89e3\u529f\u80fd\uff0c\u5c06\u6570\u636e\u4ea4\u7ed9\u6b63\u786e\u7684\u5e94\u7528\u8fdb\u7a0b\u3002\u7531\u4e8e\u5e94\u7528\u6570\u636e\u7684\u957f\u5ea6\u53ef\u53d8\uff0c\u56e0\u6b64\u9700\u8981\u7528\u957f\u5ea6\u5b57\u6bb5\u6307\u793a\u5728 UDP \u62a5\u6587\u6bb5\u7684\u5b57\u8282\u6570\uff08\u5305\u62ec\u9996\u90e8\uff09\u3002<\/p>\n\n<p>\u63a5\u6536\u65b9\u4f7f\u7528\u68c0\u9a8c\u548c\u6765\u68c0\u67e5\u8be5\u62a5\u6587\u6bb5\u662f\u5426\u51fa\u73b0\u5dee\u9519\u3002\u53d1\u9001\u65b9\u7684 UDP \u5bf9\u62a5\u6587\u6bb5\u4e2d\u7684\u6240\u6709 16 \u4f4d\u6570\u503c\u6309\u4e00\u5b9a\u89c4\u5f8b\u8fd0\u7b97\uff0c\u6700\u7ec8\u5f97\u5230\u4e00\u4e2a 16 \u4f4d\u7684\u7ed3\u679c\uff0c\u518d\u4e0e\u68c0\u9a8c\u548c\u5b57\u6bb5\u6bd4\u8f83\uff0c\u5982\u679c\u7ed3\u679c\u76f8\u540c\uff0c\u8bf4\u660e\u62a5\u6587\u6bb5\u5728\u4f20\u8f93\u8fc7\u7a0b\u4e2d\u5e94\u8be5\u6ca1\u6709\u53d1\u751f\u6bd4\u7279\u5dee\u9519\u3002<\/p>\n\n<p>\u7531\u4e8e\u4ece\u6e90\u5230\u76ee\u7684\u5730\u4e4b\u95f4\u7684\u6240\u6709\u94fe\u8def\u5e76\u4e0d\u80fd\u786e\u4fdd\u90fd\u63d0\u4f9b\u5dee\u9519\u68c0\u6d4b\u670d\u52a1\uff0c\u56e0\u6b64 UDP \u5728\u8bbe\u8ba1\u65f6\u5728\u8fd0\u8f93\u5c42\u63d0\u4f9b\u8be5\u529f\u80fd\uff0c\u4ece\u800c\u786e\u4fdd\u5e94\u7528\u6570\u636e\u4e0d\u4f1a\u56e0\u4e3a\u5dee\u9519\u800c\u53d1\u751f\u8bef\u89e3\u3002<\/p>\n\n<h2>\u5b9e\u9a8c\uff1a\u63a2\u7a76UDP<\/h2>\n\n<h3>\u4f7f\u7528WireShark\u5206\u6790UDP\u62a5\u6587<\/h3>\n\n<p>\u9996\u5148\u4f7f\u7528 WireShark \u5206\u6790 UDP \u6570\u636e\u5305\u7684\u7ed3\u6784\u3002\u6253\u5f00 WireShark \u6355\u83b7\u5e76\u8fc7\u6ee4\u51fa UDP \u5206\u7ec4\u5982\u4e0b\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-wireshark-udp.jpg\" alt=\"\" width=\"580\">\n<\/figure>\n\n<p>\u6709\u65f6\u8fc7\u6ee4\u7684\u5206\u7ec4\u8fd8\u5305\u62ec\u57fa\u4e8e UDP \u5b9e\u73b0\u7684\u5e94\u7528\u5c42\u534f\u8bae\u7684\u5206\u7ec4\u3002\u8fd9\u91cc\u624b\u52a8\u4f7f\u7528\u4ee3\u7801\u5728\u672c\u5730\u4e4b\u95f4\u53d1\u9001\u4e00\u4e2a UDP \u5206\u7ec4\uff0c\u5f97\u5230\u7684\u6570\u636e\u5982\u4e0a\u56fe\u6240\u793a\uff1a<\/p>\n\n<p>\u4ece\u56fe\u4e2d\u53ef\u4ee5\u770b\u51fa\uff0cUDP \u5206\u7ec4\u4e2d\u6e90\u7aef\u53e3\u53f7\u4e3a 51785\uff08\u64cd\u4f5c\u7cfb\u7edf\u968f\u673a\u5206\u914d\u7684\u5176\u5b83\u7aef\u53e3\uff09\uff0c\u76ee\u7684\u7aef\u53e3\u53f7\u4e3a 12000 \uff0cUDP \u62a5\u6587\u957f\u5ea6\u4e3a 20 \u5b57\u8282\uff08\u5305\u62ec\u9996\u90e8\uff09\uff0c\u68c0\u9a8c\u548c\u4e3a <code>0xE84D<\/code> \u3002\u5728 UDP \u62a5\u6587\u4f53\u4e2d\uff0c\u6240\u53d1\u9001\u7684\u5e94\u7528\u6570\u636e\u662f <code>Hello, world<\/code> \u3002<\/p>\n\n<h3>\u68c0\u9a8c\u5b8c\u6574\u6027<\/h3>\n\n<p>\u63a5\u4e0b\u6765\u901a\u8fc7\u5206\u6790 UDP \u68c0\u9a8c\u548c\u5b57\u6bb5\uff0c\u5224\u65ad\u6570\u636e\u662f\u5426\u5b8c\u6574\u3002<\/p>\n\n<p>UDP \u5728\u8ba1\u7b97\u68c0\u9a8c\u548c\u5b57\u6bb5\u65f6\uff0c\u4f1a\u5c06\u4e09\u4e2a\u90e8\u5206\u7684\u6570\u636e\u4e00\u8d77\u53c2\u4e0e\u8fd0\u7b97\uff1a\u4f2a\u9996\u90e8\u3001\u9996\u90e8\u548c\u6570\u636e\u90e8\u5206\u3002<\/p>\n\n<p>\u5176\u4e2d\u4f2a\u9996\u90e8\u7531\u6e90 IP \u5730\u5740\u3001\u76ee\u7684 IP \u5730\u5740\u3001\u534f\u8bae\u7c7b\u578b\uff08UDP \u534f\u8bae\u7c7b\u578b\u4f7f\u7528 <code>0x11<\/code> \u8868\u793a\uff09\u548c UDP \u5206\u7ec4\u957f\u5ea6\uff0c\u8fd9\u90e8\u5206\u5185\u5bb9\u4f1a\u53c2\u4e0e\u68c0\u9a8c\u548c\u5b57\u6bb5\u7684\u8ba1\u7b97\u3002\u5b83\u4eec\u7684\u4f4d\u7f6e\u548c\u957f\u5ea6\u5982\u4e0b\u56fe\u6240\u793a\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-udp-check-head.jpg\" alt=\"\" width=\"400\">\n<\/figure>\n\n<p>\u7136\u540e\u5c31\u53ef\u4ee5\u8ba1\u7b97\u68c0\u9a8c\u548c\u5b57\u6bb5\u4e86\u3002\u68c0\u9a8c\u548c\u8ba1\u7b97\u7684\u6b65\u9aa4\u5982\u4e0b\uff1a\u9996\u5148\u7ed3\u5408\u4f2a\u9996\u90e8\u3001\u9996\u90e8\u4ee5\u53ca\u5e94\u7528\u6570\u636e\uff0c\u5c06\u6240\u6709\u5b57\u8282\u5212\u5206\u4e3a\u6bcf 16 \u4f4d\uff0c\u5373 2 \u5b57\u8282\u7684\u5757\uff08\u82e5\u5e94\u7528\u6570\u636e\u4e2d\u7684\u5b57\u8282\u6570\u4e0d\u4e3a\u5076\u6570\uff0c\u5219\u9700\u8981\u989d\u5916\u5728\u672b\u5c3e\u586b\u5145\u4e00\u4e2a\u5168\u96f6\u5b57\u8282\uff09\u3002\u7136\u540e\uff0c\u628a\u6240\u6709 16 \u4f4d\u7684\u5757\u9010\u5757\u76f8\u52a0\uff0c\u8003\u8651\u5230\u7ed3\u679c\u53ef\u80fd\u4e0d\u6b62 16 \u4f4d\uff0c\u6b64\u65f6\u4f7f\u7528 32 \u4f4d\u7684\u503c\u63cf\u8ff0\u7ed3\u679c\uff0c\u4f46\u5c06\u8fd9 32 \u4f4d\u7684\u9ad8 16 \u4f4d\u548c\u4f4e 16 \u4f4d\u76f8\u52a0\uff0c\u62b9\u9664\u8fd9\u4e2a\u8fdb\u4f4d\u503c\uff08\u518d\u6b21\u76f8\u52a0\u4e4b\u540e\u80af\u5b9a\u4e0d\u4f1a\u518d\u53d1\u751f\u6ea2\u51fa\uff09\uff0c\u5f97\u5230\u4e00\u4e2a 16 \u4f4d\u7684\u56de\u5377\u7ed3\u679c\u3002<\/p>\n\n<p>\u6309\u987a\u5e8f\u5c06\u6240\u6709\u5757\u76f8\u52a0\uff0c\u4fbf\u53ef\u5f97\u5230\u4e00\u4e2a 16 \u4f4d\u7684\u6700\u7ec8\u7ed3\u679c\u3002\u5c06\u8fd9\u4e2a\u7ed3\u679c\u7684\u6bcf\u4e2a\u4f4d\u90fd\u53d6\u53cd\uff0c\u4fbf\u5f97\u5230\u68c0\u9a8c\u548c\u5b57\u6bb5\u7684\u503c\u3002\u6700\u540e\u5c06\u4f2a\u9996\u90e8\u548c\u7528\u4e8e\u51d1\u5076\u6570\u7684\u5b57\u8282\u4e22\u5f03\uff0c\u4fbf\u53ef\u5f97\u5230\u5b8c\u6574\u7684 UDP \u5206\u7ec4\u3002<\/p>\n\n<p>\u8003\u8651\u5230 C \u8bed\u8a00\u64cd\u4f5c\u5e95\u5c42\u5b57\u8282\u6bd4\u8f83\u65b9\u4fbf\uff0c\u8fd9\u91cc\u4f7f\u7528 C \u8bed\u8a00\u9a8c\u8bc1\u4ee5\u4e0a\u7ed3\u679c\u3002\u6309\u7167\u4ee5\u4e0a\u8bf4\u660e\uff0c\u7ed9\u5b9a\u4e00\u4e2a\u5b57\u8282\u6570\u7ec4\uff0c\u8ba1\u7b97\u68c0\u9a8c\u548c\u7684\u65b9\u6cd5\u4e3a\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span style=\"color: #6f42c1;font-weight: bold;\">uint16_t<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #6f42c1;\">checksum<\/span><span style=\"color: #24292e;\">(<\/span><span style=\"color: #6f42c1;font-weight: bold;\">uint8_t<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">*<\/span><span style=\"color: #e36209;\">packet<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #d73a49;font-weight: bold;\">int<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #e36209;\">length<\/span><span style=\"color: #24292e;\">) {<\/span><\/div><div><span style=\"color: #24292e;\">&#160; &#160; <\/span><span style=\"color: #6f42c1;font-weight: bold;\">uint32_t<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #24292e;\">sum<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">=<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #005cc5;\">0<\/span><span style=\"color: #24292e;\">;<\/span><\/div><div><span style=\"color: #24292e;\">&#160; &#160; <\/span><span style=\"color: #d73a49;font-weight: bold;\">for<\/span><span style=\"color: #24292e;\"> (<\/span><span style=\"color: #6f42c1;font-weight: bold;\">uint16_t<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #24292e;\">i<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">=<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #005cc5;\">0<\/span><span style=\"color: #24292e;\">; <\/span><span style=\"color: #24292e;\">i<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">&lt;<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #e36209;\">length<\/span><span style=\"color: #24292e;\">; <\/span><span style=\"color: #24292e;\">i<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">+=<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #005cc5;\">2<\/span><span style=\"color: #24292e;\">) {<\/span><\/div><div><span style=\"color: #24292e;\">&#160; &#160; &#160; &#160; <\/span><span style=\"color: #24292e;\">sum<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">+=<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">*<\/span><span style=\"color: #24292e;\">((<\/span><span style=\"color: #6f42c1;font-weight: bold;\">uint16_t<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">*<\/span><span style=\"color: #24292e;\">)(<\/span><span style=\"color: #e36209;\">packet<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">+<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #24292e;\">i<\/span><span style=\"color: #24292e;\">));<\/span><\/div><div><span style=\"color: #24292e;\">&#160; &#160; &#160; &#160; <\/span><span style=\"color: #24292e;\">sum<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">=<\/span><span style=\"color: #24292e;\"> (<\/span><span style=\"color: #24292e;\">sum<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">&gt;&gt;<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #005cc5;\">16<\/span><span style=\"color: #24292e;\">) <\/span><span style=\"color: #d73a49;\">+<\/span><span style=\"color: #24292e;\"> (<\/span><span style=\"color: #24292e;\">sum<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">&amp;<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">0x<\/span><span style=\"color: #005cc5;\">ffff<\/span><span style=\"color: #24292e;\">);<\/span><\/div><div><span style=\"color: #24292e;\">&#160; &#160; }<\/span><\/div><div><span style=\"color: #24292e;\">&#160; &#160; <\/span><span style=\"color: #d73a49;font-weight: bold;\">return<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">~<\/span><span style=\"color: #24292e;\">sum<\/span><span style=\"color: #24292e;\">;<\/span><\/div><div><span style=\"color: #24292e;\">}<\/span><\/div><\/div>\n\n<p>\u7a0b\u5e8f\u4e2d\u5c06\u4e24\u4e2a\u5b57\u8282\u5f53\u505a\u4e00\u4e2a\u5757\u5904\u7406\uff0c\u6bcf\u6b21\u8ba1\u7b97\u540e\u5c06 32 \u4f4d\u7ed3\u679c\u7684\u9ad8 16 \u4f4d\u548c\u4f4e 16 \u4f4d\u76f8\u52a0\u3002<\/p>\n\n<p>\u9996\u90e8\u548c\u6570\u636e\u90e8\u5206\u53ef\u4ee5\u5728 WireShark \u4e2d\u53f3\u952e\u4e0b\u65b9\u7684\u6761\u76ee\u7a97\u53e3\uff0c\u901a\u8fc7\u201c\u5bfc\u51fa\u5206\u7ec4\u5b57\u8282\u6d41\u201d\u4ee5\u4e8c\u8fdb\u5236\u7684\u5f62\u5f0f\u4fdd\u5b58\u5728\u78c1\u76d8\u4e0a\uff0c\u4fdd\u5b58\u7684\u4e8c\u8fdb\u5236\u5185\u5bb9\u4e3a\u6700\u4e0b\u65b9\u5341\u516d\u8fdb\u5236\u67e5\u770b\u5668\u4e2d\u84dd\u8272\u9ad8\u4eae\u7684\u90e8\u5206\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-wireshark-udp-export.jpg\" alt=\"\" width=\"570\">\n<\/figure>\n\n<p>\u8fd9\u91cc\u5c06 UDP \u9996\u90e8\u548c\u6570\u636e\u5206\u5f00\u4fdd\u5b58\uff0c\u5e76\u4f7f\u7528\u5f00\u6e90\u5341\u516d\u8fdb\u5236\u7f16\u8f91\u5668 ImHex \u4e3a\u9996\u90e8\u6dfb\u52a0\u4e0a\u4f2a\u9996\u90e8\u90e8\u5206\u3002\u5728 ImHex \u4e2d\uff0c\u4e8e 0x0 \u4f4d\u7f6e\u63d2\u5165 0xC \u4e2a\u5b57\u8282\uff0c\u8fd9\u90e8\u5206\u5b57\u8282\u7684\u5185\u5bb9\u6309\u987a\u5e8f\u4e3a\uff1a\u6e90 IP \u5730\u5740 <code>0x7F 00 00 01<\/code> \uff1b\u76ee\u7684 IP \u5730\u5740 <code>0x7F 00 00 01<\/code> \uff1b\u534f\u8bae\u7c7b\u578b <code>0x00 11<\/code> \uff1bUDP \u957f\u5ea6 <code>0x00 14<\/code> \u3002\u6700\u540e\uff0c\u7531\u4e8e\u6b64\u65f6\u8fd8\u6ca1\u6709\u8ba1\u7b97\u68c0\u9a8c\u548c\u5b57\u6bb5\uff0c\u4e0d\u8981\u5fd8\u8bb0\u5c06\u9996\u90e8\u7684\u68c0\u9a8c\u548c\u5b57\u6bb5\u7f6e\u4e3a <code>0x00 00<\/code> \uff0c\u5982\u4e0b\u6240\u793a\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-udp-hex-head.jpg\" alt=\"\" width=\"570\">\n<\/figure>\n\n<p>\u7136\u540e\uff0c\u4f7f\u7528\u7a0b\u5e8f\u8bfb\u5165\u4fdd\u5b58\u7684 UDP \u9996\u90e8\u548c\u5e94\u7528\u6570\u636e\uff0c\u5e76\u62fc\u63a5\u5728\u540c\u4e00\u4e2a\u6570\u7ec4\u4e2d\uff0c\u8ba1\u7b97\u68c0\u9a8c\u548c\u5e76\u6253\u5370\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span style=\"color: #6f42c1;\">FILE<\/span><span style=\"color: #d73a49;\">*<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #24292e;\">fp_head<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">=<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #6f42c1;\">fopen<\/span><span style=\"color: #24292e;\">(<\/span><span style=\"color: #032f62;\">\"udp-head.bin\"<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #032f62;\">\"r\"<\/span><span style=\"color: #24292e;\">);<\/span><\/div><div><span style=\"color: #6f42c1;\">FILE<\/span><span style=\"color: #d73a49;\">*<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #24292e;\">fp_body<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">=<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #6f42c1;\">fopen<\/span><span style=\"color: #24292e;\">(<\/span><span style=\"color: #032f62;\">\"udp-body.bin\"<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #032f62;\">\"r\"<\/span><span style=\"color: #24292e;\">);<\/span><\/div><div><span style=\"color: #d73a49;font-weight: bold;\">#define<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #6f42c1;\">UDP_HEAD_LENGTH<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #005cc5;\">20<\/span><\/div><div><span style=\"color: #d73a49;font-weight: bold;\">#define<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #6f42c1;\">UDP_BODY_LENGTH<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #005cc5;\">12<\/span><\/div><div><span style=\"color: #6f42c1;font-weight: bold;\">uint8_t<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #24292e;\">udp_packet<\/span><span style=\"color: #24292e;\">[<\/span><span style=\"color: #6f42c1;\">UDP_HEAD_LENGTH<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">+<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #6f42c1;\">UDP_BODY_LENGTH<\/span><span style=\"color: #24292e;\">];<\/span><\/div><div><span style=\"color: #6f42c1;\">fread<\/span><span style=\"color: #24292e;\">(<\/span><span style=\"color: #24292e;\">udp_packet<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #005cc5;\">1<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #6f42c1;\">UDP_HEAD_LENGTH<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #24292e;\">fp_head<\/span><span style=\"color: #24292e;\">);<\/span><\/div><div><span style=\"color: #6f42c1;\">fread<\/span><span style=\"color: #24292e;\">(<\/span><span style=\"color: #24292e;\">udp_packet<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">+<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #6f42c1;\">UDP_HEAD_LENGTH<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #005cc5;\">1<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #6f42c1;\">UDP_BODY_LENGTH<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #24292e;\">fp_body<\/span><span style=\"color: #24292e;\">);<\/span><\/div><div><span style=\"color: #6f42c1;\">printf<\/span><span style=\"color: #24292e;\">(<\/span><span style=\"color: #032f62;\">\"<\/span><span style=\"color: #032f62;\">0x<\/span><span style=\"color: #005cc5;\">%x<\/span><span style=\"color: #032f62;\">\"<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #6f42c1;\">checksum<\/span><span style=\"color: #24292e;\">(<\/span><span style=\"color: #24292e;\">udp_packet<\/span><span style=\"color: #24292e;\">, <\/span><span style=\"color: #6f42c1;\">UDP_HEAD_LENGTH<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #d73a49;\">+<\/span><span style=\"color: #24292e;\"> <\/span><span style=\"color: #6f42c1;\">UDP_BODY_LENGTH<\/span><span style=\"color: #24292e;\">));<\/span><\/div><\/div>\n\n<p>\u8ba1\u7b97\u7684\u672c\u6b21 UDP \u5206\u7ec4\u68c0\u9a8c\u548c\u4e3a\uff1a<\/p>\n\n<div class=\"codeblock code-console\">$ gcc udp_checkedsum.c -o udp_checkedsum\n.\/udp_checkedsum\n0x4de8\n<\/div>\n\n<p>\u5bf9\u6bd4 WireShark \u7684\u6355\u83b7\u7ed3\u679c\uff0c\u6ce8\u610f\u5230 WireShark \u4e2d\u7684\u68c0\u9a8c\u548c\u5b57\u6bb5\u4e3a <code>0xe84d<\/code> \uff0c\u8fd9\u662f\u7531\u4e8e\u5728\u7f51\u7edc\u53d1\u9001\u65f6\uff0c\u4e00\u822c\u901a\u8fc7 <code>htons()<\/code> \u7b49\u51fd\u6570\u5c06\u9ad8\u5b57\u8282\u5148\u53d1\u9001\uff0c\u56e0\u6b64\u5f97\u5230\u7684\u7ed3\u679c\u548c\u8ba1\u7b97\u51fa\u7684\u9ad8\u4f4e\u5b57\u8282\u987a\u5e8f\u76f8\u53cd\u3002<\/p>\n\n<blockquote>\n    <p>\u5982\u679c\u4f7f\u7528 WireShark \u6355\u83b7\u5230\u7684\u662f\u53d1\u9001\u7aef\u7684 UDP \u5206\u7ec4\uff0c\u90a3\u4e48\u53ef\u80fd\u4f1a\u51fa\u73b0\u8ba1\u7b97\u7ed3\u679c\u548c WireShark \u663e\u793a\u7684\u7ed3\u679c\u6839\u672c\u4e0d\u5bf9\u7684\u60c5\u51b5\u3002\u8fd9\u662f\u7531\u4e8e\u73b0\u4ee3\u7684\u8ba1\u7b97\u673a\u8ba1\u7b97\u68c0\u9a8c\u548c\u901a\u5e38\u7531\u7f51\u5361\u6267\u884c\uff0c\u4ee5\u964d\u4f4e CPU \u7684\u8d1f\u62c5\u3002\u800c WireShark \u901a\u5e38\u6355\u83b7\u7684\u90fd\u662f CPU \u4e2d\u751f\u6210\u7684\u5206\u7ec4\uff0c\u6b64\u65f6\u68c0\u9a8c\u548c\u5b57\u6bb5\u8fd8\u6ca1\u6709\u8ba1\u7b97\uff0c\u56e0\u6b64\u4e0e\u5b9e\u9645\u4e0d\u7b26\u3002<\/p>\n<\/blockquote>\n\n<p>\u5c3d\u7ba1\u68c0\u9a8c\u548c\u5b57\u6bb5\u4e0d\u80fd\u5b8c\u6574\u5730\u53cd\u5e94\u5206\u7ec4\u7684\u539f\u8c8c\uff0c\u4f46\u662f\u5206\u7ec4\u53d1\u751f\u6bd4\u7279\u5dee\u9519\u7684\u51e0\u7387\u672c\u8eab\u5f88\u5c0f\uff0c\u5982\u679c\u6709\u5355\u4e2a\u6bd4\u7279\u53d1\u751f\u5dee\u9519\uff0c\u90a3\u4e48\u68c0\u9a8c\u548c\u4e00\u5b9a\u4e0e\u5b9e\u9645\u8ba1\u7b97\u7ed3\u679c\u4e0d\u7b26\uff1b\u591a\u4e2a\u6bd4\u7279\u53d1\u751f\u5dee\u9519\u7684\u6982\u7387\u5f88\u5c0f\uff0c\u6b63\u597d\u7b26\u5408\u68c0\u9a8c\u548c\u7684\u6982\u7387\u5c31\u975e\u5e38\u5c0f\u4e86\uff0c\u8fd9\u79cd\u9519\u8bef\u51e0\u4e4e\u4e0d\u4f1a\u5f71\u54cd\u5b9e\u9645\u7684\u7f51\u7edc\u670d\u52a1\u3002<\/p>\n\n<h2>\u53ef\u9760\u6570\u636e\u4f20\u8f93\u539f\u7406<\/h2>\n\n<p>UDP \u53ea\u786e\u4fdd\u6570\u636e\u80fd\u6b63\u786e\u88ab\u63a5\u6536\uff0c\u4f46\u51e0\u4e4e\u6ca1\u6709\u63d0\u4f9b\u786e\u4fdd\u6570\u636e\u5b8c\u6574\u3001\u6709\u5e8f\u9001\u8fbe\u7684\u670d\u52a1\u3002\u4e0b\u9762\u901a\u8fc7\u7814\u7a76\u53ef\u9760\u6570\u636e\u4f20\u8f93\u539f\u7406\uff0c\u8ba8\u8bba\u8fd0\u8f93\u5c42\u4e3a\u4e86\u5b9e\u73b0\u53ef\u9760\u6570\u636e\u4f20\u8f93\u9700\u8981\u63d0\u4f9b\u54ea\u4e9b\u670d\u52a1\u3002<\/p>\n\n<p>\u6700\u7b80\u5355\u7684\u60c5\u51b5\u4e0b\uff0c\u5728\u5e95\u5c42\u4fe1\u9053\u662f\u5b8c\u5168\u53ef\u9760\u7684 \u3002\u8fd9\u79cd\u60c5\u51b5\u4e0b\uff0c\u8fd0\u8f93\u5c42\u53ea\u9700\u8981\u63a5\u53d7\u6765\u81ea\u5e94\u7528\u5c42\u7684\u6570\u636e\uff0c\u6dfb\u52a0\u9996\u90e8\u540e\u4ea7\u751f\u4e00\u4e2a\u5305\u542b\u8be5\u6570\u636e\u7684\u5206\u7ec4\uff0c\u5e76\u5c06\u5206\u7ec4\u53d1\u9001\u5230\u4fe1\u9053\u4e2d\u5373\u53ef\u3002\u800c\u5728\u63a5\u6536\u7aef\uff0c\u53ea\u9700\u8981\u4ece\u5e95\u5c42\u4fe1\u9053\u63a5\u6536\u8fd9\u4e2a\u5206\u7ec4\uff0c\u4ece\u5206\u7ec4\u4e2d\u53d6\u51fa\u6570\u636e\u5e76\u4e0a\u4f20\u7ed9\u5e94\u7528\u5c42\u3002<\/p>\n\n<p>\u5728\u8fd9\u4e2a\u6700\u7b80\u5355\u7684\u60c5\u51b5\u4e2d\uff0c\u4e00\u4e2a\u5206\u7ec4\u4e0e\u4e00\u4e2a\u5e94\u7528\u6570\u636e\u6ca1\u5dee\u522b\uff0c\u800c\u4e14\u6240\u6709\u5206\u7ec4\u662f\u4ece\u53d1\u9001\u65b9\u6d41\u5411\u63a5\u6536\u65b9\u3002\u6709\u4e86\u5b8c\u5168\u53ef\u9760\u7684\u4fe1\u9053\u4e0d\u5fc5\u62c5\u5fc3\u51fa\u73b0\u5dee\u9519\uff0c\u63a5\u6536\u7aef\u5c31\u4e0d\u9700\u8981\u63d0\u4f9b\u4efb\u4f55\u53cd\u9988\u4fe1\u606f\u7ed9\u53d1\u9001\u65b9\uff0c\u63a5\u6536\u65b9\u63a5\u6536\u6570\u636e\u7684\u901f\u7387\u53ea\u9700\u8981\u4e0e\u53d1\u9001\u65b9\u53d1\u9001\u6570\u636e\u7684\u901f\u7387\u4e00\u6837\u5feb\u5c31\u53ef\u4ee5\u4e86\u3002<\/p>\n\n<p>\u7136\u800c\uff0c\u5b9e\u9645\u4e0a\u5b8c\u5168\u53ef\u4fe1\u7684\u5e95\u5c42\u4fe1\u9053\u662f\u4e0d\u5b58\u5728\u7684\uff0c\u5728\u7269\u7406\u635f\u574f\u3001\u8f6f\u4ef6\u5dee\u9519\u7b49\u60c5\u51b5\u4e0b\uff0c\u5728\u5206\u7ec4\u7684\u4f20\u8f93\u3001\u4f20\u64ad\u6216\u7f13\u5b58\u7684\u8fc7\u7a0b\u4e2d\u5206\u7ec4\u4e2d\u7684\u6bd4\u7279\u5f80\u5f80\u53ef\u80fd\u53d7\u635f\u3002\u6b64\u65f6\u4ec5\u8003\u8651\u6bd4\u7279\u53d7\u635f\uff0c\u4f46\u6240\u6709\u53d1\u9001\u7684\u5206\u7ec4\u5c06\u6309\u5176\u53d1\u9001\u7684\u987a\u5e8f\u88ab\u63a5\u6536\uff0c\u90a3\u4e48\u5c31\u9700\u8981\u4e00\u4e9b\u989d\u5916\u7684\u529f\u80fd\u6765\u5e94\u5bf9\u6bd4\u7279\u53d7\u635f\u7684\u60c5\u51b5\uff1a<\/p>\n\n<ul>\n    <li><strong>\u5dee\u9519\u68c0\u6d4b<\/strong>\uff1a\u9996\u5148\u9700\u8981\u4e00\u79cd\u673a\u5236\u4ee5\u4f7f\u63a5\u6536\u65b9\u68c0\u6d4b\u5230\u4f55\u65f6\u51fa\u73b0\u4e86\u6bd4\u7279\u5dee\u9519\uff0c\u4f8b\u5982 UDP \u7684\u68c0\u9a8c\u548c\u5b57\u6bb5\u6b63\u662f\u4e3a\u4e86\u8fd9\u4e2a\u76ee\u7684\u3002\u56e0\u6b64\u8fd9\u5c31\u8981\u6c42\u5206\u7ec4\u4e2d\u6709\u989d\u5916\u7684\u68c0\u9a8c\u548c\u5b57\u6bb5\u4ece\u53d1\u9001\u65b9\u53d1\u9001\u5230\u63a5\u6536\u65b9<\/li>\n    <li><strong>\u63a5\u6536\u65b9\u53cd\u9988<\/strong>\uff1a\u4e3a\u4e86\u8ba9\u53d1\u9001\u65b9\u4e86\u89e3\u63a5\u6536\u65b9\u662f\u5426\u6b63\u786e\u63a5\u6536\u5206\u7ec4\uff0c\u63a5\u6536\u65b9\u9700\u8981\u63d0\u4f9b\u660e\u786e\u7684\u53cd\u9988\u4fe1\u606f\u7ed9\u53d1\u9001\u65b9\uff0c\u4f8b\u5982\u53d1\u9001<strong>\u80af\u5b9a\u786e\u8ba4<\/strong>(positive acknowledgment, ACK)\u548c<strong>\u5426\u5b9a\u786e\u8ba4<\/strong>(negative acknowledgment, NACK)\uff0c\u8fd9\u79cd\u63a7\u5236\u62a5\u6587\u4f7f\u5f97\u63a5\u6536\u65b9\u53ef\u4ee5\u8ba9\u53d1\u9001\u65b9\u77e5\u9053\u54ea\u4e9b\u5185\u5bb9\u88ab\u6b63\u786e\u63a5\u6536\uff0c\u54ea\u4e9b\u5185\u5bb9\u63a5\u6536\u6709\u8bef\u5e76\u9700\u8981\u91cd\u590d\u3002\u5728\u6700\u7b80\u5355\u7684\u60c5\u51b5\u4e0b\uff0c\u53d1\u9001\u65b9\u6bcf\u53d1\u9001\u4e00\u4e2a\u5206\u7ec4\uff0c\u5c31\u7b49\u5f85\u63a5\u6536\u65b9\u54cd\u5e94\u662f\u5426\u6b63\u786e\u63a5\u6536\u5230\u4e86\u5206\u7ec4\uff0c\u90a3\u4e48\u63a5\u6536\u65b9\u7684\u54cd\u5e94\u62a5\u6587\u53ea\u9700\u8981\u4e00\u4e2a\u6bd4\u7279\u957f\u7684\u5e03\u5c14\u503c<\/li>\n    <li><strong>\u91cd\u4f20<\/strong>\uff1a\u63a5\u6536\u65b9\u6536\u5230\u6709\u5dee\u9519\u7684\u5206\u7ec4\u65f6\uff0c\u53d1\u9001\u65b9\u5c06\u91cd\u4f20\u8be5\u5206\u7ec4\u6587<\/li>\n<\/ul>\n\n<p>\u5728\u8ba1\u7b97\u673a\u7f51\u7edc\u73af\u5883\u4e2d\uff0c\u57fa\u4e8e\u8fd9\u6837\u91cd\u4f20\u673a\u5236\u7684\u53ef\u9760\u6570\u636e\u4f20\u8f93\u534f\u8bae\u79f0\u4e3a\u81ea\u52a8\u91cd\u4f20\u8bf7\u6c42(Automatic Repeat reQuest, ARQ)\u534f\u8bae\u3002<\/p>\n\n<p>\u4f7f\u7528\u4ee5\u4e0a\u5dee\u9519\u68c0\u9a8c\u65f6\uff0c\u53d1\u9001\u7aef\u6709\u4e24\u79cd\u72b6\u6001\uff1a\u5b83\u53ef\u80fd\u6b63\u7b49\u5f85\u6765\u81ea\u5e94\u7528\u5c42\u4f20\u4e0b\u6765\u7684\u6570\u636e\uff0c\u4ea7\u751f\u5305\u542b\u5f85\u53d1\u9001\u6570\u636e\u548c\u68c0\u9a8c\u548c\u7684\u5206\u7ec4\u5e76\u6267\u884c\u53d1\u9001\u64cd\u4f5c\uff1b\u4e5f\u53ef\u80fd\u7b49\u5f85\u6765\u81ea\u63a5\u6536\u65b9\u7684\u53cd\u9988\u5206\u7ec4\uff1a\u5982\u679c\u6536\u5230\u4e00\u4e2a ACK \u5206\u7ec4\uff0c\u5219\u53d1\u9001\u65b9\u77e5\u9053\u6700\u8fd1\u53d1\u9001\u7684\u5206\u7ec4\u5df3\u88ab\u6b63\u786e\u63a5\u6536\uff0c\u56e0\u6b64\u53ef\u4ee5\u7ee7\u7eed\u7b49\u5f85\u540e\u7eed\u6765\u81ea\u5e94\u7528\u5c42\u7684\u6570\u636e\uff1b\u5982\u679c\u6536\u5230 NACK \u5206\u7ec4\uff0c\u8be5\u534f\u8bae\u91cd\u4f20\u4e0a\u4e00\u4e2a\u5206\u7ec4\u5e76\u91cd\u590d\u7b49\u5f85\u63a5\u65b9\u7684\u54cd\u5e94\u5206\u7ec4\u3002\u6ce8\u610f\uff0c\u5f53\u53d1\u9001\u65b9\u5904\u4e8e\u7b49\u5f85\u53cd\u9988\u54cd\u5e94\u7684\u72b6\u6001\u65f6\uff0c\u5b83\u4e0d\u80fd\u4ece\u5e94\u7528\u5c42\u83b7\u5f97\u66f4\u591a\u7684\u6570\u636e\uff0c\u4ec5\u5f53\u63a5\u6536\u5230 ACK \u79bb\u5f00\u8be5\u72b6\u6001\u65f6\u624d\u80fd\u7ee7\u7eed\u63a5\u6536\u3002\u56e0\u6b64\uff0c\u53d1\u9001\u65b9\u5c06\u4e0d\u4f1a\u53d1\u9001\u65b0\u7684\u6570\u636e\uff0c\u9664\u975e\u53d1\u9001\u65b9\u786e\u4fe1\u63a5\u6536\u65b9\u5df2\u6b63\u786e\u63a5\u6536\u5f53\u524d\u5206\u7ec4\u3002\u6709\u7740\u8fd9\u79cd\u884c\u4e3a\u7684\u534f\u8bae\u88ab\u79f0\u4e3a\u505c\u7b49(stop-and-wait)\u534f\u8bae<\/p>\n\n<p>\u6b64\u65f6\u63a5\u6536\u65b9\u7684\u5904\u7406\u6bd4\u8f83\u7b80\u5355\uff0c\u5b83\u53ea\u9700\u8981\u6839\u636e\u6536\u5230\u7684\u5206\u7ec4\u662f\u5426\u53d7\u635f\u56de\u7b54 ACK \u6216 NACK \u5373\u53ef\u3002\u4e0b\u56fe\u5c55\u793a\u4e86\u8fd9\u79cd\u6700\u7b80\u5355\u7684\u53ef\u9760\u6570\u636e\u4f20\u8f93\u534f\u8bae\u7684\u901a\u4fe1\u8fc7\u7a0b\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-rdt-2.0.jpg\" alt=\"\" width=\"380\">\n<\/figure>\n\n<hr>\n\n<p>\u4ee5\u4e0a\u8bbe\u8ba1\u7684\u5177\u6709\u5dee\u9519\u68c0\u6d4b\u4e0e\u6062\u590d\u7684\u8fd0\u8f93\u5c42\u534f\u8bae\u770b\u8d77\u6765\u5df2\u7ecf\u53ef\u4ee5\u6b63\u5e38\u5de5\u4f5c\u4e86\uff0c\u4f46\u662f\u5b83\u5b58\u5728\u4e00\u4e2a\u81f4\u547d\u7684\u7f3a\u9677\uff1a\u8be5\u534f\u8bae\u5e76\u6ca1\u6709\u8003\u8651\u5230\u54cd\u5e94\u5206\u7ec4\u635f\u574f\u7684\u53ef\u80fd\u6027\uff0c\u800c\u53d1\u9001\u65b9\u5374\u6ca1\u6709\u80fd\u529b\u77e5\u9053\u8fd9\u4e2a\u54cd\u5e94\u662f\u5426\u53d7\u635f\uff0c\u8fdb\u800c\u65e0\u6cd5\u77e5\u9053\u63a5\u6536\u65b9\u662f\u5426\u6b63\u786e\u63a5\u6536\u4e86\u4e0a\u4e00\u5757\u53d1\u9001\u7684\u6570\u636e\u3002<\/p>\n\n<p>\u4e00\u4e2a\u7b80\u5355\u7684\u89e3\u51b3\u65b9\u6cd5\u662f\u5728\u53d1\u9001\u7aef\u4e5f\u5f15\u5165 ACK\/NACK \u673a\u5236\uff0c\u4f46\u662f\u8fd9\u79cd\u60c5\u51b5\u4e0b\u5c31\u5fc5\u987b\u5728\u62a5\u6587\u4e2d\u589e\u52a0\u4e00\u4e2a\u5b57\u6bb5\uff0c\u4ee5\u533a\u5206\u53d1\u9001\u65b9\u7684\u6570\u636e\u548c\u54cd\u5e94\uff1b\u800c\u4e14\u53d1\u9001\u65b9\u548c\u63a5\u6536\u65b9\u90fd\u5b58\u5728 ACK\/NACK \uff0c\u8bbe\u8ba1\u4e0d\u5f53\u65f6\u5f80\u5f80\u5bb9\u6613\u5f15\u8d77 ACK\/NACK \u7684\u4e0d\u65ad\u9012\u5f52\uff0c\u5f62\u6210\u6b7b\u5faa\u73af\u3002<\/p>\n\n<p>\u6216\u8005\u5e72\u8106\u5728\u54cd\u5e94\u4e0d\u660e\u65f6\u91cd\u4f20\u5206\u7ec4\uff0c\u4f46\u8fd9\u79cd\u5197\u4f59\u5206\u7ec4(duplicate packet)\u65e0\u6cd5\u5224\u65ad\u662f\u65b0\u7684\u5206\u7ec4\u8fd8\u662f\u91cd\u4f20\u7684\u5206\u7ec4\u3002\u8fd8\u53ef\u4ee5\u589e\u52a0\u8db3\u591f\u7684\u6821\u9a8c\u548c\u6bd4\u7279\uff0c\u4f7f\u53d1\u9001\u65b9\u53ef\u4ee5\u68c0\u6d4b\u751a\u81f3\u6062\u590d\u5dee\u9519\uff0c\u4e0d\u8fc7\u8fc7\u5927\u7684\u68c0\u9a8c\u548c\u5b57\u6bb5\u53ef\u80fd\u4f1a\u4f7f\u5206\u7ec4\u8fc7\u4e8e\u81c3\u80bf\u3002<\/p>\n\n<p>\u5bf9\u6b64\uff0c\u73b0\u4ee3\u8ba1\u7b97\u673a\u7f51\u7edc\u7ed9\u51fa\u7684\u89e3\u51b3\u65b9\u6848\u662f\u4ee5\u4e0a\u7684\u7efc\u5408\u3002\u5305\u62ec TCP \u5728\u5185\u7684\u51e0\u4e4e\u6240\u6709\u73b0\u6709\u7684\u6570\u636e\u4f20\u8f93\u534f\u8bae\u4e2d\uff0c\u90fd\u5728\u6570\u636e\u5206\u7ec4\u4e2d\u6dfb\u52a0\u4e00\u4e2a\u6570\u636e\u5206\u7ec4\u7684\u5e8f\u53f7\u5b57\u6bb5\uff0c\u63a5\u6536\u65b9\u53ea\u9700\u8981\u68c0\u67e5\u5e8f\u53f7\u5373\u53ef\u786e\u5b9a\u6536\u5230\u7684\u5206\u7ec4\u662f\u5426\u662f\u4e00\u6b21\u91cd\u4f20\u3002\u5bf9\u4e8e\u505c\u7b49\u534f\u8bae\u8fd9\u79cd\u7b80\u5355\u60c5\u51b5\uff0c\u53ea\u9700\u8981 1 \u6bd4\u7279\u6807\u8bc6\u53d1\u9001\u65b9\u662f\u5426\u6b63\u5728\u91cd\u4f20\u524d\u4e00\u4e2a\u53d1\u9001\u5206\u7ec4\u5c31\u8db3\u591f\u4e86\u3002\u5728\u4fe1\u9053\u4e0d\u4e22\u5206\u7ec4\u7684\u60c5\u51b5\u4e0b\uff0c\u53d1\u9001\u65b9\u6240\u63a5\u6536\u5230\u7684 ACK\/NACK \u5206\u7ec4\u54cd\u5e94\u5176\u6700\u8fd1\u53d1\u9001\u7684\u6570\u636e\u3002\u540c\u65f6\uff0c\u54cd\u5e94\u5206\u7ec4\u4e5f\u9700\u8981\u52a0\u4e0a\u68c0\u9a8c\u548c\u5b57\u6bb5\uff0c\u4ee5\u9632\u6b62\u5728\u4f20\u8f93\u7684\u8fc7\u7a0b\u4e2d ACK \u635f\u574f\u53d8\u6210 NACK \u6216\u76f8\u53cd\u60c5\u51b5\u7684\u53d1\u751f\u3002<\/p>\n\n<p>\u7531\u4e8e\u53d1\u9001\u65b9\u53ef\u80fd\u53d1\u9001\u65b0\u7684\u5206\u7ec4\uff0c\u4e5f\u53ef\u80fd\u91cd\u4f20\u4e0a\u4e00\u4e2a\u5206\u7ec4\uff0c\u56e0\u6b64\u53d1\u9001\u65b9\u548c\u63a5\u6536\u65b9\u7684\u72b6\u6001\u6570\u90fd\u662f\u4ee5\u524d\u7684\u4e24\u500d\u3002\u4e0d\u8fc7\u8fd9\u4e24\u7c7b\u72b6\u6001\u4e0b\u5904\u7406\u7684\u52a8\u4f5c\u662f\u76f8\u4f3c\u7684\uff0c\u53ea\u662f\u5185\u5bb9\u4e0d\u540c\uff1a\u5f53\u63a5\u6536\u5230\u6b63\u786e\u7684\u5206\u7ec4\u65f6\uff0c\u63a5\u6536\u65b9\u5bf9\u6240\u63a5\u6536\u7684\u5206\u7ec4\u53d1\u9001\u80af\u5b9a\u786e\u8ba4\uff1b\u5982\u679c\u6536\u5230\u53d7\u635f\u7684\u5206\u7ec4\uff0c\u5219\u63a5\u6536\u65b9\u5c06\u53d1\u9001\u5426\u5b9a\u786e\u8ba4\u3002\u4e0b\u56fe\u5c55\u793a\u4e86\u6539\u8fdb\u540e\u7684\u53ef\u9760\u6570\u636e\u4f20\u8f93\u534f\u8bae\u7684\u901a\u4fe1\u8fc7\u7a0b\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-rdt-2.1.jpg\" alt=\"\" width=\"360\">\n<\/figure>\n\n<p>\u5982\u679c\u4e0d\u53d1\u9001 NACK \uff0c\u53ef\u4ee5\u5bf9\u4e0a\u6b21\u6b63\u786e\u63a5\u6536\u7684\u5206\u7ec4\u53d1\u9001\u4e00\u4e2a\u5197\u4f59ACK(duplicate ACK)\uff0c\u8868\u793a\u6b63\u786e\u63a5\u6536\u5230\u88ab\u786e\u8ba4\u4e24\u6b21\u7684\u5206\u7ec4\u540e\u9762\u7684\u5206\u7ec4\u3002<\/p>\n\n<hr>\n\n<p>\u9664\u4e86\u6bd4\u7279\u53d7\u635f\u5916\uff0c\u5b9e\u9645\u7684\u5e95\u5c42\u4fe1\u9053\u8fd8\u4f1a\u4e22\u5305\uff0c\u8fd9\u5c31\u9700\u8981\u8fd0\u8f93\u5c42\u63d0\u4f9b\u68c0\u6d4b\u4e22\u5305\u4ee5\u53ca\u5bf9\u4e22\u5305\u7684\u5f25\u8865\u529f\u80fd\u3002<\/p>\n\n<p>\u89e3\u51b3\u4e22\u5305\u7684\u65b9\u6cd5\u6709\u5f88\u591a\uff0c\u4ee5\u4e0b\u91c7\u7528\u53d1\u9001\u65b9\u89e3\u51b3\u4e22\u5305\u7684\u65b9\u5f0f\u3002\u5047\u5b9a\u53d1\u9001\u65b9\u7684\u5206\u7ec4\u6216\u63a5\u6536\u65b9\u5bf9\u8be5\u5206\u7ec4\u7684 ACK \u53d1\u751f\u4e86\u4e22\u5931\uff0c\u5728\u8fd9\u4e24\u79cd\u60c5\u51b5\u4e0b\uff0c\u53d1\u9001\u65b9\u5728\u7b49\u5f85\u4e00\u6bb5\u65f6\u95f4\u540e\u90fd\u6536\u4e0d\u5230\u63a5\u6536\u65b9\u7684\u54cd\u5e94\uff0c\u90a3\u4e48\u5b83\u5c31\u9700\u8981\u91cd\u4f20\u8be5\u6570\u636e\u5206\u7ec4\u3002<\/p>\n\n<p>\u4f46\u95ee\u9898\u5728\u4e8e\u5982\u4f55\u786e\u5b9a\u8fd9\u4e2a\u8d85\u65f6\u7684\u65f6\u95f4\uff0c\u9009\u53d6\u7684\u8d85\u65f6\u65f6\u957f\u8fc7\u957f\u53ef\u80fd\u4f1a\u5728\u4e22\u5305\u65f6\u7b49\u5f85\u4e00\u6bb5\u8f83\u957f\u7684\u65f6\u95f4\u624d\u542f\u52a8\u5dee\u9519\u6062\u590d\u3002\u56e0\u6b64\u9700\u8981\u53d1\u9001\u65b9\u9009\u62e9\u4e00\u4e2a\u5408\u9002\u7684\u65f6\u95f4\u503c\uff0c\u4ee5\u5224\u5b9a\u53ef\u80fd\u53d1\u751f\u4e86\u4e22\u5305\uff1b\u5982\u679c\u5728\u8fd9\u4e2a\u65f6\u95f4\u5185\u6ca1\u6709\u6536\u5230 ACK \uff0c\u5219\u91cd\u4f20\u8be5\u5206\u7ec4\u3002\u8fd9\u91cc\u5df2\u7ecf\u53ef\u4ee5\u4e0d\u518d\u4f7f\u7528 NACK \u4e86\uff0c\u539f\u56e0\u662f\u63a5\u6536\u65b9\u7684 NACK \u53ea\u80fd\u8868\u793a\u6570\u636e\u635f\u574f\uff0c\u4f46\u4e0d\u80fd\u8868\u793a\u6570\u636e\u4e22\u5931\uff1b\u800c\u5197\u4f59 ACK \u65e2\u53ef\u4ee5\u8868\u793a\u6570\u636e\u4e22\u5931\uff0c\u4e5f\u53ef\u4ee5\u8868\u793a\u6309\u6b63\u786e\u987a\u5e8f\u63a5\u6536\u3002<\/p>\n\n<p>\u6ce8\u610f\u5230\u5982\u679c\u4e00\u4e2a\u5206\u7ec4\u5728\u7f51\u7edc\u9ad8\u5cf0\u671f\u7ecf\u5386\u4e86\u4e00\u4e2a\u7279\u522b\u5927\u7684\u65f6\u5ef6\uff0c\u5728\u8be5\u6570\u636e\u5206\u7ec4\u53ca\u5176 ACK \u90fd\u6ca1\u6709\u4e22\u5931\u7684\u60c5\u51b5\u4e0b\u4fbf\u5f00\u59cb\u91cd\u4f20\u8be5\u5206\u7ec4\uff0c\u9020\u6210\u4e00\u4e2a\u5197\u4f59\u6570\u636e\u5206\u7ec4(duplicate data packet)\uff0c\u4e0d\u8fc7\u4e0a\u6587\u4ecb\u7ecd\u7684\u534f\u8bae\u5df2\u7ecf\u53ef\u4ee5\u5904\u7406\u5197\u4f59\u5206\u7ec4\u3002<\/p>\n\n<p>\u8fd9\u79cd\u57fa\u4e8e\u65f6\u95f4\u7684\u91cd\u4f20\u673a\u5236\uff0c\u9700\u8981\u4e00\u4e2a<strong>\u5012\u8ba1\u6570\u5b9a\u65f6\u5668<\/strong>(countdown timer)\uff0c\u53d1\u9001\u65b9\u6bcf\u6b21\u53d1\u9001\u4e00\u4e2a\u4efb\u610f\u5206\u7ec4\u65f6\u90fd\u542f\u52a8\u4e00\u4e2a\u5b9a\u65f6\u5668\uff0c\u5f53\u5012\u8ba1\u65f6\u7ed3\u675f\u540e\u91c7\u53d6\u9002\u5f53\u884c\u52a8\uff0c\u4f8b\u5982\u91cd\u4f20\u3002<\/p>\n\n<p>\u5f15\u5165\u5b9a\u65f6\u5668\u540e\uff0c\u901a\u4fe1\u539f\u7406\u5e76\u6ca1\u6709\u590d\u6742\u591a\u5c11\uff0c\u4f46\u8fc7\u7a0b\u4e2d\u53ef\u80fd\u7684\u60c5\u51b5\u53d8\u591a\u4e86\u3002\u9996\u5148\u8003\u8651\u6700\u7b80\u5355\u7684\u60c5\u51b5\uff0c\u5e95\u5c42\u5e76\u6ca1\u6709\u53d1\u751f\u4e22\u5305\u6216\u5206\u7ec4\u635f\u574f\uff0c\u90a3\u4e48\u53ea\u9700\u8981\u4e0d\u65ad\u6839\u636e ACK \u53d1\u9001\u5206\u7ec4\u5373\u53ef\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-rdt-3-case1.jpg\" alt=\"\" width=\"340\">\n<\/figure>\n\n<p>\u518d\u8003\u8651\u7a0d\u5fae\u590d\u6742\u4e00\u4e9b\u7684\u60c5\u51b5\uff0c\u5728\u4f20\u8f93\u8fc7\u7a0b\u4e2d\u53d1\u9001\u4e86\u4e22\u5305\u3002\u4e0d\u8bba\u662f\u5206\u7ec4\u4e22\u5931\u8fd8\u662f\u54cd\u5e94\u4e22\u5931\uff0c\u63a5\u6536\u65b9\u90fd\u65e0\u6cd5\u6536\u5230\u53d1\u9001\u65b9\u7684 ACK \u54cd\u5e94\uff0c\u5728\u5012\u8ba1\u65f6\u7ed3\u675f\u540e\u90fd\u4f1a\u53d1\u751f\u91cd\u4f20\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-rdt-3-case2-3.jpg\" alt=\"\" width=\"600\">\n<\/figure>\n\n<p>\u63a5\u6536\u65b9\u53ef\u80fd\u5f97\u5230\u91cd\u590d\u7684\u5206\u7ec4\uff0c\u4e0d\u8fc7\u5b83\u53ef\u4ee5\u901a\u8fc7\u5224\u65ad\u5206\u7ec4\u5e8f\u53f7\uff0c\u786e\u5b9a\u8fd9\u662f\u4e00\u4e2a\u5197\u4f59\u5206\u7ec4\u800c\u4e22\u5f03\u3002<\/p>\n\n<p>\u6700\u540e\u662f\u6700\u590d\u6742\u7684\u4e00\u79cd\u60c5\u51b5\uff0c\u5728\u4f20\u8f93\u8fc7\u7a0b\u4e2d\u6ca1\u6709\u53d1\u751f\u4e22\u5305\uff0c\u4f46\u53d1\u9001\u65b9\u8d85\u65f6\u65f6\u95f4\u8bbe\u7f6e\u8fc7\u77ed\uff0c\u53d1\u751f\u8fc7\u65e9\u8d85\u65f6\u800c\u8ba4\u4e3a\u6b64\u65f6\u53d1\u751f\u4e86\u4e22\u5305\u3002\u6b64\u65f6\uff0c\u53d1\u9001\u65b9\u5c1d\u8bd5\u518d\u53d1\u9001\u4e00\u4e2a\u76f8\u540c\u5206\u7ec4\uff0c\u4e0d\u8fc7\u8be5\u5206\u7ec4\u4f1a\u88ab\u63a5\u6536\u65b9\u786e\u8ba4\u4e3a\u5197\u4f59\u5206\u7ec4\u800c\u820d\u5f03\uff0c\u53d1\u9001\u65b9\u63a5\u5230\u91cd\u590d\u54cd\u5e94\u540e\u4e5f\u4f1a\u5c06\u5176\u4e22\u5f03\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-rdt-3-case4.jpg\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u8fd9\u6837\u4fbf\u6210\u529f\u5730\u6784\u5efa\u4e86\u4e00\u79cd\u53ef\u9760\u6570\u636e\u4f20\u8f93\u534f\u8bae\u3002\u68c0\u9a8c\u548c\u53ef\u4ee5\u9a8c\u8bc1\u4e00\u4e2a\u5206\u7ec4\u662f\u5426\u53d7\u635f\uff0c\u63a5\u6536\u65b9\u53cd\u9988\u4f7f\u53d1\u9001\u65b9\u77e5\u9053\u5206\u7ec4\u53d7\u635f\uff0c\u91cd\u4f20\u673a\u5236\u53ef\u4ee5\u6062\u590d\u53d7\u635f\u7684\u5185\u5bb9\uff0c\u5206\u7ec4\u5e8f\u53f7\u53ef\u4ee5\u9632\u6b62\u5197\u4f59\u5206\u7ec4\u7684\u5f71\u54cd\uff0c\u8d85\u65f6\u673a\u5236\u7528\u4e8e\u9632\u6b62\u901a\u4fe1\u8fc7\u7a0b\u4e2d\u53d1\u751f\u5206\u7ec4\u4e22\u5931\u3002<\/p>\n\n<h3>\u6d41\u6c34\u7ebf\u53ef\u9760\u6570\u636e\u4f20\u8f93\u534f\u8bae<\/h3>\n\n<p>\u76ee\u524d\u4e3a\u6b62\u5df2\u7ecf\u6784\u9020\u4e86\u4e00\u4e2a\u53ef\u7528\u7684\u53ef\u9760\u6570\u636e\u4f20\u8f93\u534f\u8bae\uff0c\u4f46\u662f\u5b83\u7684\u6027\u80fd\u8fd8\u662f\u6709\u5f88\u5927\u95ee\u9898\uff1a\u4ee5\u4e0a\u534f\u8bae\u662f\u4e00\u4e2a\u505c\u7b49\u534f\u8bae\uff0c\u4e00\u4e2a\u5206\u7ec4\u4ee5\u5149\u901f\u5728\u5168\u56fd\u8303\u56f4\u5185\u5f80\u8fd4\u901a\u5e38\u9700\u8981\u5341\u51e0\u5230\u51e0\u5341\u6beb\u79d2\u7684\u5f80\u8fd4\u65f6\u5ef6\uff0c\u5728\u5f97\u5230\u53d1\u9001\u65b9\u7684\u54cd\u5e94\u6216\u8d85\u65f6\u524d\uff0c\u53d1\u9001\u65b9\u65e0\u6cd5\u53bb\u505a\u5176\u5b83\u7684\u4e8b\u60c5\u3002<\/p>\n\n<p>\u8003\u8651\u5230\u4e00\u4e2a\u5206\u7ec4\u4e0d\u80fd\u592a\u5927\uff0c\u5426\u5219\u53d1\u751f\u5dee\u9519\u7684\u6982\u7387\u5c06\u4f1a\u6307\u6570\u4e0a\u5347\u3002UDP \u5206\u7ec4\u7684\u957f\u5ea6\u5b57\u6bb5\u6709 2 \u4e2a\u5b57\u8282\uff0c\u56e0\u6b64\u80fd\u5bb9\u7eb3\u7684\u5e94\u7528\u6570\u636e\u6700\u591a\u53ea\u6709 65535 \u4e2a\u5b57\u8282\uff0c\u800c\u4e00\u4e2a\u4f20\u8f93\u901f\u7387\u4ee5 Gbps \u8ba1\u7684\u94fe\u8def\u53d1\u9001\u8fd9\u4e48\u591a\u5b57\u8282\u4e5f\u53ea\u9700\u8981\u51e0\u5341\u5fae\u79d2\uff0c\u4e5f\u5c31\u662f\u8bf4\u53d1\u9001\u65b9\u53ea\u6709\u5343\u5206\u4e4b\u51e0\u7684\u65f6\u95f4\u662f\u5728\u5de5\u4f5c\uff0c\u5176\u4f59\u65f6\u95f4\u90fd\u5728\u7b49\u5f85\u56de\u590d\u3002<\/p>\n\n<p>\u4e3a\u4e86\u89e3\u51b3\u8be5\u95ee\u9898\uff0c\u53ef\u4ee5\u4e0d\u91c7\u7528\u505c\u7b49\uff0c\u800c\u662f\u4ee5<strong>\u6d41\u6c34\u7ebf<\/strong>(pipelining)\u7684\u65b9\u5f0f\u53d1\u9001\u591a\u4e2a\u5206\u7ec4\u800c\u65e0\u987b\u7b49\u5f85\u786e\u8ba4\uff0c\u5982\u4e0b\u56fe\u6240\u793a\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-pipelining-transmission.jpg\" alt=\"\" width=\"520\">\n<\/figure>\n\n<p>\u7136\u800c\uff0c\u6d41\u6c34\u7ebf\u64cd\u4f5c\u4e0b\uff0c\u4e3a\u4e86\u8ba9\u63a5\u6536\u65b9\u5224\u65ad\u662f\u5426\u6709\u5197\u4f59\u5206\u7ec4\uff0c\u5206\u7ec4\u7684\u5e8f\u53f7\u4e0d\u518d\u662f\u7b80\u5355\u7684 0\uff08\u4e00\u4e2a\u65b0\u7684\u5206\u7ec4\uff09\u6216 1\uff08\u91cd\u590d\u4e0a\u4e00\u4e2a\u5206\u7ec4\uff09\uff0c\u6bcf\u4e2a\u975e\u91cd\u4f20\u7684\u5206\u7ec4\u90fd\u5fc5\u987b\u6709\u4e00\u4e2a\u552f\u4e00\u7684\u5e8f\u53f7\uff1b\u5e76\u4e14\u53d1\u9001\u65b9\u63a5\u5230\u7684\u54cd\u5e94\u90fd\u662f\u4e4b\u524d\u53d1\u9001\u7684\u5206\u7ec4\u7684\uff0c\u4e3a\u4e86\u80fd\u591f\u5e94\u5bf9\u63a5\u6536\u65b9\u7684\u91cd\u4f20\u8bf7\u6c42\uff0c\u53d1\u9001\u65b9\u5fc5\u987b\u8981\u80fd\u591f\u7f13\u5b58\u90a3\u4e9b\u5df2\u7ecf\u53d1\u9001\u4f46\u8fd8\u6ca1\u6709\u786e\u8ba4\u7684\u5206\u7ec4\u3002<\/p>\n\n<p>\u53d1\u9001\u65b9\u9700\u8981\u4e3a\u5206\u7ec4\u8bbe\u7f6e\u5408\u9002\u7684\u5e8f\u53f7\u8303\u56f4\u548c\u7f13\u5b58\u5927\u5c0f\uff0c\u4f46\u5177\u4f53\u6309\u4ec0\u4e48\u65b9\u5f0f\u8bbe\u7f6e\u53d6\u51b3\u4e8e\u6570\u636e\u4f20\u8f93\u534f\u8bae\u5982\u4f55\u5904\u7406\u4e22\u5931\u3001\u635f\u574f\u53ca\u5ef6\u65f6\u8fc7\u5927\u7684\u5206\u7ec4\u3002\u89e3\u51b3\u6d41\u6c34\u7ebf\u7684\u5dee\u9519\u6062\u590d\u6709\u4e24\u79cd\u57fa\u672c\u65b9\u6cd5\u662f\u56de\u9000 N \u6b65\u548c\u9009\u62e9\u91cd\u4f20\u3002<\/p>\n\n<p><strong>\u56de\u9000 N \u6b65<\/strong>(Go-Back-N, GBN)\u534f\u8bae\u5141\u8bb8\u53d1\u9001\u65b9\u53d1\u9001\u591a\u4e2a\u5206\u7ec4\u800c\u4e0d\u9700\u7b49\u5f85\u786e\u8ba4\uff0c\u4f46\u4e3a\u4e86\u9632\u6b62\u5e8f\u53f7\u8fc7\u5927\uff0c\u5b83\u9650\u5236\u5728\u6d41\u6c34\u7ebf\u4e2d\u672a\u786e\u8ba4\u7684\u5206\u7ec4\u6570\u4e0d\u80fd\u8d85\u8fc7\u67d0\u4e2a\u6700\u5927\u5141\u8bb8\u503c N \u3002<\/p>\n\n<p>\u82e5\u5c06\u57fa\u5e8f\u53f7(base)\u5b9a\u4e49\u4e3a\u6700\u65e9\u672a\u786e\u8ba4\u5206\u7ec4\u7684\u5e8f\u53f7\uff0c\u540e\u7eed\u5e8f\u53f7(nextseqnum)\u5b9a\u4e49\u4e3a\u4e0b\u4e2a\u5f85\u53d1\u5206\u7ec4\u7684\u5e8f\u53f7\uff0c\u5219\u8fd9 N \u4e2a\u5206\u7ec4\u53ef\u5206\u4e3a 4 \u6bb5\uff1a\u57fa\u5e8f\u53f7\u4e4b\u524d\u7684\u5206\u7ec4\u90fd\u5df2\u7ecf\u53d1\u9001\u5e76\u88ab\u786e\u8ba4\uff1b\u57fa\u5e8f\u53f7\u5230\u540e\u7eed\u5e8f\u53f7\u662f\u5df2\u7ecf\u53d1\u9001\u4f46\u672a\u88ab\u786e\u8ba4\u7684\u5206\u7ec4\uff1b\u540e\u7eed\u5e8f\u53f7\u5230\u57fa\u5e8f\u53f7\u540e\u7684\u6700\u5927\u5141\u8bb8\u957f\u5ea6 N \u5185\u7684\u5e8f\u53f7\u80fd\u7528\u4e8e\u90a3\u4e9b\u8981\u88ab\u7acb\u5373\u53d1\u9001\u7684\u5206\u7ec4\uff1b\u5927\u4e8e\u7b49\u4e8e\u57fa\u5e8f\u53f7\u540e\u7684\u6700\u5927\u5141\u8bb8\u957f\u5ea6 N \u7684\u5e8f\u53f7\u6682\u65f6\u65e0\u6cd5\u4f7f\u7528\uff0c\u76f4\u5230\u5f53\u524d\u6d41\u6c34\u7ebf\u4e2d\u51fa\u73b0\u88ab\u786e\u8ba4\u7684\u5206\u7ec4\u4e3a\u6b62\uff08\u4e00\u822c\u662f\u57fa\u5e8f\u53f7\u5bf9\u5e94\u7684\u5206\u7ec4\uff09\u3002\u4e0b\u56fe\u63cf\u8ff0\u4e86\u53d1\u9001\u65b9\u7684\u5e8f\u53f7\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-pipelining-gobackN.jpg\" alt=\"\" width=\"440\">\n<\/figure>\n\n<p>\u534f\u8bae\u8fd0\u884c\u65f6\uff0c\u7531\u6709\u6548\u5e8f\u53f7\u6807\u8bc6\u7684\u5206\u7ec4\u53ef\u4ee5\u88ab\u770b\u4f5c\u4e00\u4e2a\u957f\u5ea6\u4e3a N \u7684\u7a97\u53e3\uff0c\u5728\u5e8f\u53f7\u7a7a\u95f4\u5411\u524d\u6ed1\u52a8\u3002\u5982\u679c\u5206\u7ec4\u4e2d\u5e8f\u53f7\u5b57\u6bb5\u7684\u957f\u5ea6\u4e3a k \uff0c\u90a3\u4e48\u5e8f\u53f7\u7a7a\u95f4\u53ef\u4ee5\u7528\u91cd\u590d\u7684 0~2<sup>k<\/sup> \u8868\u793a\u3002<\/p>\n\n<p>GBN \u53d1\u9001\u65b9\u5fc5\u987b\u54cd\u5e94 3 \u79cd\u4e0d\u540c\u7684\u4e8b\u4ef6\uff0c\u4e0b\u56fe\u63cf\u8ff0\u4e86 GBN \u53d1\u9001\u65b9\u7684\u5de5\u4f5c\u72b6\u6001\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-pipelining-gobackN-sender.jpg\" alt=\"\" width=\"460\">\n<\/figure>\n\n<p>\u5f53\u4e00\u4e2a\u5e94\u7528\u5c42\u51c6\u5907\u53d1\u9001\u6570\u636e\u65f6\uff0c\u53d1\u9001\u65b9\u9996\u5148\u68c0\u67e5\u53d1\u9001\u7a97\u53e3\u662f\u5426\u5df2\u6ee1\uff08\u5373\u5df2\u7ecf\u53d1\u9001\u4f46\u672a\u88ab\u786e\u8ba4\u7684\u5206\u7ec4\u662f\u5426\u8fbe\u5230\u4e86 N \uff09\uff1a\u5982\u679c\u7a97\u53e3\u672a\u6ee1\uff0c\u5219\u4ea7\u751f\u4e00\u4e2a\u5206\u7ec4\u5e76\u53d1\u9001\uff0c\u5e76\u76f8\u5e94\u5730\u66f4\u65b0\u53d8\u91cf\uff1b\u5982\u679c\u7a97\u53e3\u5df2\u6ee1\uff0c\u53d1\u9001\u65b9\u5219\u8fd4\u8fd8\u6570\u636e\u5e76\u63d0\u9192\u5e94\u7528\u5c42\u7b49\u5019\u4e00\u6bb5\u65f6\u95f4\u518d\u5c1d\u8bd5\u53d1\u9001\u3002\u6216\u8005\u53d1\u9001\u65b9\u4e5f\u53ef\u4ee5\u5148\u7f13\u5b58\u8fd9\u4e9b\u6570\u636e\uff0c\u5728\u5408\u9002\u7684\u65f6\u95f4\u518d\u53d1\u9001\u3002\u53d1\u9001\u65b9\u7684\u8fd0\u8f93\u5c42\u4e5f\u53ef\u4ee5\u548c\u5e94\u7528\u5c42\u6839\u636e\u4fe1\u53f7\u540c\u6b65\uff0c\u8ba9\u5e94\u7528\u5c42\u4ec5\u5f53\u7a97\u53e3\u672a\u6ee1\u65f6\u624d\u6267\u884c\u53d1\u9001\u6570\u636e\u3002<\/p>\n\n<p>\u5f53\u63a5\u6536\u65b9\u6536\u5230\u5e8f\u53f7\u4e3a n \u7684\u5206\u7ec4\u65f6\uff0c\u5b83\u5c06\u91c7\u53d6<strong>\u7d2f\u79ef\u786e\u8ba4<\/strong>(cumulative acknowlegment)\u7684\u65b9\u5f0f\uff0c\u8868\u660e\u63a5\u6536\u65b9\u5df2\u6b63\u786e\u6309\u987a\u5e8f\u63a5\u6536\u5230\u5e8f\u53f7\u4e3a n \u7684\u4ee5\u524d\u4e14\u5305\u62ec n \u5728\u5185\u7684\u6240\u6709\u5206\u7ec4\u3002\u5728\u6240\u6709\u5176\u5b83\u60c5\u51b5\u4e0b\uff0c\u63a5\u6536\u65b9\u90fd\u4f1a\u4e22\u5f03\u8be5\u5206\u7ec4\uff0c\u5e76\u6839\u636e\u6700\u8fd1\u6309\u5e8f\u63a5\u6536\u7684\u5206\u7ec4\u91cd\u65b0\u53d1\u9001 ACK \u3002\u56e0\u4e3a\u4e00\u6b21\u4ea4\u4ed8\u7ed9\u4e0a\u5c42\u4e00\u4e2a\u5206\u7ec4\uff0c\u5982\u679c\u5206\u7ec4 k \u63a5\u6536\u5e76\u4ea4\u4ed8\uff0c\u5219\u6240\u6709\u5e8f\u53f7\u6bd4 k \u5c0f\u7684\u5206\u7ec4\u4e5f\u5df2\u7ecf\u6b63\u786e\u4ea4\u4ed8\u3002<\/p>\n\n<p>\u56e0\u6b64\uff0c\u5f53\u51fa\u73b0\u4e22\u5931\u548c\u65f6\u5ef6\u8fc7\u957f\u65f6\uff0c\u53d1\u9001\u65b9\u90fd\u4f1a\u53d1\u73b0\u6700\u65e9\u5df2\u53d1\u9001\u4f46\u672a\u88ab\u786e\u8ba4\u7684\u5206\u7ec4\u54cd\u5e94\u8d85\u65f6\u3002\u6b64\u65f6\uff0c\u53d1\u9001\u65b9\u5c06\u91cd\u4f20\u6240\u6709\u5df2\u53d1\u9001\u4f46\u8fd8\u672a\u88ab\u786e\u8ba4\u8fc7\u7684\u5206\u7ec4\uff0c\u8fd9\u4e5f\u5c31\u662f\u4e0a\u56fe\u4e2d\u53d1\u9001\u65b9\u63a5\u6536\u5bf9\u635f\u574f\u7684\u5206\u7ec4\u4e0d\u91c7\u53d6\u4efb\u4f55\u52a8\u4f5c\u7684\u539f\u56e0\uff08\u56e0\u4e3a\u4e0d\u4f1a\u63a5\u5230\u635f\u574f\u7684\u54cd\u5e94\uff0c\u53ea\u4f1a\u91cd\u590d\u63a5\u5230\u524d\u9762\u5206\u7ec4\u6210\u529f\u63a5\u6536\u7684\u54cd\u5e94\uff09\u3002\u4e0a\u56fe\u4e2d\u53ea\u7528\u5230\u4e00\u4e2a\u5b9a\u65f6\u5668\uff0c\u5982\u679c\u6536\u5230 ACK \u4f46\u4ecd\u6709\u5df2\u53d1\u9001\u4f46\u672a\u88ab\u786e\u8ba4\u7684\u5206\u7ec4\uff0c\u5219\u5b9a\u65f6\u5668\u88ab\u91cd\u65b0\u542f\u52a8\uff0c\u5728\u5012\u8ba1\u65f6\u5185\u4ecd\u7136\u53ef\u4ee5\u63a5\u6536\u5230\u7d27\u63a5\u800c\u6765\u7684 ACK \u3002<\/p>\n\n<p>\u63a5\u6536\u65b9\u5fc5\u987b\u6309\u5e8f\u5c06\u6570\u636e\u4ea4\u4ed8\u7ed9\u5e94\u7528\u5c42\uff0c\u7531\u4e8e\u5728 GBN \u534f\u8bae\u4e2d\u53d1\u9001\u65b9\u4f1a\u5c06\u9664\u4e86\u5df2\u7ecf\u6309\u5e8f\u6b63\u786e\u63a5\u6536\u7684\u5206\u7ec4\u90fd\u91cd\u4f20\uff0c\u56e0\u6b64\u63a5\u6536\u65b9\u53ef\u4ee5\u4e22\u5f03\u6240\u6709\u5931\u5e8f\u5206\u7ec4\u800c\u65e0\u9700\u7f13\u5b58\uff0c\u552f\u4e00\u8981\u505a\u7684\u5c31\u662f\u4f7f\u7528\u4e00\u4e2a\u53d8\u91cf\u4fdd\u5b58\u4e0b\u4e2a\u6309\u5e8f\u63a5\u6536\u7684\u5206\u7ec4\u7684\u5e8f\u53f7\u3002\u4e22\u5f03\u4e00\u4e2a\u6b63\u786e\u63a5\u6536\u7684\u5206\u7ec4\u7684\u7f3a\u70b9\u662f\u968f\u540e\u5bf9\u8be5\u5206\u7ec4\u7684\u91cd\u4f20\u4e5f\u53ef\u80fd\u4f1a\u4e22\u5931\u6216\u51fa\u9519\uff0c\u56e0\u6b64\u53ef\u80fd\u9700\u8981\u66f4\u591a\u7684\u91cd\u4f20\u3002<\/p>\n\n<p>\u4e0b\u56fe\u8868\u793a\u4e00\u4e2a\u7a97\u53e3\u957f\u5ea6\u4e3a 4 \u4e2a\u5206\u7ec4\u7684 GBN \u534f\u8bae\u7684\u8fd0\u884c\u60c5\u51b5\uff0c\u6b64\u65f6\u53d1\u9001\u65b9\u53ea\u80fd\u53d1\u9001\u5206\u7ec4 0~3 \uff0c\u76f4\u5230\u4e00\u4e2a\u6216\u591a\u4e2a\u5206\u7ec4\u88ab\u786e\u8ba4\u624d\u80fd\u7ee7\u7eed\u53d1\u9001\u3002\u5f53\u63a5\u6536\u5230\u987a\u5e8f\u7684 ACK \u65f6\uff0c\u8be5\u7a97\u53e3\u4fbf\u5411\u524d\u6ed1\u52a8\uff0c\u53d1\u9001\u65b9\u4fbf\u53ef\u4ee5\u53d1\u9001\u65b0\u7684\u5206\u7ec4\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-pipelining-gobackN-demo.jpg\" alt=\"\" width=\"350\">\n<\/figure>\n\n<p>\u7531\u4e8e\u7a97\u53e3\u957f\u5ea6\u7684\u9650\u5236\uff0c\u53d1\u9001\u65b9\u53ea\u80fd\u4e00\u6b21\u6027\u53d1\u9001\u5206\u7ec4 0~3 \uff0c\u5728\u7ee7\u7eed\u53d1\u9001\u4e4b\u524d\u5fc5\u987b\u7b49\u5f85\u76f4\u5230\u4e00\u4e2a\u6216\u591a\u4e2a\u5206\u7ec4\u88ab\u786e\u8ba4\u3002\u5f53\u63a5\u6536\u5230\u6bcf\u4e2a\u8fde\u7eed\u7684 ACK \u65f6\uff0c\u8be5\u7a97\u53e3\u4fbf\u5411\u524d\u6ed1\u52a8\uff0c\u53d1\u9001\u65b9\u4fbf\u53ef\u4ee5\u53d1\u9001\u65b0\u7684\u5206\u7ec4\u3002\u5206\u7ec4 2 \u7b2c\u4e00\u6b21\u4f20\u8f93\u65f6\u53d1\u751f\u4e86\u4e22\u5931\uff0c\u63a5\u6536\u65b9\u53d1\u73b0\u5206\u7ec4 3~5 \u662f\u5931\u5e8f\u5206\u7ec4\u5e76\u4e22\u5f03\uff0c\u800c\u53d1\u9001\u65b9\u56e0\u4e3a\u8fdf\u8fdf\u63a5\u4e0d\u5230\u5206\u7ec4 2 \u7684\u54cd\u5e94\u800c\u53d1\u751f\u8d85\u65f6\uff0c\u5728\u8d85\u65f6\u4e8b\u4ef6\u4e2d\u91cd\u53d1\u5f53\u524d\u7a97\u53e3\u7684\u5206\u7ec4 2~5 \u3002<\/p>\n\n<hr>\n\n<p>\u6539\u8fdb\u540e\u7684 GBN \u534f\u8bae\u4f7f\u53d1\u9001\u65b9\u53ef\u4ee5\u5728\u6ca1\u6709\u63a5\u6536\u54cd\u5e94\u65f6\u4fbf\u540c\u65f6\u53d1\u9001\u591a\u4e2a\u5206\u7ec4\uff0c\u907f\u514d\u4e86\u505c\u7b49\u534f\u8bae\u4e2d\u5b58\u5728\u7684\u65f6\u95f4\u5229\u7528\u7387\u95ee\u9898\u3002\u7136\u800c GBN \u4e5f\u5b58\u5728\u4e00\u4e9b\u6027\u80fd\u95ee\u9898\uff0c\u4e3b\u8981\u662f\u5f53\u7a97\u53e3\u957f\u5ea6\u548c\u4f20\u8f93\u65f6\u5ef6\u90fd\u5f88\u5927\u65f6\uff0c\u5355\u4e2a\u5206\u7ec4\u7684\u5dee\u9519\u5c31\u80fd\u591f\u5f15\u8d77 GBN \u91cd\u4f20\u5927\u91cf\u5206\u7ec4\uff0c\u4f46\u8bb8\u591a\u5206\u7ec4\u6839\u672c\u6ca1\u6709\u5fc5\u8981\u91cd\u4f20\u3002\u968f\u7740\u5e95\u5c42\u901a\u9053\u5dee\u9519\u7387\u7684\u589e\u52a0\uff0c\u8bb8\u591a\u6b63\u786e\u9001\u8fbe\u7684\u5206\u7ec4\u53ef\u80fd\u4f1a\u88ab\u591a\u6b21\u4e0d\u5fc5\u8981\u5730\u91cd\u4f20\u3002<\/p>\n\n<p><strong>\u9009\u62e9\u91cd\u4f20<\/strong>(Selective Repeat, SR)\u534f\u8bae\u53ef\u4ee5\u8ba9\u53d1\u9001\u65b9\u4ec5\u91cd\u4f20\u53ef\u80fd\u4e22\u5931\u6216\u53d7\u635f\u7684\u5206\u7ec4\uff0c\u800c\u907f\u514d\u4e86\u4e0d\u5fc5\u8981\u7684\u91cd\u4f20\u3002\u8fd9\u79cd\u4e2a\u522b\u7684\u3001\u6309\u9700\u7684\u91cd\u4f20\u8981\u6c42\u63a5\u6536\u65b9\u9010\u4e2a\u786e\u8ba4\u6b63\u786e\u63a5\u6536\u7684\u5206\u7ec4\u3002\u63a5\u6536\u65b9\u5c06\u786e\u8ba4\u4e00\u4e2a\u6b63\u786e\u63a5\u6536\u7684\u5206\u7ec4\u800c\u4e0d\u7ba1\u5176\u662f\u5426\u6309\u5e8f\uff0c\u5931\u5e8f\u7684\u5206\u7ec4\u5c06\u88ab\u7f13\u5b58\u76f4\u5230\u6240\u6709\u4e22\u5931\u5206\u7ec4\uff08\u5e8f\u53f7\u66f4\u5c0f\u7684\u5206\u7ec4\uff09\u90fd\u88ab\u6536\u5230\u4e3a\u6b62\uff0c\u7136\u540e\u624d\u53ef\u4ee5\u5c06\u8fd9\u4e00\u6279\u5206\u7ec4\u4e00\u8d77\u4ea4\u4ed8\u7ed9\u5e94\u7528\u5c42\u3002<\/p>\n\n<p>\u5f53\u53d1\u9001\u65b9\u4ece\u5e94\u7528\u5c42\u63a5\u6536\u5230\u6570\u636e\u540e\uff0c\u5c06\u68c0\u67e5\u4e0b\u4e2a\u53ef\u7528\u4e8e\u8be5\u5206\u7ec4\u7684\u5e8f\u53f7\u662f\u5426\u4f4d\u4e8e\u7a97\u53e3\u5185\uff1a\u5982\u679c\u4f4d\u4e8e\u7a97\u53e3\u5185\uff0c\u5219\u5c06\u6570\u636e\u6253\u5305\u5e76\u53d1\u9001\uff1b\u5426\u5219\u8981\u4e48\u5c06\u6570\u636e\u7f13\u5b58\uff0c\u8981\u4e48\u8fd4\u8fd8\u7ed9\u5e94\u7528\u5c42\u3002\u6b64\u65f6\u63a5\u6536\u65b9\u4e5f\u9700\u8981\u4e00\u4e2a\u957f\u5ea6\u4e3a N \u7684\u7a97\u53e3\uff0c\u5e8f\u53f7\u5728\u7a97\u53e3\u5185\u7684\u5206\u7ec4\u88ab\u6b63\u786e\u63a5\u6536\u5e76\u56de\u9001\u4e00\u4e2a ACK \u3002\u4e0b\u56fe\u5c55\u793a\u4e86 SR \u7684\u7a97\u53e3\u72b6\u6001\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-pipelining-selectiveRepeat-window.jpg\" alt=\"\" width=\"570\">\n<\/figure>\n\n<p>\u5f53\u53d1\u9001\u65b9\u6536\u5230\u67d0\u4e2a\u5206\u7ec4\u7684 ACK \u65f6\uff0c\u5982\u679c\u8be5\u5206\u7ec4\u5e8f\u53f7\u5728\u7a97\u53e3\u5185\uff0c\u5219\u53d1\u9001\u65b9\u5c06\u8be5\u5206\u7ec4\u6807\u8bb0\u4e3a\u5df2\u63a5\u6536\u3002\u5982\u679c\u8be5\u5206\u7ec4\u7684\u5e8f\u53f7\u7b49\u4e8e\u53d1\u9001\u65b9\u7a97\u53e3\u57fa\u5e8f\u53f7 <code>send_base<\/code> \uff0c\u5219\u57fa\u5e8f\u53f7\u53d8\u4e3a\u672a\u786e\u8ba4\u5206\u7ec4\u7684\u6700\u5c0f\u5e8f\u53f7\u5904\u5e76\u5e26\u52a8\u6574\u4e2a\u7a97\u53e3\u79fb\u52a8\uff0c\u5e76\u53d1\u9001\u843d\u5728\u7a97\u53e3\u5185\u7684\u672a\u53d1\u9001\u5e8f\u53f7\u3002<\/p>\n\n<p>\u7279\u522b\u5730\uff0c\u63a5\u6536\u65b9\u4f1a\u91cd\u65b0\u786e\u8ba4\uff08\u800c\u4e0d\u662f\u5ffd\u7565\uff09\u5df2\u6536\u5230\u8fc7\u7684\u5e8f\u53f7\u5c0f\u4e8e\u5f53\u524d\u63a5\u6536\u7a97\u53e3\u57fa\u5e8f\u53f7\u7684\u5206\u7ec4\u3002\u8003\u8651\u5230 ACK \u4e22\u5931\uff0c\u7279\u522b\u662f\u5206\u7ec4 <code>send_base<\/code> \u7684 ACK \u4e22\u5931\uff0c\u5219\u53d1\u9001\u65b9\u4f1a\u91cd\u4f20\u8be5\u5206\u7ec4\u3002\u7136\u800c\u5bf9\u63a5\u6536\u65b9\u6765\u8bf4\uff0c\u5b83\u7684\u7a97\u53e3\u5df2\u7ecf\u6ed1\u8fc7\u4e86\u8be5\u5206\u7ec4\uff0c\u5982\u679c\u63a5\u6536\u65b9\u4e0d\u786e\u8ba4\u8be5\u5206\u7ec4\uff0c\u5219\u53d1\u9001\u65b9\u7a97\u53e3\u5c06\u6c38\u8fdc\u4e0d\u80fd\u5411\u524d\u6ed1\u52a8\u3002\u56e0\u6b64\u5728 SR \u534f\u8bae\u4e0b\uff0c\u53d1\u9001\u65b9\u548c\u63a5\u6536\u65b9\u7684\u7a97\u53e3\u5e76\u4e0d\u603b\u662f\u4e00\u81f4\u7684\u3002<\/p>\n\n<p>\u5728 SR \u4e2d\uff0c\u6bcf\u4e2a\u5206\u7ec4\u90fd\u53ef\u80fd\u53d1\u751f\u8d85\u65f6\uff0c\u5728\u8d85\u65f6\u4e8b\u4ef6\u4e2d\u53ea\u80fd\u53d1\u9001\u4e00\u4e2a\u5206\u7ec4\uff0c\u56e0\u6b64\u6bcf\u4e2a\u5206\u7ec4\u5fc5\u987b\u62e5\u6709\u72ec\u7acb\u7684\u903b\u8f91\u5b9a\u65f6\u5668\uff0c\u5426\u5219\u4e0d\u77e5\u9053\u54ea\u4e00\u4e2a\u5206\u7ec4\u53d1\u751f\u4e86\u8d85\u65f6\u3002\u4e0b\u56fe\u6f14\u793a\u4e86 SR \u662f\u5982\u4f55\u5904\u7406\u4e4b\u524d\u7684\u60c5\u51b5\u4e0b GBN \u9047\u5230\u7684\u95ee\u9898\u7684\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/03-pipelining-selectiveRepeat-demo.jpg\" alt=\"\" width=\"600\">\n<\/figure>\n\n<p>\u81f3\u6b64\u7ec8\u4e8e\u5f97\u51fa\u4e86\u4e00\u4e2a\u9ad8\u6548\u3001\u53ef\u9760\u7684\u6570\u636e\u4f20\u8f93\u534f\u8bae\u3002\u4e0b\u8868\u603b\u7ed3\u4e86\u8be5\u534f\u8bae\u7684\u4e00\u4e9b\u673a\u5236\uff0c\u4ee5\u53ca\u8fd9\u4e9b\u673a\u5236\u662f\u5982\u4f55\u4fdd\u8bc1\u534f\u8bae\u6b63\u5e38\u8fd0\u884c\u7684\uff1a<\/p>\n\n<table>\n    <tr>\n        <th>\u673a\u5236<\/th>\n        <th>\u7528\u9014<\/th>\n    <\/tr>\n    <tr>\n        <td>\u68c0\u9a8c\u548c<\/td>\n        <td>\u68c0\u6d4b\u5206\u7ec4\u4e2d\u662f\u5426\u53d1\u751f\u6bd4\u7279\u5dee\u9519<\/td>\n    <\/tr>\n    <tr>\n        <td>ACK \u786e\u8ba4<\/td>\n        <td>\u544a\u77e5\u53d1\u9001\u65b9\u5206\u7ec4\u88ab\u6b63\u786e\u63a5\u6536<\/td>\n    <\/tr>\n    <tr>\n        <td>\u5e8f\u53f7<\/td>\n        <td>\u7528\u4e8e\u8868\u793a\u5206\u7ec4\u6216\u54cd\u5e94\u7684\u987a\u5e8f\uff0c\u5e76\u53ef\u4ee5\u7528\u4e8e\u5224\u65ad\u662f\u5426\u5197\u4f59<\/td>\n    <\/tr>\n    <tr>\n        <td>\u5b9a\u65f6\u5668<\/td>\n        <td>\u68c0\u6d4b\u4e00\u4e2a\u5206\u7ec4\u6216\u54cd\u5e94\u662f\u5426\u5728\u4f20\u8f93\u65f6\u53d1\u9001\u4e22\u5931\u3002\u4f46\u5b9a\u65f6\u5668\u53ef\u80fd\u5f15\u53d1\u8fc7\u65e9\u8d85\u65f6\uff0c\u9700\u8981\u5904\u7406\u5197\u4f59\u5206\u7ec4\u6216\u54cd\u5e94<\/td>\n    <\/tr>\n    <tr>\n        <td>\u6d41\u6c34\u7ebf<\/td>\n        <td>\u4f7f\u53d1\u9001\u65b9\u548c\u63a5\u6536\u65b9\u80fd\u65e0\u9700\u505c\u7b49\u800c\u7ee7\u7eed\u64cd\u4f5c\uff0c\u589e\u52a0\u901a\u4fe1\u65f6\u95f4\u5229\u7528\u7387<\/td>\n    <\/tr>\n    <tr>\n        <td>\u7a97\u53e3<\/td>\n        <td>\u9650\u5236\u5206\u7ec4\u5e8f\u53f7\u8303\u56f4\uff0c\u51cf\u8f7b\u7f13\u5b58\u538b\u529b<\/td>\n    <\/tr>\n<\/table>\n\n<p>\u4e0b\u4e00\u8282\u5c06\u4ecb\u7ecd TCP \u534f\u8bae\uff0c\u66f4\u8be6\u7ec6\u5730\u4ecb\u7ecd\u5dee\u9519\u68c0\u6d4b\u3001\u8d85\u65f6\u673a\u5236\u3001\u6d41\u91cf\u63a7\u5236\u7b49\u539f\u7406\uff0c\u5e76\u7814\u7a76 TCP \u662f\u5982\u4f55\u5b9e\u73b0\u5b83\u4eec\u7684\u3002<\/p>\n\n<h2>\u5ef6\u4f38\u9605\u8bfb<\/h2>\n\n<p>\u672c\u6587\u4f7f\u7528\u7684 UDP \u68c0\u9a8c\u548c\u7b97\u6cd5\u53c2\u8003\u81ea OpenBSD \uff1a<a href=\"https:\/\/github.com\/openbsd\/src\/blob\/master\/sbin\/dhclient\/packet.c\">https:\/\/github.com\/openbsd\/src\/blob\/master\/sbin\/dhclient\/packet.c<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>\u8fd0\u8f93\u5c42\u6982\u8ff0 \u8fd0\u8f93\u5c42\u534f\u8bae\u4e3a\u8fd0\u884c\u5728\u4e0d\u540c\u4e3b\u673a\u4e0a\u7684\u5e94\u7528\u8fdb\u7a0b\u4e4b&#46;&#46;&#46;<\/p>\n","protected":false},"author":1,"featured_media":490,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[32],"tags":[38,33],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u89c8\u4e0eUDP\u534f\u8bae - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9<\/title>\r\n<meta name=\"description\" content=\"\u8fd0\u8f93\u5c42\" \/>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"http:\/\/localhost:8000\/wordpress\/archives\/453\" \/>\r\n<meta property=\"og:locale\" content=\"zh_CN\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u89c8\u4e0eUDP\u534f\u8bae - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9\" \/>\r\n<meta property=\"og:description\" content=\"\u8fd0\u8f93\u5c42\" \/>\r\n<meta property=\"og:url\" content=\"http:\/\/localhost:8000\/wordpress\/archives\/453\" \/>\r\n<meta property=\"og:site_name\" content=\"\u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9\" \/>\r\n<meta property=\"article:published_time\" content=\"2022-07-08T14:49:32+00:00\" \/>\r\n<meta property=\"article:modified_time\" content=\"2022-12-12T11:59:38+00:00\" \/>\r\n<meta property=\"og:image\" content=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u7387\u4e0eUDP\u534f\u8bae.jpg\" \/>\r\n\t<meta property=\"og:image:width\" content=\"1980\" \/>\r\n\t<meta property=\"og:image:height\" content=\"1320\" \/>\r\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"\u4f5c\u8005\" \/>\n\t<meta name=\"twitter:data1\" content=\"Hello\" \/>\n\t<meta name=\"twitter:label2\" content=\"\u9884\u8ba1\u9605\u8bfb\u65f6\u95f4\" \/>\n\t<meta name=\"twitter:data2\" content=\"7\u5206\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\r\n\t    \"@context\": \"https:\/\/schema.org\",\r\n\t    \"@graph\": [\r\n\t        {\r\n\t            \"@type\": \"WebSite\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/#website\",\r\n\t            \"url\": \"http:\/\/localhost:8000\/wordpress\/\",\r\n\t            \"name\": \"\u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9\",\r\n\t            \"description\": \"FrozenCandle&#039;s Personal Site\",\r\n\t            \"potentialAction\": [\r\n\t                {\r\n\t                    \"@type\": \"SearchAction\",\r\n\t                    \"target\": {\r\n\t                        \"@type\": \"EntryPoint\",\r\n\t                        \"urlTemplate\": \"http:\/\/localhost:8000\/wordpress\/?s={search_term_string}\"\r\n\t                    },\r\n\t                    \"query-input\": \"required name=search_term_string\"\r\n\t                }\r\n\t            ],\r\n\t            \"inLanguage\": \"zh-CN\"\r\n\t        },\r\n\t        {\r\n\t            \"@type\": \"ImageObject\",\r\n\t            \"inLanguage\": \"zh-CN\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/453#primaryimage\",\r\n\t            \"url\": \"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u7387\u4e0eUDP\u534f\u8bae.jpg\",\r\n\t            \"contentUrl\": \"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u7387\u4e0eUDP\u534f\u8bae.jpg\",\r\n\t            \"width\": 1980,\r\n\t            \"height\": 1320\r\n\t        },\r\n\t        {\r\n\t            \"@type\": \"WebPage\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/453#webpage\",\r\n\t            \"url\": \"http:\/\/localhost:8000\/wordpress\/archives\/453\",\r\n\t            \"name\": \"\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u89c8\u4e0eUDP\u534f\u8bae - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9\",\r\n\t            \"isPartOf\": {\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/#website\"\r\n\t            },\r\n\t            \"primaryImageOfPage\": {\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/453#primaryimage\"\r\n\t            },\r\n\t            \"datePublished\": \"2022-07-08T14:49:32+00:00\",\r\n\t            \"dateModified\": \"2022-12-12T11:59:38+00:00\",\r\n\t            \"author\": {\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/805995a49645fa933cb6698b7ffd0d7c\"\r\n\t            },\r\n\t            \"description\": \"\u8fd0\u8f93\u5c42\",\r\n\t            \"breadcrumb\": {\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/453#breadcrumb\"\r\n\t            },\r\n\t            \"inLanguage\": \"zh-CN\",\r\n\t            \"potentialAction\": [\r\n\t                {\r\n\t                    \"@type\": \"ReadAction\",\r\n\t                    \"target\": [\r\n\t                        \"http:\/\/localhost:8000\/wordpress\/archives\/453\"\r\n\t                    ]\r\n\t                }\r\n\t            ]\r\n\t        },\r\n\t        {\r\n\t            \"@type\": \"BreadcrumbList\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/453#breadcrumb\",\r\n\t            \"itemListElement\": [\r\n\t                {\r\n\t                    \"@type\": \"ListItem\",\r\n\t                    \"position\": 1,\r\n\t                    \"name\": \"\u9996\u9875\",\r\n\t                    \"item\": \"http:\/\/localhost:8000\/wordpress\/\"\r\n\t                },\r\n\t                {\r\n\t                    \"@type\": \"ListItem\",\r\n\t                    \"position\": 2,\r\n\t                    \"name\": \"\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u89c8\u4e0eUDP\u534f\u8bae\"\r\n\t                }\r\n\t            ]\r\n\t        },\r\n\t        {\r\n\t            \"@type\": \"Person\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/805995a49645fa933cb6698b7ffd0d7c\",\r\n\t            \"name\": \"Hello\",\r\n\t            \"image\": {\r\n\t                \"@type\": \"ImageObject\",\r\n\t                \"inLanguage\": \"zh-CN\",\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/image\/\",\r\n\t                \"url\": \"http:\/\/2.gravatar.com\/avatar\/e1edbd1491f244c1e5cfafed859d4426?s=96&d=mm&r=g\",\r\n\t                \"contentUrl\": \"http:\/\/2.gravatar.com\/avatar\/e1edbd1491f244c1e5cfafed859d4426?s=96&d=mm&r=g\",\r\n\t                \"caption\": \"Hello\"\r\n\t            },\r\n\t            \"sameAs\": [\r\n\t                \"http:\/\/localhost:8000\/wordpress\"\r\n\t            ],\r\n\t            \"url\": \"http:\/\/localhost:8000\/wordpress\/archives\/author\/hello\"\r\n\t        }\r\n\t    ]\r\n\t}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u89c8\u4e0eUDP\u534f\u8bae - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","description":"\u8fd0\u8f93\u5c42","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"http:\/\/localhost:8000\/wordpress\/archives\/453","og_locale":"zh_CN","og_type":"article","og_title":"\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u89c8\u4e0eUDP\u534f\u8bae - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","og_description":"\u8fd0\u8f93\u5c42","og_url":"http:\/\/localhost:8000\/wordpress\/archives\/453","og_site_name":"\u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","article_published_time":"2022-07-08T14:49:32+00:00","article_modified_time":"2022-12-12T11:59:38+00:00","og_image":[{"width":1980,"height":1320,"url":"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u7387\u4e0eUDP\u534f\u8bae.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"\u4f5c\u8005":"Hello","\u9884\u8ba1\u9605\u8bfb\u65f6\u95f4":"7\u5206"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"http:\/\/localhost:8000\/wordpress\/#website","url":"http:\/\/localhost:8000\/wordpress\/","name":"\u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","description":"FrozenCandle&#039;s Personal Site","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"http:\/\/localhost:8000\/wordpress\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"zh-CN"},{"@type":"ImageObject","inLanguage":"zh-CN","@id":"http:\/\/localhost:8000\/wordpress\/archives\/453#primaryimage","url":"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u7387\u4e0eUDP\u534f\u8bae.jpg","contentUrl":"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/07\/\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u7387\u4e0eUDP\u534f\u8bae.jpg","width":1980,"height":1320},{"@type":"WebPage","@id":"http:\/\/localhost:8000\/wordpress\/archives\/453#webpage","url":"http:\/\/localhost:8000\/wordpress\/archives\/453","name":"\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u89c8\u4e0eUDP\u534f\u8bae - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","isPartOf":{"@id":"http:\/\/localhost:8000\/wordpress\/#website"},"primaryImageOfPage":{"@id":"http:\/\/localhost:8000\/wordpress\/archives\/453#primaryimage"},"datePublished":"2022-07-08T14:49:32+00:00","dateModified":"2022-12-12T11:59:38+00:00","author":{"@id":"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/805995a49645fa933cb6698b7ffd0d7c"},"description":"\u8fd0\u8f93\u5c42","breadcrumb":{"@id":"http:\/\/localhost:8000\/wordpress\/archives\/453#breadcrumb"},"inLanguage":"zh-CN","potentialAction":[{"@type":"ReadAction","target":["http:\/\/localhost:8000\/wordpress\/archives\/453"]}]},{"@type":"BreadcrumbList","@id":"http:\/\/localhost:8000\/wordpress\/archives\/453#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"\u9996\u9875","item":"http:\/\/localhost:8000\/wordpress\/"},{"@type":"ListItem","position":2,"name":"\u8ba1\u7b97\u673a\u7f51\u7edc04-\u8fd0\u8f93\u5c42\u6982\u89c8\u4e0eUDP\u534f\u8bae"}]},{"@type":"Person","@id":"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/805995a49645fa933cb6698b7ffd0d7c","name":"Hello","image":{"@type":"ImageObject","inLanguage":"zh-CN","@id":"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/image\/","url":"http:\/\/2.gravatar.com\/avatar\/e1edbd1491f244c1e5cfafed859d4426?s=96&d=mm&r=g","contentUrl":"http:\/\/2.gravatar.com\/avatar\/e1edbd1491f244c1e5cfafed859d4426?s=96&d=mm&r=g","caption":"Hello"},"sameAs":["http:\/\/localhost:8000\/wordpress"],"url":"http:\/\/localhost:8000\/wordpress\/archives\/author\/hello"}]}},"acf":[],"_links":{"self":[{"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/posts\/453"}],"collection":[{"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/comments?post=453"}],"version-history":[{"count":3,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/posts\/453\/revisions"}],"predecessor-version":[{"id":493,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/posts\/453\/revisions\/493"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/media\/490"}],"wp:attachment":[{"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/media?parent=453"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/categories?post=453"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/tags?post=453"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}