{"id":743,"date":"2022-09-15T11:41:15","date_gmt":"2022-09-15T03:41:15","guid":{"rendered":"http:\/\/localhost:8000\/wordpress\/?p=743"},"modified":"2022-12-12T19:05:00","modified_gmt":"2022-12-12T11:05:00","slug":"%e6%95%b0%e6%8d%ae%e7%bb%93%e6%9e%8408-%e5%9b%be","status":"publish","type":"post","link":"http:\/\/localhost:8000\/wordpress\/archives\/743","title":{"rendered":"\u6570\u636e\u7ed3\u678408-\u56fe"},"content":{"rendered":"\n<h2>\u56fe\u5b58\u50a8\u7ed3\u6784<\/h2>\n\n<h3>\u56fe\u7ed3\u6784\u7b80\u4ecb<\/h3>\n\n<p>\u5728\u4e4b\u524d\u7684\u7ae0\u8282\u4e2d\u5df2\u7ecf\u89c1\u8fc7\u4e86\u4e00\u5bf9\u4e00\u548c\u4e00\u5bf9\u591a\u7684\u6570\u636e\u7ed3\u6784\uff0c\u5b83\u4eec\u5206\u522b\u53ef\u4ee5\u4f7f\u7528<a href=\"\/archives\/586\">\u7ebf\u6027\u8868<\/a>\u548c<a href=\"\/archives\/622\">\u6811<\/a>\u6765\u63cf\u8ff0\u3002\u672c\u8282\u4ecb\u7ecd\u4e00\u79cd\u5178\u578b\u7684\u591a\u5bf9\u591a\u6570\u636e\u7ed3\u6784\uff1a<strong>\u56fe<\/strong>(graph)\u3002<\/p>\n\n<p>\u4e0b\u9762\u5c55\u793a\u4e86\u4e00\u4e2a\u7b80\u5355\u7684\u56fe\u7ed3\u6784\uff0c\u53ef\u4ee5\u770b\u51fa\u6bcf\u4e24\u4e2a\u6570\u636e\u4e4b\u95f4\u90fd\u53ef\u80fd\u6709\u5bf9\u5e94\u5173\u7cfb\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-graph-concept.png\" alt=\"\" width=\"260\">\n<\/figure>\n\n<p>\u8fd9\u79cd\u5bf9\u5e94\u5173\u7cfb\u4f7f\u5f97\u56fe\u4e0d\u80fd\u7b80\u5355\u5730\u4f7f\u7528\u8282\u70b9\u548c\u6307\u9488\u8868\u793a\uff0c\u5426\u5219\u4e00\u4e2a\u8282\u70b9\u9700\u8981\u5927\u91cf\u7a7a\u95f4\u6765\u8868\u793a\u8fd9\u79cd\u5bf9\u591a\u7684\u5173\u7cfb\u3002\u5728\u4ecb\u7ecd\u56fe\u7684\u8868\u793a\u65b9\u6cd5\u4e4b\u524d\uff0c\u53ef\u4ee5\u4e86\u89e3\u4e00\u4e0b\u56fe\u7684\u5b9a\u4e49\u3002<\/p>\n\n<h3>\u56fe\u7684\u82e5\u5e72\u5b9a\u4e49<\/h3>\n\n<p>\u4e00\u4e2a\u56fe <span class=\"math\">\\\\( G=(V,E) \\\\)<\/span> \u7531<strong>\u9876\u70b9<\/strong>(vertex)\u96c6\u5408 <span class=\"math\">\\\\( V \\\\)<\/span> \u548c<strong>\u8fb9<\/strong>(edge)\u96c6\u5408 <span class=\"math\">\\\\( E \\\\)<\/span> \u7ec4\u6210\u3002\u9876\u70b9\u7c7b\u4f3c\u4e8e\u6811\u8282\u70b9\u7684\u6982\u5ff5\uff0c\u8fb9\u662f\u4e00\u5bf9\u9876\u70b9\u7684\u5173\u8054 <span class=\"math\">\\\\( (v, w) \\\\)<\/span> \u5176\u4e2d <span class=\"math\">\\\\( v, w \\in V \\\\)<\/span> \uff0c\u8fb9\u6709\u65f6\u4e5f\u79f0\u4e3a<strong>\u5f27<\/strong>(arc)\u3002<\/p>\n\n<p>\u6709\u65f6\u5019\u9876\u70b9\u4e4b\u95f4\u5e76\u4e0d\u662f\u53cc\u5411\u8054\u7cfb\uff0c\u800c\u662f\u50cf\u6811\u4e00\u6837\u7684\u5355\u65b9\u9762\u6307\u5411\uff0c\u8fd9\u79cd\u56fe\u79f0\u4e3a<strong>\u6709\u5411\u56fe<\/strong>(digraph)\u3002\u6709\u5411\u56fe\u7684\u9876\u70b9\u5bf9\u662f\u6709\u5e8f\u7684\u3002\u4e0b\u9762\u5c55\u793a\u4e86\u4e00\u4e2a\u6709\u5411\u56fe\uff0c\u6bcf\u4e24\u4e2a\u6570\u636e\u4e4b\u95f4\u7684\u5bf9\u5e94\u5173\u7cfb\u53ef\u80fd\u662f\u6307\u5411\u4e5f\u53ef\u80fd\u662f\u88ab\u6307\u5411\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-digraph-concept.png\" alt=\"\" width=\"220\">\n<\/figure>\n\n<p>\u6709\u5411\u56fe\u4e2d\u9876\u70b9\u7684<strong>\u5165\u5ea6<\/strong>(indegree)\u6307\u7684\u662f\u7bad\u5934\u6307\u5411\u5b83\u7684\u6570\u91cf\uff0c\u800c<strong>\u51fa\u5ea6<\/strong>(outdegree)\u6307\u7684\u662f\u5b83\u6307\u51fa\u7684\u7bad\u5934\u6570\u91cf\u3002<\/p>\n\n<p>\u4e24\u4e2a\u9876\u70b9 <span class=\"math\">\\\\( v \\\\)<\/span> \u548c <span class=\"math\">\\\\( w \\\\)<\/span> <strong>\u90bb\u63a5<\/strong>(adjacent)\u6307\u7684\u662f\u8fb9 <span class=\"math\">\\\\( (v, w) \\in E \\\\)<\/span> \uff0c\u5373\u4e24\u4e2a\u9876\u70b9\u4e4b\u95f4\u6709\u76f4\u63a5\u8fde\u63a5\uff08\u4e14\u7b26\u5408\u6307\u5411\u987a\u5e8f\uff09\u7684\u8fb9\u3002<\/p>\n\n<p>\u4e00\u4e2a\u8fb9\u6709\u65f6\u4e5f\u5177\u6709<strong>\u503c<\/strong>(cost)\u6216\u79f0\u4e3a<strong>\u6743<\/strong>(weight)\u3002\u4f8b\u5982\u5728\u4e00\u4e2a\u5730\u56fe\u4e2d\uff0c\u4e24\u4e2a\u5730\u70b9\uff08\u9876\u70b9\uff09\u4e4b\u95f4\u8def\u7ebf\uff08\u8fb9\uff09\u7684\u6743\u53ef\u4ee5\u53cd\u6620\u5b83\u4eec\u7684\u8ddd\u79bb\u3002<\/p>\n\n<p>\u56fe\u7684\u4e00\u6761<strong>\u8def\u5f84<\/strong>(path)\u4ece\u4e00\u4e2a\u9876\u70b9\u5230\u53e6\u4e00\u9876\u70b9\u9014\u7ecf\u7684\u6240\u6709\u9876\u70b9\u7ec4\u6210\u7684\u5e8f\u5217\uff0c\u7528\u6570\u5b66\u63cf\u8ff0\u5c31\u662f\u662f\u4e00\u4e2a\u9876\u70b9\u5e8f\u5217 <span class=\"math\">\\\\( w_1, w_2, \\dots, w_N \\\\)<\/span> \u4f7f\u5f97 <span class=\"math\">\\\\( (w_i, w_{i+1}) \\in E \\\\)<\/span> \u3002\u4ece\u4e00\u4e2a\u9876\u70b9\u5230\u81ea\u8eab\u53ef\u4ee5\u770b\u4f5c\u4e00\u6761\u8def\u5f84\uff0c\u8fd9\u79cd\u8def\u5f84\u4e0d\u5305\u542b\u8fb9\uff0c\u8def\u5f84\u957f\u4e3a 0 \u3002<\/p>\n\n<p>\u5982\u679c\u4e00\u4e2a\u9876\u70b9\u5230\u5176\u81ea\u8eab\u5b58\u5728\u4e00\u6761\u8fb9 <span class=\"math\">\\\\( (v, v) \\\\)<\/span> \uff0c\u90a3\u4e48\u8def\u5f84 <span class=\"math\">\\\\( v,v \\\\)<\/span> \u79f0\u4e3a<strong>\u73af<\/strong>(loop)\uff0c\u4e00\u822c\u6765\u8bf4\u5f88\u5c11\u6709\u56fe\u7684\u5e94\u7528\u9700\u8981\u6709\u8fd9\u79cd\u76f4\u63a5\u4e0e\u81ea\u8eab\u6709\u5173\u8054\u7684\u9876\u70b9\u3002<\/p>\n\n<p>\u4e0e\u73af\u76f8\u4f3c\u7684\u6982\u5ff5\u662f<strong>\u5708<\/strong>(cycle)\uff0c\u5982\u679c\u8def\u5f84\u4e2d\u7b2c\u4e00\u4e2a\u9876\u70b9\u548c\u6700\u540e\u4e00\u4e2a\u9876\u70b9\u76f8\u540c\uff0c\u4e14\u8def\u5f84\u7684\u957f\u5ea6\u81f3\u5c11\u4e3a 1\uff08\u81f3\u5c11\u6d89\u53ca\u4e24\u4e2a\u9876\u70b9\uff09\uff0c\u5219\u8fd9\u6837\u7684\u8def\u5f84\u5c31\u662f\u5708\u3002\u5bf9\u4e8e\u65e0\u5411\u56fe\u8fd8\u8981\u6c42\u8fb9\u4e4b\u95f4\u4e92\u4e0d\u76f8\u540c\uff0c\u9632\u6b62\u5728\u4e24\u4e2a\u9876\u70b9\u95f4\u5de6\u53f3\u6a2a\u8df3\u88ab\u8ba4\u4e3a\u662f\u5708\u3002<\/p>\n\n<p>\u5982\u679c\u5728\u4e00\u4e2a\u65e0\u5411\u56fe\u4e2d\u4ece\u6bcf\u4e00\u4e2a\u9876\u70b9\u5230\u5176\u5b83\u9876\u70b9\u4e2d\u90fd\u5b58\u5728\u4e00\u6761\u8def\u5f84\uff0c\u5219\u79f0\u8be5\u65e0\u5411\u56fe\u662f<strong>\u8fde\u901a<\/strong>(connected)\u7684\u3002\u5177\u6709\u8fd9\u6837\u6027\u8d28\u7684\u6709\u5411\u56fe\u79f0\u4e3a<strong>\u5f3a\u8fde\u901a<\/strong>(strongly connected)\u7684\uff1b\u5982\u679c\u5b83\u4e0d\u5177\u5907\u8fd9\u6837\u7684\u6027\u8d28\uff0c\u4f46\u5b83\u7684\u8fb9\u53bb\u6389\u65b9\u5411\u6240\u9000\u5316\u4e3a\u7684\u65e0\u5411\u56fe\u662f\u8fde\u901a\u7684\uff0c\u90a3\u4e48\u8be5\u6709\u5411\u56fe\u662f<strong>\u5f31\u8fde\u901a<\/strong>(weakly connected)\u7684\u3002\u4e00\u4e2a\u6bd4\u8f83\u5178\u578b\u7684\u5b9e\u4f8b\u662f\u822a\u7a7a\u7cfb\u7edf\uff0c\u5982\u679c\u822a\u7a7a\u7f51\u7edc\u6784\u6210\u7684\u56fe\u662f\u5f3a\u8fde\u901a\u7684\uff0c\u90a3\u4e48\u8bf4\u660e\u4ece\u4efb\u610f\u4e00\u4e2a\u822a\u7ad9\u5230\u53e6\u4e00\u4e2a\u822a\u7ad9\u90fd\u53ea\u9700\u8981\u82e5\u5e72\u6b21\u6362\u4e58\uff1b\u5426\u5219\u8fd8\u9700\u8981\u501f\u52a9\u5176\u5b83\u4ea4\u901a\u65b9\u5f0f\u624d\u80fd\u5230\u8fbe\u3002<\/p>\n\n<h3>\u56fe\u7684\u5b9e\u73b0<\/h3>\n\n<p>\u4e0b\u9762\u4ee5\u6709\u5411\u56fe\u4e3a\u4f8b\u8bf4\u660e\u56fe\u7684\u5b9e\u73b0\u3002\u65e0\u5411\u56fe\u53ef\u4ee5\u770b\u4f5c\u6bcf\u4e00\u6761\u8fb9\u90fd\u662f\u53cc\u5411\u8fde\u63a5\u7684\u6709\u5411\u56fe\u3002<\/p>\n\n<p>\u8868\u793a\u56fe\u7684\u4e00\u79cd\u6700\u7b80\u5355\u7684\u65b9\u5f0f\u662f\u4f7f\u7528\u4e8c\u7ef4\u6570\u636e\uff0c\u4e00\u4e2a\u7ef4\u5ea6\u5b58\u50a8\u8fd9\u4e9b\u9876\u70b9\uff0c\u53e6\u4e00\u4e2a\u7ef4\u5ea6\u5b58\u50a8\u9876\u70b9\u4e4b\u95f4\u7684\u5bf9\u5e94\u5173\u7cfb\uff1a\u5982\u679c\u5b58\u5728\u8fb9 <span class=\"math\">\\\\( (u, v) \\\\)<\/span> \uff0c\u90a3\u4e48\u5c31\u7f6e <span class=\"math\">\\\\( A[u][v] \\\\)<\/span> \u4e3a 1 \u6216\u5b83\u7684\u6743\uff1b\u5426\u5219\u5c06\u5176\u6e05\u96f6\u6216\u4f7f\u7528 <span class=\"math\">\\\\( \\infty \\\\)<\/span> \u7b49\u8868\u793a\u3002<\/p>\n\n<p>\u8fd9\u79cd\u4e8c\u7ef4\u6570\u7ec4\u79f0\u4e3a<strong>\u90bb\u63a5\u77e9\u9635<\/strong>(adjacency matrix)\uff0c\u4f7f\u7528\u90bb\u63a5\u77e9\u9635\u8868\u793a\u56fe\u6613\u4e8e\u7406\u89e3\uff0c\u4e14\u5bf9\u65e0\u5411\u56fe\u6765\u8bf4\u7531\u4e8e\u6307\u5411\u5177\u6709\u5bf9\u79f0\u6027\uff0c\u5b58\u50a8\u65f6\u53ef\u4ee5\u91c7\u7528\u4e0a\u4e09\u89d2\u6216\u4e0b\u4e09\u89d2\u77e9\u9635\u8fdb\u4e00\u6b65\u538b\u7f29\u7a7a\u95f4\u3002<\/p>\n\n<p>\u7136\u800c\u90bb\u63a5\u77e9\u9635\u7684\u7a7a\u95f4\u8981\u6c42\u8fd8\u662f\u592a\u591a\u4e86\uff0c\u5b83\u7684\u7a7a\u95f4\u590d\u6742\u5ea6\u4e3a <span class=\"math\">\\\\( O(|V|^2) \\\\)<\/span> \uff0c\u9664\u975e\u56fe\u4e2d\u9876\u70b9\u95f4\u7684\u5173\u8054\u57fa\u672c\u90fd\u5b58\u5728\uff0c\u5426\u5219\u90bb\u63a5\u77e9\u9635\u7684\u5927\u591a\u6570\u4f4d\u7f6e\u90fd\u4e0d\u4f1a\u88ab\u7528\u5230\u3002<\/p>\n\n<p>\u5982\u679c\u8981\u63d0\u9ad8\u7a7a\u95f4\u5229\u7528\u7387\uff0c\u90a3\u4e48\u5c31\u9700\u8981\u53ea\u5b58\u50a8\u5b58\u5728\u7684\u6570\u636e\u800c\u4e0d\u5b58\u50a8\u4e0d\u5b58\u5728\u7684\u6570\u636e\u3002\u90a3\u4e48\u5c31\u53ef\u4ee5\u4f7f\u7528\u94fe\u8868\u8fd9\u79cd\u957f\u5ea6\u53ef\u4ee5\u7075\u6d3b\u8c03\u6574\u7684\u6570\u636e\u7ed3\u6784\uff1a\u5bf9\u4e8e\u6bcf\u4e00\u4e2a\u9876\u70b9\uff0c\u4f7f\u7528\u4e00\u4e2a\u94fe\u8868\u5b58\u653e\u6240\u6709\u90bb\u63a5\u7684\u9876\u70b9\uff0c\u8fd9\u6837\u7a7a\u95f4\u9700\u6c42\u53ea\u4e3a <span class=\"math\">\\\\( O(|V|+|E|) \\\\)<\/span> \u3002\u8fd9\u79cd\u56fe\u7684\u8868\u73b0\u5f62\u5f0f\u79f0\u4e3a<strong>\u90bb\u63a5\u8868<\/strong>(adjacency list)\u3002<\/p>\n\n<p>\u4ee5\u4e0b\u5c55\u793a\u4e86\u56fe\u7684\u90bb\u63a5\u8868\u8868\u793a\u65b9\u6cd5\uff0c\u5de6\u4fa7\u662f\u56fe\u7684\u76f4\u89c2\u7ed3\u6784\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-adjacency-list.png\" alt=\"\" width=\"570\">\n<\/figure>\n\n<p>\u53ef\u4ee5\u770b\u5230\u8fd9\u79cd\u7ed3\u6784\u7c7b\u4f3c\u4e8e\u5206\u79bb\u94fe\u63a5\u6563\u5217\u8868\u3002\u90bb\u63a5\u8868\u662f\u8868\u793a\u56fe\u7684\u57fa\u672c\u65b9\u6cd5\uff0c\u63a5\u4e0b\u6765\u7684\u64cd\u4f5c\u90fd\u4ee5\u90bb\u63a5\u8868\u4e3a\u4f8b\u3002\u90bb\u63a5\u8868\u7684\u5b9a\u4e49\u53ef\u4ee5\u53c2\u8003\u5982\u4e0b\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span style=\"color: #c792ea;\">typedef<\/span> <span token=\"keyword\">struct<\/span> <span token=\"type\">graph_arc<\/span> <span token=\"type\">graph_arc<\/span>;<\/div><div><span style=\"color: #c792ea;\">typedef<\/span> <span token=\"keyword\">struct<\/span> <span token=\"type\">graph_vertex<\/span> {<\/div><div>&nbsp; &nbsp; <span token=\"type\">elemtype<\/span> <span style=\"color: #7fdbca;\">data<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"type\">graph_arc<\/span><span style=\"color: #7fdbca;\">*<\/span> <span style=\"color: #7fdbca;\">firstarc<\/span>;<\/div><div>} <span token=\"type\">graph_vertex<\/span>;<\/div><div><span token=\"keyword\">struct<\/span> <span token=\"type\">graph_arc<\/span> {<\/div><div>&nbsp; &nbsp; <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span style=\"color: #7fdbca;\">vertex<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">struct<\/span> <span token=\"type\">graph_arc<\/span><span style=\"color: #7fdbca;\">*<\/span> <span style=\"color: #7fdbca;\">nextarc<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span style=\"color: #7fdbca;\">weight<\/span>;<\/div><div>};<\/div><div><span style=\"color: #c792ea;\">typedef<\/span> <span token=\"keyword\">struct<\/span> <span token=\"type\">graph<\/span> {<\/div><div>&nbsp; &nbsp; <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">**<\/span> <span style=\"color: #7fdbca;\">vertices<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span style=\"color: #7fdbca;\">vertex_num<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span style=\"color: #7fdbca;\">arc_num<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span style=\"color: #7fdbca;\">size<\/span>;<\/div><div>} <span style=\"color: #7fdbca;\">*<\/span> <span token=\"type\">graph<\/span>;<\/div><\/div>\n\n<p>\u63a5\u4e0b\u6765\u4ecb\u7ecd\u51e0\u4e2a\u5173\u4e8e\u56fe\u7684\u5178\u578b\u95ee\u9898\u3002<\/p>\n\n<h2 id=\"top-sort\">\u62d3\u6251\u6392\u5e8f<\/h2>\n\n<p>\u62d3\u6251\u6392\u5e8f\u662f\u4e00\u79cd\u9488\u5bf9\u6709\u5411\u56fe\u9876\u70b9\u7684\u4e00\u79cd\u6392\u5e8f\uff0c\u7531\u4e8e\u6709\u5411\u56fe\u6709\u6307\u5411\u5173\u7cfb\uff0c\u56e0\u6b64\u53ef\u4ee5\u901a\u8fc7\u8be5\u6307\u5411\u5173\u7cfb\u6765\u4e3a\u9876\u70b9\u5b89\u6392\u5148\u540e\u987a\u5e8f\u3002<\/p>\n\n<p>\u4e00\u79cd\u5178\u578b\u7684\u62d3\u6251\u6392\u5e8f\u5e94\u7528\u5c31\u662f\u9009\u8bfe\u6d41\u7a0b\uff1a\u4e3a\u4e86\u786e\u4fdd\u77e5\u8bc6\u7684\u8fde\u8d2f\u6027\uff0c\u6709\u4e9b\u8bfe\u7a0b\u5fc5\u987b\u5b66\u5b8c\u4e4b\u540e\u624d\u53ef\u4ee5\u7ee7\u7eed\u5b66\u4e60\u4e0b\u4e00\u95e8\u8bfe\u7a0b\uff0c\u90a3\u4e48\u8fd9\u4e9b\u8bfe\u7a0b\u4e4b\u95f4\u5c31\u53ef\u4ee5\u6309\u5b66\u4e60\u987a\u5e8f\u6784\u6210\u4e00\u4e2a\u6709\u5411\u56fe\uff0c\u4f7f\u7528\u62d3\u6251\u6392\u5e8f\u53ef\u4ee5\u786e\u5b9a\u5982\u4f55\u5b89\u6392\u8bfe\u7a0b\u3002<\/p>\n\n<p>\u56e0\u6b64\uff0c\u88ab\u6392\u5e8f\u7684\u56fe\u9664\u4e86\u662f\u6709\u5411\u7684\u5916\uff0c\u8fd8\u8981\u6c42\u5b83\u6ca1\u6709\u5708\uff0c\u4e0d\u7136\u5708\u4e0a\u7684\u5143\u7d20\u6ca1\u6709\u4e25\u683c\u7684\u5148\u540e\u5173\u7cfb\u3002<\/p>\n\n<p>\u4f8b\u5982\uff0c\u4ee5\u4e0b\u56fe\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-top-sort.png\" alt=\"\" width=\"310\">\n<\/figure>\n\n<p>\u9876\u70b9\u7684\u6307\u5411\u987a\u5e8f\u4ece\u5de6\u5411\u53f3\u3002\u7279\u522b\u5730\uff0c\u9876\u70b9 C \u548c D \u4e4b\u95f4\u662f\u5e76\u5217\u7684\uff0c\u6ca1\u6709\u4e25\u683c\u7684\u5148\u540e\u5173\u7cfb\uff0c\u4e24\u8005\u4efb\u610f\u4e00\u4e2a\u6392\u5728\u524d\u9762\u90fd\u53ef\u4ee5\u3002\u56e0\u6b64\uff0c\u4ee5\u4e0a\u56fe\u7684\u62d3\u6251\u6392\u5e8f\u53ef\u4ee5\u6709\u4e24\u79cd\u7ed3\u679c\uff1a<\/p>\n\n<div class=\"codeblock code-template\">\n    A\u2192B\u2192C\u2192D\u2192E<br>\n    A\u2192B\u2192D\u2192C\u2192E\n<\/div>\n\n<p>\u62d3\u6251\u6392\u5e8f\u7684\u601d\u8def\u4e5f\u5f88\u7b80\u5355\uff1a\u5982\u679c\u4e00\u4e2a\u9876\u70b9\u53ef\u4ee5\u6392\u5728\u6700\u524d\u9762\uff0c\u90a3\u4e48\u5e94\u8be5\u6ca1\u6709\u9876\u70b9\u6307\u5411\u5b83\uff0c\u5373\u5b83\u7684\u5165\u5ea6\u4e3a 0 \uff1b\u90a3\u4e48\u53ea\u9700\u8981\u627e\u51fa\u5165\u5ea6\u4e3a 0 \u7684\u9876\u70b9\uff0c\u7136\u540e\u5c06\u5b83\u548c\u5b83\u6307\u51fa\u7684\u8fb9\u6682\u65f6\u6392\u9664\uff0c\u7ee7\u7eed\u5bfb\u627e\u4e0b\u4e00\u4e2a\u7b26\u5408\u6761\u4ef6\uff08\u5165\u5ea6\u4e3a 0 \uff09\u7684\u9876\u70b9\u5373\u53ef\u3002\u4ee5\u4e0b\u5c55\u793a\u4e86\u8fd9\u4e00\u6b65\u9aa4\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-top-sort-steps.png\" alt=\"\" width=\"560\">\n<\/figure>\n\n<p>\u4ee5\u4e0a\u7b97\u6cd5\u53ef\u4ee5\u505a\u4e00\u4e2a\u5c0f\u7684\u4f18\u5316\uff1a\u6bcf\u4e00\u6b21\u67e5\u627e\u5165\u5ea6\u4e3a 0 \u7684\u9876\u70b9\u90fd\u82b1\u8d39 <span class=\"math\">\\\\( O(|V|) \\\\)<\/span> \u7684\u65f6\u95f4\uff0c\u4f46\u53ea\u53d6\u51fa\u4e00\u4e2a\u9876\u70b9\u505a\u5904\u7406\uff0c\u5982\u679c\u4e0b\u4e00\u6b21\u8fd8\u662f\u904d\u5386\u56fe\u53bb\u5bfb\u627e\u5165\u5ea6\u4e3a 0 \u7684\u9876\u70b9\uff0c\u4f1a\u4f7f\u5f97\u7b97\u6cd5\u7684\u8fd0\u884c\u65f6\u95f4\u8fbe\u5230\u4e86\u5e73\u65b9\u7ea7 <span class=\"math\">\\\\( O(|V|^2) \\\\)<\/span> \u3002\u5728\u7b2c\u4e00\u6b21\u626b\u63cf\u65f6\uff0c\u53ef\u4ee5\u5c06\u5165\u5ea6\u4e3a 0 \u7684\u9876\u70b9\u653e\u5165\u4e00\u4e2a\u8868\u4e2d\uff0c\u7136\u540e\u9010\u4e2a\u53d6\u51fa\u8868\u4e2d\u7684\u9876\u70b9\uff0c\u68c0\u67e5\u5b83\u6307\u5411\u7684\u9876\u70b9\u5165\u5ea6\u51cf 1 \u540e\u662f\u5426\u4e3a 0 \uff1a\u53ea\u8981\u4e00\u4e2a\u9876\u70b9\u7684\u5165\u5ea6\u964d\u4e3a 0 \uff0c\u8bf4\u660e\u53bb\u9664\u90a3\u4e9b\u6307\u5411\u5b83\u7684\u9876\u70b9\u540e\u5b83\u5c31\u53ef\u4ee5\u4f5c\u4e3a\u4e0b\u4e00\u4f4d\u7f6e\u7684\u9876\u70b9\uff0c\u53ef\u4ee5\u540c\u6837\u5730\u5c06\u5b83\u653e\u5165\u8868\u4e2d\u7ee7\u7eed\u5904\u7406\u3002<\/p>\n\n<p>\u8fd9\u6837\u5c31\u53ea\u9700\u4e00\u6b21\u626b\u63cf\u9876\u70b9\u548c\u8fb9\u5e76\u5efa\u7acb\u8868\uff0c\u4f7f\u6267\u884c\u65f6\u95f4\u53ef\u4ee5\u53d8\u4e3a <span class=\"math\">\\\\( O(|V|+|E|) \\\\)<\/span> \u3002\u8fd9\u79cd\u8868\u53ef\u4ee5\u4f7f\u7528\u6808\u6216\u961f\u5217\u3002\u8fd9\u91cc\u4f7f\u7528<a href=\"\/archives\/609#queue\">\u961f\u5217<\/a>\u4ee5\u5b9e\u73b0\u987a\u5e8f\u5904\u7406\u3002<\/p>\n\n<p>\u62d3\u6251\u6392\u5e8f\u7684\u4ee3\u7801\u5b9e\u73b0\u4e3a\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span token=\"keyword\">void<\/span> <span style=\"color: #82aaff;\">TopSort<\/span>(<span token=\"type\">graph<\/span> <span style=\"color: #d7dbe0;\">g<\/span>) {<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span token=\"variable\">indegree<\/span>[<span style=\"color: #82aaff;\">VERTEX_MAXNUM<\/span>];<\/div><div>&nbsp; &nbsp; <span style=\"color: #82aaff;\">memset<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #7fdbca;\">&amp;<\/span><span token=\"variable\">indegree<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"number\">0<\/span><span style=\"color: #82aaff;\">, <\/span><span style=\"color: #7fdbca;\">sizeof<\/span><span style=\"color: #82aaff;\"> <\/span><span token=\"variable\">indegree<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; <span style=\"color: #82aaff;\">Graph_GatherInDegree<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #d7dbe0;\">g<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"variable\">indegree<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><br><div>&nbsp; &nbsp; <span token=\"type\">queue<\/span> <span token=\"variable\">q<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">Queue_New<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #82aaff;\">VERTEX_MAXNUM<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"keyword\">int<\/span> <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>; <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">size<\/span>; <span token=\"variable\">i<\/span><span style=\"color: #c792ea;\">++<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span token=\"variable\">indegree<\/span>[<span token=\"variable\">i<\/span>] <span style=\"color: #c792ea;\">==<\/span> <span token=\"number\">0<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span style=\"color: #82aaff;\">Queue_Enqueue<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">, <\/span><span style=\"color: #d7dbe0;\">g<\/span><span style=\"color: #82aaff;\">-&gt;<\/span><span style=\"color: #7fdbca;\">vertices<\/span><span style=\"color: #82aaff;\">[<\/span><span token=\"variable\">i<\/span><span style=\"color: #82aaff;\">]-&gt;<\/span><span style=\"color: #7fdbca;\">data<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><br><div>&nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span token=\"variable\">counter<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">while<\/span> (<span style=\"color: #c792ea;\">!<\/span><span style=\"color: #82aaff;\">Queue_IsEmpty<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">)<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">v<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">Graph_GetVertexByData<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #d7dbe0;\">g<\/span><span style=\"color: #82aaff;\">, <\/span><span style=\"color: #82aaff;\">Queue_Dequeue<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">))<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span style=\"color: #82aaff;\">printf<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #d9f5dd;\">\"<\/span><span style=\"color: #82aaff;\">%d<\/span><span style=\"color: #ecc48d;\"> &gt;<\/span><span style=\"color: #d9f5dd;\">\"<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"variable\">v<\/span><span style=\"color: #82aaff;\">-&gt;<\/span><span style=\"color: #7fdbca;\">data<\/span><span style=\"color: #82aaff;\">)<\/span>;<span style=\"color: #637777;\"> &nbsp;<\/span><span style=\"color: #a8a8a8;\">\/\/<\/span><span style=\"color: #637777;\"> print in topological order<\/span><\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">counter<\/span><span style=\"color: #c792ea;\">++<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"type\">graph_arc<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">v<\/span>-&gt;<span style=\"color: #7fdbca;\">firstarc<\/span>; <span token=\"variable\">arc<\/span>; <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">nextarc<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">w<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span style=\"color: #7fdbca;\">--<\/span><span token=\"variable\">indegree<\/span>[<span style=\"color: #82aaff;\">Graph_GetVertexIndex<\/span>(<span style=\"color: #d7dbe0;\">g<\/span>, <span token=\"variable\">w<\/span>)] <span style=\"color: #c792ea;\">==<\/span> <span token=\"number\">0<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span style=\"color: #82aaff;\">Queue_Enqueue<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"variable\">w<\/span><span style=\"color: #82aaff;\">-&gt;<\/span><span style=\"color: #7fdbca;\">data<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span token=\"variable\">counter<\/span> <span style=\"color: #c792ea;\">!=<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex_num<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span style=\"color: #82aaff;\">warning<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #d9f5dd;\">\"<\/span><span style=\"color: #ecc48d;\">Graph has a cycle<\/span><span style=\"color: #d9f5dd;\">\"<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><br><div>&nbsp; &nbsp; <span style=\"color: #82aaff;\">Queue_Delete<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>}<\/div><\/div>\n\n<p>\u7531\u4e8e\u56fe\u7684\u5b9e\u73b0\u6bd4\u8f83\u590d\u6742\uff0c\u672c\u8282\u6d89\u53ca\u5230\u7684\u4ee3\u7801\u4e00\u822c\u4f1a\u5c06\u4e00\u4e9b\u7ec6\u8282\u62bd\u8c61\u4e3a\u51fd\u6570\uff0c\u4f7f\u7528\u7c7b\u4f3c\u4f2a\u4ee3\u7801\u7684\u5f62\u5f0f\u5c55\u73b0\u3002\u5982\u679c\u8981\u83b7\u53d6\u5305\u62ec\u62d3\u6251\u6392\u5e8f\u5728\u5185\u7684\u5b8c\u6574\u56fe\u8bba\u7b97\u6cd5\u5b9e\u73b0\uff0c\u4ee5\u53ca\u56fe\u7684\u521b\u5efa\u7b49\u5176\u5b83\u64cd\u4f5c\u5b9e\u73b0\uff0c\u53ef\u4ee5\u8bbf\u95ee <a href=\"https:\/\/github.com\/FrozenCandles\/example-code\/blob\/master\/DataStructure\/Src\/graph.c\">GitHub \u4ed3\u5e93<\/a>\u3002<\/p>\n\n<p>\u8fd9\u4e2a\u7a0b\u5e8f\u6bd4\u8f83\u590d\u6742\uff0c\u5b83\u53ef\u4ee5\u5206\u4e3a\u51e0\u4e2a\u90e8\u5206\u7406\u89e3\u3002\u5728\u8ba1\u7b97\u5165\u5ea6\u65f6\uff0c\u7531\u4e8e\u90bb\u63a5\u8868\u53ea\u8bb0\u5f55\u4e00\u4e2a\u9876\u70b9\u6307\u51fa\u7684\u8fb9\uff0c\u56e0\u6b64\u8981\u8ba1\u7b97\u5165\u5ea6\u65f6\u9700\u8981\u904d\u5386\u6240\u6709\u7684\u9876\u70b9\u624d\u80fd\u5b8c\u6574\u5f97\u51fa\u6307\u5411\u4e00\u4e2a\u9876\u70b9\u7684\u6240\u6709\u8fb9\u3002\u8fd9\u91cc\u4f7f\u7528\u4e00\u4e2a\u6570\u7ec4 <code>indegree[]<\/code> \u5728\u4e00\u6b21\u904d\u5386\u65f6\u4fbf\u7edf\u8ba1\u51fa\u6240\u6709\u9876\u70b9\u7684\u8fb9\uff0c\u52a0\u5feb\u8fd0\u884c\u7684\u540c\u65f6\u65b9\u4fbf\u5904\u7406\u3002<\/p>\n\n<p>\u7531\u4e8e\u56fe\u4e2d\u53ef\u80fd\u5b58\u5728\u5708\uff0c\u4f46\u65e0\u6cd5\u901a\u8fc7\u7b80\u5355\u7684\u65b9\u5f0f\u6765\u5224\u65ad\u3002\u4e0d\u8fc7\u5982\u679c\u5b58\u5728\u5708\uff0c\u5708\u4e0a\u7684\u9876\u70b9\u5c31\u4e0d\u4f1a\u964d\u5230 0 \uff0c\u4f7f\u5f97\u5b83\u4eec\u4e0d\u4f1a\u88ab\u6392\u5e8f\u3002\u90a3\u4e48\u6700\u540e\u53ea\u9700\u8981\u5224\u65ad\u6392\u5e8f\u7684\u9876\u70b9\u6570\u662f\u5426\u7b49\u4e8e\u56fe\u4e2d\u5305\u542b\u7684\u9876\u70b9\u6570\uff0c\u5c31\u77e5\u9053\u56fe\u4e2d\u662f\u5426\u5b58\u5728\u5708\u4e86\u3002<\/p>\n\n<h2>\u56fe\u7684\u904d\u5386<\/h2>\n\n<p>\u904d\u5386\u4e5f\u662f\u56fe\u5e38\u7528\u7684\u4e00\u79cd\u64cd\u4f5c\u3002\u904d\u5386\u7684\u8981\u6c42\u662f\u4ece\u56fe\u4e2d\u7684\u67d0\u4e00\u4e2a\u9876\u70b9\u5f00\u59cb\uff0c\u8bbf\u95ee\u6bcf\u4e2a\u8def\u5f84\u4e0a\u80fd\u5230\u8fbe\u7684\u9876\u70b9\u4e14\u6bcf\u4e2a\u9876\u70b9\u5e94\u8be5\u53ea\u8bbf\u95ee\u4e00\u6b21\u3002\u904d\u5386\u53ef\u4ee5\u7528\u4e8e\u89c4\u5212\u8def\u7ebf\u3001\u5b89\u6392\u6d41\u91cf\u3001\u8ba1\u7b97\u5176\u5b83\u6570\u5b66\u91cf\u7b49\u3002<\/p>\n\n<h3>\u6df1\u5ea6\u4f18\u5148\u641c\u7d22<\/h3>\n\n<p><strong>\u6df1\u5ea6\u4f18\u5148\u641c\u7d22<\/strong>(depth-first search, DFS)\u7684\u539f\u7406\u662f\u4ece\u67d0\u4e2a\u9876\u70b9\u641c\u7d22\u65f6\uff0c\u5f53\u641c\u7d22\u5230\u4e0b\u4e00\u4e2a\u9876\u70b9\u65f6\uff0c\u518d\u9012\u5f52\u5730\u4ece\u4e0b\u4e00\u4e2a\u9876\u70b9\u7ee7\u7eed\u641c\u7d22\u4e0b\u4e00\u4e2a\u9876\u70b9\u3002<\/p>\n\n<p>\u4e0b\u56fe\u5c55\u793a\u4e86\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u67d0\u4e00\u65f6\u523b\u9876\u70b9\u7684\u641c\u7d22\u60c5\u51b5\uff0c\u53ef\u4ee5\u770b\u51fa\u8fdc\u5904\u7684\u9876\u70b9\u53ef\u80fd\u4f1a\u88ab\u5148\u641c\u7d22\u5230\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-DFS.png\" alt=\"\" width=\"360\">\n<\/figure>\n\n<p>\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u53ef\u4ee5\u4f7f\u7528\u9012\u5f52\u7684\u5f62\u5f0f\u6765\u6c42\u89e3\u3002\u53e6\u5916\u4e3a\u4e86\u8ba9\u6bcf\u4e2a\u9876\u70b9\u53ea\u904d\u5386\u4e00\u6b21\uff0c\u8fd8\u9700\u8981\u6709\u4e00\u4e2a\u989d\u5916\u7684\u9876\u70b9\u5b57\u6bb5\u6216\u6570\u7ec4\u8bb0\u5f55\u9876\u70b9\u662f\u5426\u88ab\u8bbf\u95ee\u8fc7\u3002<\/p>\n\n<p>\u4ee5\u4e0b\u4ee3\u7801\u662f\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u7684\u4e00\u4e2a\u901a\u7528\u5f62\u5f0f\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span token=\"keyword\">void<\/span> <span style=\"color: #82aaff;\">Graph_DepthFirstSearch<\/span>(<span token=\"type\">graph<\/span> <span style=\"color: #d7dbe0;\">g<\/span>, <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span style=\"color: #d7dbe0;\">v<\/span>) {<\/div><div>&nbsp; &nbsp; <span token=\"variable\">visited<\/span>[<span style=\"color: #d7dbe0;\">v<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">true<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"type\">graph_arc<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #d7dbe0;\">v<\/span>-&gt;<span style=\"color: #7fdbca;\">firstarc<\/span>; <span token=\"variable\">arc<\/span>; <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">nextarc<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">w<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span style=\"color: #c792ea;\">!<\/span><span token=\"variable\">visited<\/span>[<span token=\"variable\">w<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>])<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span style=\"color: #82aaff;\">Graph_DepthFirstSearch<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #d7dbe0;\">g<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"variable\">w<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; }<\/div><div>}<\/div><\/div>\n\n<p>\u503c\u7684\u6ce8\u610f\u7684\u662f\uff0c\u5982\u679c\u56fe\u662f\u65e0\u5411\u4e0d\u8fde\u901a\u6216\u6709\u5411\u5f31\u8fde\u901a\u7684\uff0c\u672a\u5fc5\u6240\u6709\u9876\u70b9\u90fd\u4f1a\u5728\u6b64\u8fc7\u7a0b\u4e2d\u8bbf\u95ee\u5230\u3002<\/p>\n\n<h3>\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22<\/h3>\n\n<p>\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u7684\u7f3a\u70b9\u662f\u6709\u65f6\u8981\u641c\u7d22\u7684\u9876\u70b9\u53ef\u80fd\u79bb\u5b83\u8f83\u8fd1\uff0c\u4f46\u7a0b\u5e8f\u53ef\u80fd\u4f1a\u82b1\u8d39\u5f88\u591a\u4e0d\u5fc5\u8981\u7684\u65f6\u95f4\u5904\u7406\u66f4\u8fdc\u7684\u9876\u70b9\u3002\u8fd9\u5728\u56fe\u5f88\u5927\u65f6\u4e0d\u5229\u4e8e\u5904\u7406\u8f83\u8fd1\u7684\u9876\u70b9\u3002<strong>\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22<\/strong>(breadth-first search)\u5219\u4f18\u5148\u5904\u7406\u8f83\u8fd1\u7684\u9876\u70b9\uff0c\u7136\u540e\u518d\u5904\u7406\u66f4\u8fdc\u7684\u9876\u70b9\u3002<\/p>\n\n<p>\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\u7684\u539f\u7406\u4e3a\uff1a\u4ece\u67d0\u4e00\u9876\u70b9\u5f00\u59cb\u641c\u7d22\u65f6\uff0c\u904d\u5386\u6bcf\u4e00\u4e2a\u9876\u70b9\u65f6\uff0c\u4f9d\u6b21\u904d\u5386\u5176\u6240\u6709\u7684\u90bb\u63a5\u70b9\uff0c\u7136\u540e\u518d\u4ece\u8fd9\u4e9b\u90bb\u63a5\u70b9\u51fa\u53d1\uff0c\u540c\u6837\u4f9d\u6b21\u8bbf\u95ee\u5b83\u4eec\u7684\u90bb\u63a5\u70b9\u3002\u6309\u7167\u6b64\u8fc7\u7a0b\uff0c\u76f4\u5230\u56fe\u4e2d\u6240\u6709\u88ab\u8bbf\u95ee\u8fc7\u7684\u9876\u70b9\u7684\u90bb\u63a5\u70b9\u90fd\u88ab\u8bbf\u95ee\u5230\u3002<\/p>\n\n<p>\u4e0b\u56fe\u5c55\u793a\u4e86\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\u67d0\u4e00\u65f6\u523b\u9876\u70b9\u7684\u641c\u7d22\u60c5\u51b5\uff0c\u641c\u7d22\u7684\u9876\u70b9\u4ece\u8d77\u70b9\u5f00\u59cb\u5411\u5916\u8f90\u5c04\u5c55\u5f00\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-BFS.png\" alt=\"\" width=\"360\">\n<\/figure>\n\n<p>\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\u9700\u8981\u5728\u8bbf\u95ee\u4e00\u6279\u9876\u70b9\u65f6\u4fdd\u5b58\u8fd9\u4e9b\u9876\u70b9\u7684\u4fe1\u606f\uff0c\u8fd9\u6837\u4e0b\u4e00\u6b21\u624d\u80fd\u5411\u5916\u62d3\u5c55\u4e00\u5c42\u3002\u4fdd\u5b58\u5df2\u8bbf\u95ee\u4f46\u8fd8\u6ca1\u5411\u5916\u62d3\u5c55\u7684\u9876\u70b9\u53ef\u4ee5\u4f7f\u7528\u961f\u5217\u6765\u5b9e\u73b0\uff0c\u5e76\u4e14\u4f7f\u7528\u961f\u5217\u53ef\u4ee5\u8ba9\u5148\u5411\u5916\u62d3\u5c55\u7684\u9876\u70b9\u4e0b\u4e00\u6b21\u4e5f\u5148\u5411\u5916\u62d3\u5c55\u3002<\/p>\n\n<p>\u4ee5\u4e0b\u4ee3\u7801\u662f\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\u7684\u4e00\u4e2a\u901a\u7528\u5f62\u5f0f\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span token=\"keyword\">void<\/span> <span style=\"color: #82aaff;\">Graph_BreadthFirstSearch<\/span>(<span token=\"type\">graph<\/span> <span style=\"color: #d7dbe0;\">g<\/span>, <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span style=\"color: #d7dbe0;\">v<\/span>) {<\/div><div>&nbsp; &nbsp; <span style=\"color: #82aaff;\">bool<\/span> <span token=\"variable\">visited<\/span>[<span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span token=\"variable\">size<\/span>];<\/div><div>&nbsp; &nbsp; <span style=\"color: #82aaff;\">memset<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">visited<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"number\">0<\/span><span style=\"color: #82aaff;\">, <\/span><span style=\"color: #7fdbca;\">sizeof<\/span><span style=\"color: #82aaff;\"> <\/span><span token=\"variable\">visited<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"type\">queue<\/span> <span token=\"variable\">q<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">Queue_New<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #82aaff;\">VERTEX_MAXNUM<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span style=\"color: #c792ea;\">!<\/span><span token=\"variable\">visited<\/span>[<span style=\"color: #d7dbe0;\">v<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>]) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">visited<\/span>[<span style=\"color: #d7dbe0;\">v<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">true<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span style=\"color: #82aaff;\">Queue_Enqueue<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">, <\/span><span style=\"color: #d7dbe0;\">v<\/span><span style=\"color: #82aaff;\">-&gt;<\/span><span style=\"color: #7fdbca;\">data<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">while<\/span> (<span style=\"color: #c792ea;\">!<\/span><span style=\"color: #82aaff;\">Queue_IsEmpty<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">)<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">w<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">Graph_GetVertexByData<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #d7dbe0;\">g<\/span><span style=\"color: #82aaff;\">, <\/span><span style=\"color: #82aaff;\">Queue_Dequeue<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">))<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"type\">graph_arc<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">w<\/span>-&gt;<span style=\"color: #7fdbca;\">firstarc<\/span>; <span token=\"variable\">arc<\/span>; <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">nextarc<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span style=\"color: #c792ea;\">!<\/span><span token=\"variable\">visited<\/span>[<span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>]) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">visited<\/span>[<span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">true<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span style=\"color: #82aaff;\">Queue_Enqueue<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"variable\">arc<\/span><span style=\"color: #82aaff;\">-&gt;<\/span><span style=\"color: #7fdbca;\">vertex<\/span><span style=\"color: #82aaff;\">-&gt;<\/span><span style=\"color: #7fdbca;\">data<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; <span style=\"color: #82aaff;\">Queue_Delete<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">q<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>}<\/div><\/div>\n\n<p>\u56fe\u7684\u4e24\u79cd\u904d\u5386\u65b9\u5f0f\u5404\u6709\u4fa7\u91cd\u70b9\uff0c\u5b83\u4eec\u90fd\u6709\u6bd4\u8f83\u5178\u578b\u7684\u5e94\u7528\u3002<\/p>\n\n<h2>\u6700\u77ed\u8def\u5f84\u7b97\u6cd5<\/h2>\n\n<p>\u56fe\u7684\u9876\u70b9\u4e4b\u95f4\u4f1a\u4e92\u76f8\u8054\u7cfb\uff0c\u5f62\u6210\u4e00\u79cd\u7f51\u72b6\u7ed3\u6784\u3002\u8fd9\u4e2a\u65f6\u5019\u67e5\u627e\u4e24\u4e2a\u9876\u70b9\u4e4b\u95f4\u7684\u6700\u77ed\u8def\u5f84\u5c31\u662f\u4e00\u4e2a\u5e38\u89c1\u7684\u95ee\u9898\u3002\u4f8b\u5982\uff0c\u5bfc\u822a\u548c\u6e38\u620f\u5728\u5bfb\u8def\u65f6\u90fd\u9700\u8981\u5728\u5730\u56fe\u4e0a\u7684\u4e24\u70b9\u5185\u89c4\u5212\u4e00\u6761\u6700\u77ed\u7684\u8def\u7ebf\u3002<\/p>\n\n<h3>\u65e0\u6743\u56fe\u7684\u6700\u77ed\u8def\u5f84<\/h3>\n\n<p>\u65e0\u6743\u56fe\u5728\u5bfb\u627e\u6700\u77ed\u8def\u5f84\u65f6\u53ea\u9700\u8981\u8003\u8651\u8fb9\u7684\u6761\u6570\uff0c\u800c\u4e0d\u9700\u8981\u8003\u8651\u8fb9\u7684\u6743\u91cd\uff0c\u56e0\u6b64\u8fd9\u79cd\u60c5\u51b5\u5b9e\u73b0\u8d77\u6765\u6bd4\u8f83\u7b80\u5355\uff1a\u5728\u8ba1\u7b97\u9876\u70b9 <span class=\"math\">\\\\( v_1 \\\\)<\/span> \u5230 <span class=\"math\">\\\\( v_2 \\\\)<\/span> \u7684\u6700\u77ed\u8def\u5f84\u65f6\uff0c\u53ea\u9700\u8981\u4f7f\u8def\u5f84\u4e0a\u5177\u6709\u6700\u5c11\u7684\u8fb9\u5373\u53ef\u3002<\/p>\n\n<p>\u65e0\u6743\u56fe\u7684\u6700\u77ed\u8def\u5f84\u53ef\u4ee5\u4f7f\u7528\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\u7684\u601d\u60f3\u89e3\u51b3\uff1a\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\u6bcf\u5411\u5916\u62d3\u5c55\u4e00\u5c42\uff0c\u90a3\u4e48\u8def\u5f84\u957f\u4fbf\u589e\u52a0 1 \uff0c\u5e76\u4e14\u7b2c\u4e00\u6b21\u9047\u5230\u4e00\u4e2a\u9876\u70b9\u65f6\u7684\u8def\u5f84\u662f\u79bb\u8d77\u70b9\u6700\u77ed\u7684\u8def\u5f84\u3002<\/p>\n\n<p>\u53ef\u4ee5\u901a\u8fc7\u4e00\u4e2a\u9644\u52a0\u7684\u9876\u70b9\u5b57\u6bb5\u6216\u6570\u7ec4\u8bb0\u5f55\u6bcf\u4e2a\u9876\u70b9\u79bb\u8d77\u70b9\u7684\u6700\u77ed\u8def\u5f84\uff0c\u5e76\u4e14\u5b83\u53ef\u4ee5\u4ee3\u66ff\u4e4b\u524d\u4f7f\u7528\u7684 <code>visited[]<\/code> \u6570\u7ec4\uff1a\u5728\u8d77\u59cb\u65f6\u7f6e\u6240\u6709\u9876\u70b9\u7684\u8def\u5f84\u4e3a -1\uff08\u65e0\u9650\u8fdc\uff09\uff0c\u6bcf\u641c\u7d22\u5230\u4e00\u4e2a\u9876\u70b9\uff0c\u53ea\u8981\u5b83\u662f\u65e0\u9650\u8fdc\uff0c\u90a3\u5c31\u8bf4\u660e\u6ca1\u6709\u8bbf\u95ee\u8fc7\uff0c\u5c06\u5176\u8def\u5f84\u957f\u7f6e\u4e3a\u4e0a\u4e00\u7ea7\u9876\u70b9\u7684\u8def\u5f84\u957f\u591a 1 \u3002<\/p>\n\n<p>\u65e0\u6743\u56fe\u8ba1\u7b97\u6700\u77ed\u8def\u5f84\u7684\u5b9e\u73b0\u65b9\u5f0f\u548c\u5e7f\u5ea6\u4f18\u5148\u7b97\u6cd5\u6bd4\u8f83\u76f8\u4f3c\u3002\u63a5\u4e0b\u6765\u4ecb\u7ecd\u6709\u6743\u56fe\u6700\u77ed\u8def\u5f84\u7684\u7b97\u6cd5\u5b9e\u73b0\u3002<\/p>\n\n<h3>\u6709\u6743\u56fe\u7684\u6700\u77ed\u8def\u5f84<\/h3>\n\n<p>\u5982\u679c\u5728\u8ba1\u7b97\u6700\u77ed\u8def\u5f84\u65f6\u8981\u8003\u8651\u5230\u8fb9\u4e0a\u7684\u6743\uff0c\u90a3\u4e48\u8ba1\u7b97\u6700\u77ed\u8def\u5f84\u5c31\u4f1a\u590d\u6742\u8bb8\u591a\uff0c\u4e0d\u8fc7\u57fa\u672c\u7684\u5904\u7406\u601d\u8def\u4f9d\u7136\u53ef\u4ee5\u53c2\u8003\u65e0\u6743\u56fe\u3002<\/p>\n\n<p>Dijkstra \u7b97\u6cd5\u662f\u4e00\u4e2a\u89e3\u51b3\u6709\u6743\u6700\u77ed\u8def\u5f84\u95ee\u9898\u7684\u8f83\u597d\u7684\u7b97\u6cd5\u3002\u8be5\u7b97\u6cd5\u548c\u65e0\u6743\u6700\u77ed\u8def\u5f84\u95ee\u9898\u4e00\u6837\u5206\u9636\u6bb5\u6267\u884c\uff1a\u6bcf\u4e2a\u9636\u6bb5\u8be5\u7b97\u6cd5\u9009\u62e9\u5728\u672a\u8bbf\u95ee\u9876\u70b9\u4e2d\u8def\u5f84\u957f <span class=\"math\">\\\\( d_v \\\\)<\/span> \u6700\u5c0f\u7684\u9876\u70b9 <span class=\"math\">\\\\( v \\\\)<\/span> \uff0c\u5e76\u901a\u8fc7\u8be5\u9876\u70b9\u66f4\u65b0\u90bb\u63a5\u9876\u70b9\u7684\u957f\u5ea6\uff1a\u5982\u679c\u4ece <span class=\"math\">\\\\( v \\\\)<\/span> \u5230\u90bb\u63a5\u9876\u70b9 <span class=\"math\">\\\\( w \\\\)<\/span> \u7684\u8def\u5f84\u6bd4\u4ece\u5176\u5b83\u9876\u70b9\u5230 <span class=\"math\">\\\\( w \\\\)<\/span> \u7684\u8def\u5f84\u66f4\u77ed\uff0c\u90a3\u4e48\u5c31\u66f4\u65b0 <span class=\"math\">\\\\( w \\\\)<\/span> \u6700\u77ed\u8def\u5f84\u3002<\/p>\n\n<p>\u4f8b\u5982\uff0c\u5047\u8bbe\u8981\u5728\u4ee5\u4e0b\u6709\u5411\u6709\u6743\u56fe\u4e2d\u5bfb\u627e\u4ece <span class=\"math\">\\\\( v_1 \\\\)<\/span> \u5230 <span class=\"math\">\\\\( v_8 \\\\)<\/span> \u7684\u6700\u77ed\u8def\u5f84\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Dijkstra-step-1.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u90a3\u4e48\u9996\u5148\u4ece <span class=\"math\">\\\\( v_1 \\\\)<\/span> \u5f00\u59cb\uff0c\u6807\u8bb0\u51fa\u4ece\u5b83\u5230\u90bb\u63a5\u9876\u70b9\u7684\u8def\u5f84\uff0c\u5e76\u6682\u65f6\u89c6\u4e3a\u6700\u77ed\u8def\u5f84\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Dijkstra-step-2.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u7136\u540e\u627e\u5230\u672a\u8bbf\u95ee\u4e14\u5177\u6709\u6700\u77ed\u8def\u5f84\u7684\u9876\u70b9\uff0c\u5373\u9876\u70b9 <span class=\"math\">\\\\( v_2 \\\\)<\/span> \uff0c\u518d\u6807\u8bb0\u51fa\u7ecf\u7531\u5b83\u5230\u90bb\u63a5\u9876\u70b9\u7684\u8def\u5f84\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Dijkstra-step-3.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u6bcf\u6b21\u66f4\u65b0\u5b8c\u90bb\u63a5\u9876\u70b9\u7684\u8def\u5f84\u540e\uff0c\u90fd\u7ee7\u7eed\u4ece\u672a\u8bbf\u95ee\u7684\u9876\u70b9\u4e2d\u627e\u51fa\u5177\u6709\u6700\u77ed\u8def\u5f84\u7684\u9876\u70b9\u3002<\/p>\n\n<p>\u672c\u6b21\u627e\u5230\u7684\u9876\u70b9\u4e3a <span class=\"math\">\\\\( v_6 \\\\)<\/span> \uff0c\u8ba1\u7b97\u5b83\u90bb\u63a5\u9876\u70b9\u7684\u8def\u5f84\u957f\u65f6\uff0c\u53d1\u73b0\u4ece\u5b83\u5230 <span class=\"math\">\\\\( v_3 \\\\)<\/span> \u6bd4\u4ece\u5df2\u5230\u8fbe\u7684\u9876\u70b9\u5230 <span class=\"math\">\\\\( v_3 \\\\)<\/span> \u8def\u5f84\u66f4\u77ed\uff0c\u90a3\u4e48\u5c31\u66f4\u65b0\u5230 <span class=\"math\">\\\\( v_3 \\\\)<\/span> \u7684\u6700\u77ed\u8def\u5f84\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Dijkstra-step-4.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u91cd\u590d\u4ee5\u4e0a\u6b65\u9aa4\uff0c\u76f4\u5230\u786e\u5b9a\u4e86 <span class=\"math\">\\\\( v_1 \\\\)<\/span> \u4e0e\u56fe\u4e2d\u6240\u6709\u9876\u70b9\u7684\u6700\u77ed\u8def\u5f84\u540e\u624d\u7ed3\u675f\u7b97\u6cd5\u3002<\/p>\n\n<p>\u4f8b\u5982\uff0c\u63a5\u4e0b\u6765\u4e24\u6b65\u662f\u5904\u7406 <span class=\"math\">\\\\( v_3 \\\\)<\/span> \u548c <span class=\"math\">\\\\( v_4 \\\\)<\/span> \u9876\u70b9\u5e76\u66f4\u65b0\u5b83\u4eec\u90bb\u63a5\u9876\u70b9\u7684\u8def\u5f84\u957f\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Dijkstra-step-5.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>Dijkstra \u7b97\u6cd5\u4e5f\u53ef\u7528\u4e8e\u5904\u7406\u65e0\u5411\u56fe\u7684\u6700\u77ed\u8def\u5f84\uff0c\u751a\u81f3\u53ef\u4ee5\u7528\u4e8e\u5904\u7406\u65e0\u6743\u56fe\u7684\u6700\u77ed\u8def\u5f84\uff08\u65e0\u6743\u56fe\u53ef\u4ee5\u5c06\u6bcf\u6761\u8fb9\u7684\u6743\u770b\u4f5c 1 \uff09\u3002<\/p>\n\n<p>Dijkstra \u7b97\u6cd5\u7684\u4ee3\u7801\u5927\u81f4\u5b9e\u73b0\u5982\u4e0b\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span token=\"keyword\">int<\/span> <span style=\"color: #82aaff;\">Graph_WeightedPath_Dijkstra<\/span>(<span token=\"type\">graph<\/span> <span style=\"color: #d7dbe0;\">g<\/span>, <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span style=\"color: #d7dbe0;\">v<\/span>, <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span style=\"color: #d7dbe0;\">w<\/span>) {<\/div><div>&nbsp; &nbsp; <span style=\"color: #82aaff;\">bool<\/span> <span token=\"variable\">visited<\/span>[<span style=\"color: #82aaff;\">VERTEX_MAXNUM<\/span>];<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span token=\"variable\">minpathlen<\/span>[<span style=\"color: #82aaff;\">VERTEX_MAXNUM<\/span>];<\/div><div>&nbsp; &nbsp; <span style=\"color: #82aaff;\">memset<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">visited<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"number\">0<\/span><span style=\"color: #82aaff;\">, <\/span><span style=\"color: #7fdbca;\">sizeof<\/span><span style=\"color: #82aaff;\"> <\/span><span token=\"variable\">visited<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"keyword\">int<\/span> <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>; <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span style=\"color: #82aaff;\">VERTEX_MAXNUM<\/span>; <span token=\"variable\">i<\/span><span style=\"color: #c792ea;\">++<\/span>) <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">i<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">INT_MAX<\/span>;<\/div><div>&nbsp; &nbsp; <\/div><div>&nbsp; &nbsp; <span token=\"variable\">minpathlen<\/span>[<span style=\"color: #d7dbe0;\">v<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"keyword\">int<\/span> <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>; <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">size<\/span>; <span token=\"variable\">i<\/span><span style=\"color: #c792ea;\">++<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span style=\"color: #c792ea;\">!<\/span><span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertices<\/span>[<span token=\"variable\">i<\/span>]) <span token=\"keyword\">continue<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span token=\"variable\">minv<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span token=\"variable\">minlen<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">INT_MAX<\/span>;<\/div><br><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"keyword\">int<\/span> <span token=\"variable\">j<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>; <span token=\"variable\">j<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">size<\/span>; <span token=\"variable\">j<\/span><span style=\"color: #c792ea;\">++<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span style=\"color: #c792ea;\">!<\/span><span token=\"variable\">visited<\/span>[<span token=\"variable\">j<\/span>] <span style=\"color: #c792ea;\">&amp;&amp;<\/span> <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">j<\/span>] <span style=\"color: #c792ea;\">&lt;<\/span> <span token=\"variable\">minlen<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">minv<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">j<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">minlen<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">minv<\/span>];<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">visited<\/span>[<span token=\"variable\">minv<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">true<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">v_k<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">Graph_GetVertexByData<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #d7dbe0;\">g<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"variable\">minv<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"type\">graph_arc<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">v_k<\/span>-&gt;<span style=\"color: #7fdbca;\">firstarc<\/span>; <span token=\"variable\">arc<\/span>; <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">nextarc<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"type\">graph_vertex<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">u<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span style=\"color: #c792ea;\">!<\/span><span token=\"variable\">visited<\/span>[<span token=\"variable\">u<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">&amp;&amp;<\/span> (<span token=\"variable\">minlen<\/span> <span style=\"color: #7fdbca;\">+<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">weight<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">u<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>]))<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">u<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">minlen<\/span> <span style=\"color: #7fdbca;\">+<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">weight<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">return<\/span> <span token=\"variable\">minpathlen<\/span>[<span style=\"color: #d7dbe0;\">w<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>];<\/div><div>}<\/div><\/div>\n\n<p>\u6ce8\u610f\u4e00\u4e2a\u5df2\u8ba1\u7b97\u8def\u5f84\u6700\u5c0f\u503c\u7684\u9876\u70b9\u672a\u5fc5\u88ab\u8bbf\u95ee\u8fc7\u3002<\/p>\n\n<p>Dijkstra \u7b97\u6cd5\u9700\u8981\u82b1\u8d39\u7ebf\u6027\u7684\u65f6\u95f4\u5904\u7406\u5b8c\u6240\u6709\u9876\u70b9\uff1b\u6bcf\u5904\u7406\u4e00\u4e2a\u9876\u70b9\uff0c\u63a5\u4e0b\u6765\u8fd8\u9700\u8981\u82b1\u8d39\u7ebf\u6027\u65f6\u95f4\u67e5\u627e\u672a\u8bbf\u95ee\u9876\u70b9\u7684\u8def\u5f84\u6700\u5c0f\u503c\uff0c\u800c\u6240\u6709\u9876\u70b9\u7684\u6700\u5c0f\u8def\u5f84\u957f\u9700\u8981\u904d\u5386\u6240\u6709\u8fb9\u624d\u80fd\u5f97\u51fa\u4e00\u4e2a\u786e\u5b9a\u7684\u7ed3\u679c\uff0c\u56e0\u6b64\u8be5\u7b97\u6cd5\u7684\u65f6\u95f4\u590d\u6742\u5ea6\u4e3a <span class=\"math\">\\\\( O(|V|^2+|E|) = O(|V|^2 \\\\)<\/span> \u3002<\/p>\n\n<p>\u5982\u679c\u56fe\u8f83\u4e3a\u7a20\u5bc6\uff08\u6bcf\u4e24\u4e2a\u9876\u70b9\u95f4\u57fa\u672c\u90fd\u6709\u8fb9\uff0c<span class=\"math\">\\\\( |E| \\approx |V|^2 \\\\)<\/span> \uff09\uff0c\u90a3\u4e48\u8be5\u7b97\u6cd5\u7684\u6548\u7387\u57fa\u672c\u5df2\u7ecf\u662f\u6700\u4f18\u7684\u4e86\u3002<\/p>\n\n<p>\u5426\u5219\u5f53\u8fb9\u8f83\u4e3a\u7a00\u758f\u65f6\uff0c\u4ee5\u4e0a\u7b97\u6cd5\u8fd8\u6709\u4f18\u5316\u7684\u7a7a\u95f4\u3002\u4f18\u5316\u4e3b\u8981\u4f53\u73b0\u5728\u7ebf\u6027\u65f6\u95f4\u7684\u6700\u5c0f\u503c\u67e5\u627e\u4e0a\uff0c\u53ef\u4ee5\u501f\u52a9\u4f18\u5148\u961f\u5217\uff08\u5806\uff09\u964d\u4f4e\u67e5\u627e\u7684\u65f6\u95f4\u3002\u7531\u4e8e\u4f18\u5148\u961f\u5217\u7684\u5220\u9664\u6700\u5c0f\u503c\u9700\u8981 <span class=\"math\">\\\\( O(\\log N) \\\\)<\/span> \u65f6\u95f4\uff0c\u56e0\u6b64\u4f7f\u7528\u4f18\u5148\u961f\u5217\u7684 Dijkstra \u7b97\u6cd5\u82b1\u8d39\u7684\u603b\u65f6\u95f4\u4e3a <span class=\"math\">\\\\( O(|E|\\log |V| + |V|\\log |V|) = O(|E| log |V|) \\\\)<\/span> \uff0c\u5728\u8fb9\u6570\u8f83\u5c11\u65f6\u53ef\u4ee5\u52a0\u5feb\u8fd0\u884c\u6548\u7387\u3002<\/p>\n\n<p>\u4f7f\u7528\u5806\u5b58\u50a8\u8def\u5f84\u957f\u7684\u7f3a\u70b9\u662f\u4e8c\u53c9\u5806\u4e0d\u652f\u6301\u67e5\u627e\uff0c\u96be\u4ee5\u4fee\u6539\u4e00\u4e2a\u9876\u70b9\u7684\u6700\u5c0f\u8def\u5f84\u957f\u3002\u8981\u6539\u8fdb\u8fd9\u4e2a\u95ee\u9898\u53ea\u80fd\u4f7f\u7528\u66f4\u9ad8\u7ea7\u7684\u4f18\u5148\u961f\u5217\u7ed3\u6784\uff0c\u8fd9\u91cc\u6682\u4e0d\u8ba8\u8bba\u8fd9\u4e2a\u95ee\u9898\u3002<\/p>\n\n<p>\u9664\u6b64\u4e4b\u5916\uff0cDijkstra \u7b97\u6cd5\u5728\u67d0\u4e9b\u60c5\u51b5\u4e0b\u4e5f\u53ef\u80fd\u5931\u6548\u3002\u4f8b\u5982\u5f53\u8fb9\u7684\u6743\u4e3a\u8d1f\u503c\u7684\u65f6\u5019\uff0c\u90a3\u4e48\u4e00\u4e2a\u5df2\u8bbf\u95ee\u7684\u9876\u70b9\u5e76\u4e0d\u4e00\u5b9a\u5df2\u7ecf\u8ba1\u7b97\u51fa\u6700\u77ed\u8def\u5f84\uff0c\u56e0\u4e3a\u53ef\u80fd\u4ece\u672a\u8bbf\u95ee\u9876\u70b9\u6709\u4e00\u6761\u8d1f\u503c\u5f88\u5927\u7684\u8def\u5f84\u6307\u5411\u5b83\u4f7f\u5f97\u4ece\u66f4\u8fdc\u7684\u9876\u70b9\u5230\u8fd9\u91cc\u53cd\u800c\u53ef\u80fd\u53d8\u5f97\u66f4\u77ed\uff0c\u95ee\u9898\u662f\u8be5\u9876\u70b9\u5df2\u7ecf\u7528\u4e8e\u8ba1\u7b97\u90bb\u63a5\u9876\u70b9\u7684\u6700\u77ed\u8def\u5f84\uff0c\u4e0d\u80fd\u53ea\u66f4\u65b0\u8be5\u9876\u70b9\u7684\u6700\u77ed\u8def\u5f84\u957f\u3002\u4e00\u4e2a\u6700\u574f\u7684\u60c5\u51b5\u4e0b\uff0c\u56fe\u4e2d\u53ef\u80fd\u6709\u542b\u6709\u8d1f\u503c\u8fb9\u7684\u5708\uff0c\u5e76\u4e14\u8fd9\u4e2a\u8d1f\u503c\u53ef\u80fd\u5f88\u5927\u4f7f\u5f97\u6bcf\u8d70\u5b8c\u4e00\u5708\u8def\u5f84\u53cd\u800c\u4f1a\u53d8\u77ed\u3002\u5982\u679c\u4e0d\u5904\u7406\u8fd9\u79cd\u60c5\u51b5\u5f88\u5bb9\u6613\u4f1a\u9020\u6210\u65e0\u9650\u5faa\u73af\u3002<\/p>\n\n<p>\u65e0\u6743\u6700\u77ed\u8def\u5f84\u548c\u6709\u6743\u6700\u77ed\u8def\u5f84\u7684\u7b97\u6cd5\u90fd\u53ef\u4ee5\u5f97\u51fa\u6700\u77ed\u8def\u5f84\uff1a\u53ef\u4ee5\u589e\u52a0\u4e00\u4e2a\u8f85\u52a9\u9876\u70b9\u5b57\u6bb5\u6216\u6570\u7ec4\uff0c\u8bb0\u5f55\u5230\u8fbe\u8be5\u9876\u70b9\u7684\u6700\u77ed\u8def\u5f84\u7684\u4e0a\u4e00\u4e2a\u9876\u70b9\u7684\u4fe1\u606f\uff0c\u6700\u540e\u6536\u96c6\u8fd9\u4e9b\u4fe1\u606f\uff0c\u5c31\u53ef\u4ee5\u4ece\u76ee\u7684\u9876\u70b9\u9006\u5e8f\u5230\u8fbe\u8d77\u59cb\u9876\u70b9\u3002<\/p>\n\n<h2>\u6700\u5c0f\u751f\u6210\u6811<\/h2>\n\n<p><strong>\u6700\u5c0f\u751f\u6210\u6811<\/strong>(minimum spanning tree)\u662f\u4e00\u4e2a\u4e3b\u8981\u9488\u5bf9\u65e0\u5411\u56fe\u7684\u95ee\u9898\u3002\u4e00\u4e2a\u65e0\u5411\u56fe\u7684\u6700\u5c0f\u751f\u6210\u6811\u5c31\u662f\u7531\u56fe\u4e2d\u6240\u6709\u9876\u70b9\u548c\u90e8\u5206\u8fb9\u6784\u6210\u7684\u53e6\u4e00\u4e2a\u56fe\uff0c\u4e14\u8fb9\u7684\u6743\u91cd\u4e4b\u548c\u6700\u5c0f\u3002<\/p>\n\n<p>\u4f8b\u5982\uff0c\u4ee5\u4e0a\u662f\u4e0a\u4e00\u8282\u793a\u4f8b\u9000\u5316\u7684\u65e0\u5411\u56fe\u53ca\u5176\u6700\u5c0f\u751f\u6210\u6811\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-minimum-spanning-tree.png\" alt=\"\" width=\"580\">\n<\/figure>\n\n<p>\u6700\u5c0f\u751f\u6210\u6811\u4e5f\u6709\u5178\u578b\u7684\u5b9e\u9645\u5e94\u7528\u3002\u4f8b\u5982\uff0c\u5047\u8bbe\u8981\u5728\u82e5\u5e72\u5730\u70b9\u95f4\u5efa\u7acb\u901a\u4fe1\u8def\u7ebf\uff0c\u90a3\u4e48\u9700\u8981\u901a\u8fc7\u6700\u5c0f\u751f\u6210\u6811\u6765\u89c4\u5212\u5efa\u7acb\u9700\u8981\u7684\u6700\u77ed\u7ebf\u8def\u957f\u5ea6\u6216\u6700\u5c11\u82b1\u8d39\u3002<\/p>\n\n<p>\u6700\u5c0f\u751f\u6210\u6811\u4e4b\u6240\u4ee5\u79f0\u4e3a\u201c\u6811\u201d\uff0c\u662f\u56e0\u4e3a\u8fd9\u6837\u5f97\u5230\u7684\u65e0\u5411\u56fe\u662f\u6ca1\u6709\u5708\u7684\uff0c\u56e0\u6b64\u5b83\u5c06\u9000\u5316\u4e3a\u6811\u5f62\u7ed3\u6784\u3002\u5982\u679c\u65e0\u5411\u56fe\u6709\u5708\uff0c\u90a3\u4e48\u5708\u4e0a\u7684\u4e24\u4e2a\u9876\u70b9\u4e4b\u95f4\u5c31\u4f1a\u6709\u4e24\u6761\u4e0d\u4e00\u6837\u7684\u8def\u5f84\uff0c\u4f46\u8fd9\u662f\u4e0d\u5fc5\u8981\u7684\uff0c\u4f1a\u589e\u52a0\u603b\u7684\u8def\u5f84\u957f\u5ea6\uff0c\u53ea\u9700\u8981\u4fdd\u7559\u66f4\u77ed\u7684\u8def\u5f84\u5373\u53ef\u3002<\/p>\n\n<p>\u5e76\u4e14\u7531\u4e8e\u65e0\u5411\u56fe\u662f\u6ca1\u6709\u5708\u7684\uff0c\u65e0\u5411\u56fe\u8fb9\u7684\u6761\u6570\u4e3a <span class=\"math\">\\\\( |V| - 1 \\\\)<\/span> \uff0c\u56e0\u4e3a\u9664\u4e86\u6839\u4e4b\u5916\uff0c\u6bcf\u4e2a\u9876\u70b9\u90fd\u9700\u8981\u4e00\u6761\u8fb9\u6765\u63a5\u5230\u56fe\u4e2d\uff1b\u5982\u679c\u591a\u4e86\u4e00\u6761\u8fb9\uff0c\u90a3\u4e48\u67d0\u4e2a\u9876\u70b9\u5c31\u4f1a\u63a5\u5230\u56fe\u4e2d\u4e24\u6b21\uff0c\u5f62\u6210\u4e00\u4e2a\u4e0d\u5fc5\u8981\u7684\u5708\u3002<\/p>\n\n<p>\u5177\u6709\u6700\u5c0f\u751f\u6210\u6811\u7684\u56fe\u9700\u8981\u662f\u8fde\u901a\u7684\u3002\u8ba1\u7b97\u56fe\u7684\u6700\u5c0f\u751f\u6210\u6811\u6709\u4e24\u79cd\u5e38\u7528\u7684\u7b97\u6cd5\u3002<\/p>\n\n<h3>Prim\u7b97\u6cd5<\/h3>\n\n<p>Prim \u662f\u4e00\u79cd\u6613\u4e8e\u7406\u89e3\u7684\u6700\u5c0f\u751f\u6210\u6811\u7b97\u6cd5\u3002\u8be5\u7b97\u6cd5\u5148\u5c06\u6bcf\u4e2a\u9876\u70b9\u72ec\u7acb\u51fa\u6765\uff0c\u7136\u540e\u6bcf\u6b21\u4ece\u72ec\u7acb\u7684\u9876\u70b9\u4e2d\u9009\u62e9\u79bb\u751f\u6210\u6811\u6700\u8fd1\u7684\u9876\u70b9\uff0c\u5c06\u5b83\u548c\u5b83\u7684\u8fb9\u63d2\u5165\u751f\u6210\u6811\u4e2d\u3002<\/p>\n\n<p>\u4e00\u5f00\u59cb\u53ef\u4ee5\u968f\u673a\u9009\u62e9\u4e00\u4e2a\u9876\u70b9\u4f5c\u4e3a\u751f\u6210\u6811\u7684\u6839\u3002\u4e0b\u56fe\u5c55\u793a\u4e86\u8be5\u7b97\u6cd5\u8ba1\u7b97\u4ee5\u4e0a\u56fe\u6700\u5c0f\u751f\u6210\u6811\u7684\u524d\u51e0\u6b65\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Prim-steps.png\" alt=\"\" width=\"440\">\n<\/figure>\n\n<p>Prim \u7b97\u6cd5\u539f\u7406\u6bd4\u8f83\u76f4\u89c2\uff0c\u4f46\u6709\u4e00\u4e9b\u7ec6\u8282\u9700\u8981\u8c28\u614e\u5904\u7406\u3002Prim \u7b97\u6cd5\u7684\u5b9e\u73b0\u53ef\u4ee5\u53c2\u7167\u4ee5\u4e0b\u601d\u8def\u5b8c\u6210\uff1a<\/p>\n\n<p>\u8be5\u601d\u8def\u8981\u6c42\u6bcf\u4e2a\u9876\u70b9\u6709\u4e24\u4e2a\u5b57\u6bb5\uff1a\u5206\u522b\u8bb0\u5f55\u8fd8\u4e0d\u5728\u751f\u6210\u6811\u7684\u9876\u70b9\u79bb\u751f\u6210\u6811\u7684\u6700\u8fd1\u8def\u5f84\u957f\u4e0e\u79bb\u751f\u6210\u6811\u6700\u8fd1\u7684\u9876\u70b9\u3002<\/p>\n\n<p>\u9996\u5148\uff0c\u4efb\u53d6\u4e00\u4e2a\u9876\u70b9\u653e\u5165\u751f\u6210\u6811\u4e2d\uff0c\u5e76\u5c06\u5176\u90bb\u63a5\u7684\u9876\u70b9\u89c6\u4e3a\u79bb\u751f\u6210\u6811\u6700\u8fd1\u7684\u9876\u70b9\uff0c\u66f4\u65b0\u8fd9\u4e9b\u9876\u70b9\u7684\u6700\u8fd1\u8def\u5f84\u957f\u4e0e\u6700\u8fd1\u9876\u70b9\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Prim-step-1.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u6bcf\u4e2a\u9876\u70b9\u7684\u6700\u8fd1\u8def\u5f84\u957f\u4e00\u5f00\u59cb\u88ab\u7f6e\u4e3a <span class=\"math\">\\\\( \\infty \\\\)<\/span> \u6216 <code>INT_MAX<\/code> \u3002\u5982\u679c\u4e00\u4e2a\u9876\u70b9\u7684\u6700\u8fd1\u8def\u5f84\u957f\u4e3a 0 \uff0c\u90a3\u4e48\u8bf4\u660e\u8be5\u9876\u70b9\u5df2\u7ecf\u4f4d\u4e8e\u751f\u6210\u6811\u4e2d\u3002<\/p>\n\n<p>\u63a5\u4e0b\u6765\u6bcf\u6b21\u90fd\u9009\u53d6\u79bb\u751f\u6210\u6811\u6700\u8fd1\u7684\u9876\u70b9\uff0c\u5c06\u5176\u63d2\u5165\u5230\u751f\u6210\u6811\u4e2d\uff0c\u5e76\u66f4\u65b0\u8be5\u9876\u70b9\u90bb\u63a5\u7684\u9876\u70b9\u4fe1\u606f\u3002\u4f8b\u5982\uff0c\u4e0b\u4e00\u6b21\u79bb\u751f\u6210\u6811\u6700\u8fd1\u7684\u9876\u70b9\u662f <span class=\"math\">\\\\( v_2 \\\\)<\/span> \uff0c\u5219\u5c06\u5176\u63d2\u5165\u751f\u6210\u6811\u4e2d\u3002\u66f4\u65b0 <span class=\"math\">\\\\( v_2 \\\\)<\/span> \u90bb\u63a5\u9876\u70b9\u65f6\u53d1\u73b0 <span class=\"math\">\\\\( v_3 \\\\)<\/span> \u79bb\u5b83\u6bd4\u79bb <span class=\"math\">\\\\( v_1 \\\\)<\/span> \u66f4\u8fd1\uff0c\u56e0\u6b64\u5c06\u8be5\u9876\u70b9\u7684\u76f8\u5173\u5b57\u6bb5\u66f4\u65b0\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Prim-step-2.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u4e0b\u4e00\u6b65\u7ee7\u7eed\u9009\u62e9\u79bb\u751f\u6210\u6811\u6700\u8fd1\u7684\u9876\u70b9\uff0c\u4f9d\u7167\u4e0a\u8ff0\u65b9\u5f0f\u63d2\u5165\u5230\u751f\u6210\u6811\u4e2d\u5e76\u66f4\u65b0\u90bb\u63a5\u9876\u70b9\u7684\u4fe1\u606f\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Prim-step-3.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>Prim \u7b97\u6cd5\u7684\u7b80\u5355\u4ee3\u7801\u5b9e\u73b0\u53ef\u4ee5\u53c2\u8003\u5982\u4e0b\uff0c\u5b83\u4e0e Dijkstra \u7b97\u6cd5\u7684\u5b9e\u73b0\u4e0a\u975e\u5e38\u76f8\u4f3c\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span token=\"keyword\">void<\/span> <span style=\"color: #82aaff;\">Graph_MinSpanTree_Prim<\/span>(<span token=\"type\">graph<\/span> <span style=\"color: #d7dbe0;\">g<\/span>) {<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span token=\"variable\">min_vtx<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertices<\/span>[<span token=\"number\">0<\/span>]-&gt;<span style=\"color: #7fdbca;\">data<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"type\">graph_arc<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertices<\/span>[<span token=\"number\">0<\/span>]-&gt;<span style=\"color: #7fdbca;\">firstarc<\/span>; <span token=\"variable\">arc<\/span>; <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">nextarc<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">minpathfrom<\/span>[<span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">min_vtx<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">weight<\/span>;<\/div><div>&nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">min_vtx<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>;<span style=\"color: #637777;\"> &nbsp; &nbsp; &nbsp; &nbsp;<\/span><span style=\"color: #a8a8a8;\">\/\/<\/span><span style=\"color: #637777;\"> put it in the tree<\/span><\/div><div><span style=\"color: #a8a8a8;\">&nbsp; &nbsp; \/* Add new edge ( minpathfrom[min_vtx] --- min_len --&gt; min_vtx ) *\/<\/span><\/div><div>&nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"keyword\">int<\/span> <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">1<\/span>; <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">size<\/span>; <span token=\"variable\">i<\/span><span style=\"color: #c792ea;\">++<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span style=\"color: #c792ea;\">!<\/span><span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertices<\/span>[<span token=\"variable\">i<\/span>])<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">continue<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span token=\"variable\">min_len<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">INT_MAX<\/span>;<span style=\"color: #637777;\"> &nbsp; &nbsp; &nbsp;<\/span><span style=\"color: #a8a8a8;\">\/\/<\/span><span style=\"color: #637777;\"> find the closest vertex<\/span><\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"keyword\">int<\/span> <span token=\"variable\">j<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>; <span token=\"variable\">j<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">size<\/span>; <span token=\"variable\">j<\/span><span style=\"color: #c792ea;\">++<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">j<\/span>] <span style=\"color: #c792ea;\">!=<\/span> <span token=\"number\">0<\/span> <span style=\"color: #c792ea;\">&amp;&amp;<\/span> <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">j<\/span>] <span style=\"color: #c792ea;\">&lt;<\/span> <span token=\"variable\">min_len<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">min_len<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">j<\/span>];<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">min_vtx<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">j<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">min_vtx<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>;<span style=\"color: #637777;\"> &nbsp; &nbsp;<\/span><span style=\"color: #a8a8a8;\">\/\/<\/span><span style=\"color: #637777;\"> put it in the tree<\/span><\/div><div><span style=\"color: #a8a8a8;\">&nbsp; &nbsp; &nbsp; &nbsp; \/* update adjacent vertex *\/<\/span><\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"type\">graph_arc<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #82aaff;\">Graph_GetVertexByData<\/span><span style=\"color: #82aaff;\">(<\/span><span style=\"color: #d7dbe0;\">g<\/span><span style=\"color: #82aaff;\">, <\/span><span token=\"variable\">min_vtx<\/span><span style=\"color: #82aaff;\">)<\/span>-&gt;<span style=\"color: #7fdbca;\">firstarc<\/span>; <span token=\"variable\">arc<\/span>; <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">nextarc<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">!=<\/span> <span token=\"number\">0<\/span> <span style=\"color: #c792ea;\">&amp;&amp;<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">weight<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>]) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">minpathfrom<\/span>[<span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">min_vtx<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">minpathlen<\/span>[<span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">weight<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; }<\/div><div>}<\/div><\/div>\n\n<p>\u8be5\u7b97\u6cd5\u7684\u590d\u6742\u5ea6\u5206\u6790\u4e5f\u548c Dijkstra \u7b97\u6cd5\u4e00\u81f4\uff1a\u4e0d\u4f7f\u7528\u4f18\u5148\u961f\u5217\u65f6\u590d\u6742\u5ea6\u4e3a <span class=\"math\">\\\\( O(|V|^2) \\\\)<\/span> \uff0c\u4f7f\u7528\u4f18\u5148\u961f\u5217\u7684\u590d\u6742\u5ea6\u4e3a <span class=\"math\">\\\\( O(|E|\\log |V|) \\\\)<\/span> \u3002<\/p>\n\n<h3>Kruskal\u7b97\u6cd5<\/h3>\n\n<p>Kruskal \u662f\u53e6\u4e00\u79cd\u8ba1\u7b97\u6700\u5c0f\u751f\u6210\u6811\u7684\u7b97\u6cd5\uff0c\u5b83\u7684\u5b9e\u73b0\u8f83\u4e3a\u7b80\u5355\uff1a\u540c\u6837\u5c06\u9876\u70b9\u72ec\u7acb\u51fa\u6765\u5e76\u5411\u5176\u4e2d\u6dfb\u52a0\u8fb9\uff0c\u6bcf\u6b21\u90fd\u4ece\u56fe\u4e2d\u7684\u6240\u6709\u8fb9\u9009\u53d6\u6743\u91cd\u6700\u5c0f\u7684\u8fb9\uff0c\u5982\u679c\u52a0\u4e0a\u8be5\u8fb9\u540e\u7684\u56fe\u4e0d\u4f1a\u5f62\u6210\u5708\uff0c\u5219\u8bf4\u660e\u8be5\u8fb9\u662f\u6700\u5c0f\u751f\u6210\u6811\u7684\u4e00\u90e8\u5206\u3002<\/p>\n\n<p>\u8fd8\u662f\u4ee5\u4e0a\u9762\u90a3\u4e2a\u56fe\u4e3a\u4f8b\uff0c\u9996\u5148\u9009\u62e9\u6743\u91cd\u6700\u5c0f\u7684\u8fb9\u52a0\u5165\u56fe\u4e2d\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Kruskal-step-1.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u7136\u540e\u7ee7\u7eed\u9009\u62e9\u672a\u6dfb\u52a0\u7684\u6743\u91cd\u6700\u5c0f\u7684\u8fb9\u5c1d\u8bd5\u653e\u5165\u56fe\u4e2d\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Kruskal-step-2.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u7ee7\u7eed\u6dfb\u52a0\u8fb9\uff0c\u4f46\u6dfb\u52a0\u8fb9 <span class=\"math\">\\\\( (v_1, v_4) \\\\)<\/span> \u65f6\u53d1\u73b0\u4f1a\u5f62\u6210\u5708\uff0c\u56e0\u6b64\u9700\u8981\u629b\u5f03\u8be5\u8fb9\uff1a<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Kruskal-step-3.png\" alt=\"\" width=\"320\">\n<\/figure>\n\n<p>\u91cd\u590d\u4ee5\u4e0a\u6b65\u9aa4\u5373\u53ef\u5efa\u7acb\u6700\u5c0f\u751f\u6210\u6811\u3002<\/p>\n\n<p>Kruskal \u7b97\u6cd5\u4e5f\u4e0d\u96be\u7406\u89e3\uff0c\u4e0d\u8fc7\u5b9e\u73b0\u65f6\u4e5f\u6709\u5f88\u591a\u7ec6\u8282\u8981\u6ce8\u610f\u3002\u6700\u5927\u7684\u95ee\u9898\u662f\u5982\u4f55\u5224\u65ad\u6dfb\u52a0\u8fb9\u540e\u662f\u5426\u4f1a\u5f62\u6210\u5708\uff1a\u5982\u679c\u4e3a\u8fde\u901a\u56fe\u4e2d\u7684\u67d0\u4e2a\u9876\u70b9\u6dfb\u52a0\u4e00\u6761\u8fb9\u4f1a\u5f62\u6210\u5708\uff0c\u90a3\u4e48\u8bf4\u660e\u8be5\u8fb9\u6307\u5411\u7684\u8fd8\u662f\u8fd9\u4e00\u8fde\u901a\u56fe\u3002\u90a3\u4e48\u53ea\u9700\u8981\u5c06\u56fe\u4e2d\u7684\u8fde\u901a\u90e8\u5206\u5404\u505a\u4e00\u4e2a\u72ec\u7acb\u7684\u6807\u8bb0\uff0c\u5982\u679c\u51c6\u5907\u63d2\u5165\u4e00\u4e2a\u8fb9\u65f6\u53d1\u73b0\u8be5\u8fb9\u7684\u4e24\u7aef\u540c\u5c5e\u4e00\u4e2a\u8fde\u901a\u56fe\uff0c\u90a3\u4e48\u5c31\u8bf4\u660e\u63d2\u5165\u8be5\u8fb9\u4f1a\u4ea7\u751f\u5708\u3002<\/p>\n\n<p>\u4f8b\u5982\uff0c\u4ee5\u4e0a\u662f\u67d0\u4e2a\u56fe\u8c03\u7528 Kruskal \u7b97\u6cd5\u7684\u4e2d\u95f4\u7ed3\u679c\uff0c\u5b83\u5f62\u6210\u4e86\u4e09\u4e2a\u4e92\u76f8\u72ec\u7acb\u7684\u8fde\u901a\u56fe\uff1a\uff08\u8fd9\u91cc\u4f7f\u7528\u4e0d\u540c\u989c\u8272\u4f5c\u4e3a\u8fde\u901a\u56fe\u7684\u6807\u8bb0\uff09<\/p>\n\n<figure>\n    <img decoding=\"async\" src=\"\/wordpress\/wp-content\/uploads\/2022\/09\/11-Kruskal-has-cycle.png\" alt=\"\" width=\"290\">\n<\/figure>\n\n<p>\u5982\u679c\u8981\u5411\u9876\u70b9 <span class=\"math\">\\\\( v_4 \\\\)<\/span> \u548c <span class=\"math\">\\\\( v_6 \\\\)<\/span> \u4e4b\u95f4\u63d2\u5165\u4e00\u6761\u8fb9\uff0c\u90a3\u4e48\u5c31\u9700\u8981\u5148\u5224\u65ad\u8fd9\u4e24\u4e2a\u9876\u70b9\u7684\u6807\u8bb0\u662f\u5426\u76f8\u540c\uff1a\u5982\u679c\u76f8\u540c\uff0c\u8bf4\u660e\u5b83\u4eec\u5c5e\u4e8e\u540c\u4e00\u4e2a\u8fde\u901a\u56fe\uff0c\u4e24\u8005\u5df2\u7ecf\u5b58\u5728\u4e86\u4e00\u6761\u8def\u5f84\uff0c\u518d\u5411\u5b83\u4eec\u4e4b\u95f4\u63d2\u5165\u4e00\u6761\u8fb9\uff0c\u5219\u53c8\u589e\u52a0\u4e86\u4e00\u6761\u8def\u5f84\uff0c\u4f7f\u5f97\u65e0\u5411\u56fe\u4ea7\u751f\u4e86\u4e00\u4e2a\u5708\u3002<\/p>\n\n<p>Kruskal \u7b97\u6cd5\u5927\u81f4\u53ef\u4ee5\u7531\u4ee5\u4e0b\u65b9\u5f0f\u5b9e\u73b0\uff1a<\/p>\n\n<div class=\"vscode-block\"><div><span token=\"keyword\">void<\/span> <span style=\"color: #82aaff;\">Graph_MinSpanTree_Kruskal<\/span>(<span token=\"type\">graph<\/span> <span style=\"color: #d7dbe0;\">g<\/span>) {<\/div><br><div>&nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"keyword\">int<\/span> <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>; <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">size<\/span>; <span token=\"variable\">i<\/span><span style=\"color: #c792ea;\">++<\/span>)<span style=\"color: #637777;\"> &nbsp;<\/span><span style=\"color: #a8a8a8;\">\/\/<\/span><span style=\"color: #637777;\"> collect arcs<\/span><\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertices<\/span>[<span token=\"variable\">i<\/span>])<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"type\">graph_arc<\/span><span style=\"color: #7fdbca;\">*<\/span> <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertices<\/span>[<span token=\"variable\">i<\/span>]-&gt;<span style=\"color: #7fdbca;\">firstarc<\/span>; <span token=\"variable\">arc<\/span>; <span token=\"variable\">arc<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">nextarc<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">arcs<\/span>[<span token=\"variable\">arcs_ptr<\/span><span style=\"color: #c792ea;\">++<\/span>] <span style=\"color: #c792ea;\">=<\/span> (<span token=\"keyword\">struct<\/span> <span token=\"type\">_graph_arc<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; .from<span style=\"color: #c792ea;\">=<\/span><span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertices<\/span>[<span token=\"variable\">i<\/span>]-&gt;<span style=\"color: #7fdbca;\">data<\/span>, .to<span style=\"color: #c792ea;\">=<\/span><span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex<\/span>-&gt;<span style=\"color: #7fdbca;\">data<\/span>, .weight<span style=\"color: #c792ea;\">=<\/span><span token=\"variable\">arc<\/span>-&gt;<span style=\"color: #7fdbca;\">weight<\/span> };<\/div><div>&nbsp; &nbsp; <span style=\"color: #82aaff;\">qsort<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"variable\">arcs<\/span><span style=\"color: #82aaff;\">, <\/span><span style=\"color: #d7dbe0;\">g<\/span><span style=\"color: #82aaff;\">-&gt;<\/span><span style=\"color: #7fdbca;\">arc_num<\/span><span style=\"color: #82aaff;\">, <\/span><span style=\"color: #7fdbca;\">sizeof<\/span><span style=\"color: #82aaff;\">(<\/span><span token=\"keyword\">struct<\/span><span style=\"color: #82aaff;\"> <\/span><span style=\"color: #82aaff;text-decoration: underline;\">_graph_arc<\/span><span style=\"color: #82aaff;\">), <\/span><span style=\"color: #82aaff;\">CompareByWeight<\/span><span style=\"color: #82aaff;\">)<\/span>;<\/div><br><div>&nbsp; &nbsp; <span token=\"keyword\">int<\/span> <span token=\"variable\">arcs_inserted<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>;<\/div><div>&nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"keyword\">int<\/span> <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>; <span token=\"variable\">i<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">arc_num<\/span>; <span token=\"variable\">i<\/span><span style=\"color: #c792ea;\">++<\/span>) {<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span token=\"variable\">conn_mark<\/span>[<span token=\"variable\">arcs<\/span>[<span token=\"variable\">i<\/span>].<span token=\"variable\">from<\/span>] <span style=\"color: #c792ea;\">!=<\/span> <span token=\"variable\">conn_mark<\/span>[<span token=\"variable\">arcs<\/span>[<span token=\"variable\">i<\/span>].<span token=\"variable\">to<\/span>]) {<\/div><div><span style=\"color: #a8a8a8;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \/* insert edge (arcs[i].from &lt;-- arcs[i].weight --&gt; arcs[i].to) to tree *\/<\/span><\/div><div><span style=\"color: #a8a8a8;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \/* union sets between edge *\/<\/span><\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">for<\/span> (<span token=\"keyword\">int<\/span> <span token=\"variable\">k<\/span> <span style=\"color: #c792ea;\">=<\/span> <span token=\"number\">0<\/span>; <span token=\"variable\">k<\/span> <span style=\"color: #c792ea;\">&lt;<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex_num<\/span>; <span token=\"variable\">k<\/span><span style=\"color: #c792ea;\">++<\/span>)<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span token=\"variable\">conn_mark<\/span>[<span token=\"variable\">k<\/span>] <span style=\"color: #c792ea;\">==<\/span> <span token=\"variable\">conn_mark<\/span>[<span token=\"variable\">arcs<\/span>[<span token=\"variable\">i<\/span>].<span token=\"variable\">to<\/span>])<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">conn_mark<\/span>[<span token=\"variable\">k<\/span>] <span style=\"color: #c792ea;\">=<\/span> <span token=\"variable\">conn_mark<\/span>[<span token=\"variable\">arcs<\/span>[<span token=\"variable\">i<\/span>].<span token=\"variable\">from<\/span>];<\/div><br><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"variable\">arcs_inserted<\/span><span style=\"color: #c792ea;\">++<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">if<\/span> (<span token=\"variable\">arcs_inserted<\/span> <span style=\"color: #c792ea;\">==<\/span> <span style=\"color: #d7dbe0;\">g<\/span>-&gt;<span style=\"color: #7fdbca;\">vertex_num<\/span> <span style=\"color: #7fdbca;\">-<\/span> <span token=\"number\">1<\/span>)<span style=\"color: #637777;\"> &nbsp;<\/span><span style=\"color: #a8a8a8;\">\/\/<\/span><span style=\"color: #637777;\"> minimum spanning tree has created<\/span><\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <span token=\"keyword\">break<\/span>;<\/div><div>&nbsp; &nbsp; &nbsp; &nbsp; }<\/div><div>&nbsp; &nbsp; }<\/div><div>}<\/div><\/div>\n\n<p>\u4ee5\u4e0a\u4ee3\u7801\u9996\u5148\u6536\u96c6\u6240\u6709\u7684\u8fb9\uff08\u6ce8\u610f\u5982\u679c\u7528\u90bb\u63a5\u8868\u8868\u793a\u65e0\u5411\u56fe\u7684\u8bdd\u6bcf\u6761\u8fb9\u53ea\u5e94\u8be5\u6536\u96c6\u4e00\u6b21\uff09\uff0c\u7136\u540e\u5bf9\u6240\u6709\u8fb9\u505a<a href=\"\/archives\/735\">\u6392\u5e8f<\/a>\uff0c\u4ee5\u5b9e\u73b0\u4ece\u5c0f\u5230\u5927\u63d2\u5165\u5408\u9002\u7684\u8fb9\u3002<\/p>\n\n<p>\u5728\u63d2\u5165\u524d\u9700\u8981\u5224\u65ad\u8fb9\u4e24\u4fa7\u9876\u70b9\u7684\u6807\u8bb0\u662f\u5426\u76f8\u540c\uff0c\u5982\u679c\u4e0d\u76f8\u540c\u4fbf\u53ef\u63d2\u5165\uff0c\u63d2\u5165\u5b8c\u6210\u540e\u8fd8\u9700\u66f4\u65b0\u4e24\u4fa7\u8fde\u901a\u56fe\u7684\u6807\u8bb0\u4e3a\u540c\u4e00\u8fde\u901a\u56fe\u3002\u4fee\u6539\u6807\u8bb0\u7684\u65b9\u5f0f\u4e3a\uff1a\u904d\u5386\u6240\u6709\u9876\u70b9\u6807\u8bb0\uff0c\u5c06\u548c\u8fb9\u4e00\u4fa7\u9876\u70b9\u76f8\u540c\u7684\u6807\u8bb0\u4fee\u6539\u4e3a\u53e6\u4e00\u4fa7\u7684\u6807\u8bb0\u3002<\/p>\n\n<p>\u8fd9\u79cd\u5408\u5e76\u65b9\u5f0f\u867d\u7136\u6613\u4e8e\u7406\u89e3\uff0c\u4f46\u6548\u7387\u4e0d\u9ad8\u3002\u5982\u679c\u8981\u4f7f\u7528\u66f4\u9ad8\u6548\u7684\u5408\u5e76\uff0c\u9700\u8981\u4f7f\u7528\u67d0\u4e9b\u7279\u6b8a\u7684\u96c6\u5408\u6570\u636e\u7ed3\u6784\u624d\u80fd\u5b9e\u73b0\u3002<\/p>\n","protected":false},"excerpt":{"rendered":"<p>\u56fe\u5b58\u50a8\u7ed3\u6784 \u56fe\u7ed3\u6784\u7b80\u4ecb \u5728\u4e4b\u524d\u7684\u7ae0\u8282\u4e2d\u5df2\u7ecf\u89c1\u8fc7\u4e86\u4e00\u5bf9&#46;&#46;&#46;<\/p>\n","protected":false},"author":1,"featured_media":765,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[43],"tags":[44,45],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>\u6570\u636e\u7ed3\u678408-\u56fe - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9<\/title>\r\n<meta name=\"description\" content=\"\u672c\u8282\u4ecb\u7ecd\u56fe\u8fd9\u79cd\u5178\u578b\u7684\u591a\u5bf9\u591a\u6570\u636e\u7ed3\u6784\uff0c\u4e0e\u56fe\u7684\u90bb\u63a5\u77e9\u9635\u548c\u90bb\u63a5\u8868\u8868\u793a\u65b9\u6cd5\uff0c\u4ee5\u53ca\u4e00\u4e9b\u7ecf\u5178\u7684\u56fe\u8bba\u7b97\u6cd5\uff1a\u62d3\u6251\u6392\u5e8f\u3001\u56fe\u7684\u904d\u5386\uff08\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u548c\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\uff09\u3001\u6700\u77ed\u8def\u5f84\u7b97\u6cd5\uff08\u5305\u62ec\u65e0\u6743\u56fe\u548c\u6709\u6743\u56fe\uff09\u4ee5\u53ca\u6700\u5c0f\u751f\u6210\u6811\uff08\u5305\u62ec Prim \u7b97\u6cd5\u548c Kruskal \u7b97\u6cd5\uff09\" \/>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"http:\/\/localhost:8000\/wordpress\/archives\/743\" \/>\r\n<meta property=\"og:locale\" content=\"zh_CN\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"\u6570\u636e\u7ed3\u678408-\u56fe - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9\" \/>\r\n<meta property=\"og:description\" content=\"\u672c\u8282\u4ecb\u7ecd\u56fe\u8fd9\u79cd\u5178\u578b\u7684\u591a\u5bf9\u591a\u6570\u636e\u7ed3\u6784\uff0c\u4e0e\u56fe\u7684\u90bb\u63a5\u77e9\u9635\u548c\u90bb\u63a5\u8868\u8868\u793a\u65b9\u6cd5\uff0c\u4ee5\u53ca\u4e00\u4e9b\u7ecf\u5178\u7684\u56fe\u8bba\u7b97\u6cd5\uff1a\u62d3\u6251\u6392\u5e8f\u3001\u56fe\u7684\u904d\u5386\uff08\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u548c\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\uff09\u3001\u6700\u77ed\u8def\u5f84\u7b97\u6cd5\uff08\u5305\u62ec\u65e0\u6743\u56fe\u548c\u6709\u6743\u56fe\uff09\u4ee5\u53ca\u6700\u5c0f\u751f\u6210\u6811\uff08\u5305\u62ec Prim \u7b97\u6cd5\u548c Kruskal \u7b97\u6cd5\uff09\" \/>\r\n<meta property=\"og:url\" content=\"http:\/\/localhost:8000\/wordpress\/archives\/743\" \/>\r\n<meta property=\"og:site_name\" content=\"\u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9\" \/>\r\n<meta property=\"article:published_time\" content=\"2022-09-15T03:41:15+00:00\" \/>\r\n<meta property=\"article:modified_time\" content=\"2022-12-12T11:05:00+00:00\" \/>\r\n<meta property=\"og:image\" content=\"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/09\/\u6570\u636e\u7ed3\u678408-\u56fe.jpg\" \/>\r\n\t<meta property=\"og:image:width\" content=\"1066\" \/>\r\n\t<meta property=\"og:image:height\" content=\"802\" \/>\r\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"\u4f5c\u8005\" \/>\n\t<meta name=\"twitter:data1\" content=\"Hello\" \/>\n\t<meta name=\"twitter:label2\" content=\"\u9884\u8ba1\u9605\u8bfb\u65f6\u95f4\" \/>\n\t<meta name=\"twitter:data2\" content=\"11\u5206\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\r\n\t    \"@context\": \"https:\/\/schema.org\",\r\n\t    \"@graph\": [\r\n\t        {\r\n\t            \"@type\": \"WebSite\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/#website\",\r\n\t            \"url\": \"http:\/\/localhost:8000\/wordpress\/\",\r\n\t            \"name\": \"\u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9\",\r\n\t            \"description\": \"FrozenCandle&#039;s Personal Site\",\r\n\t            \"potentialAction\": [\r\n\t                {\r\n\t                    \"@type\": \"SearchAction\",\r\n\t                    \"target\": {\r\n\t                        \"@type\": \"EntryPoint\",\r\n\t                        \"urlTemplate\": \"http:\/\/localhost:8000\/wordpress\/?s={search_term_string}\"\r\n\t                    },\r\n\t                    \"query-input\": \"required name=search_term_string\"\r\n\t                }\r\n\t            ],\r\n\t            \"inLanguage\": \"zh-CN\"\r\n\t        },\r\n\t        {\r\n\t            \"@type\": \"ImageObject\",\r\n\t            \"inLanguage\": \"zh-CN\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/743#primaryimage\",\r\n\t            \"url\": \"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/09\/\u6570\u636e\u7ed3\u678408-\u56fe.jpg\",\r\n\t            \"contentUrl\": \"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/09\/\u6570\u636e\u7ed3\u678408-\u56fe.jpg\",\r\n\t            \"width\": 1066,\r\n\t            \"height\": 802\r\n\t        },\r\n\t        {\r\n\t            \"@type\": \"WebPage\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/743#webpage\",\r\n\t            \"url\": \"http:\/\/localhost:8000\/wordpress\/archives\/743\",\r\n\t            \"name\": \"\u6570\u636e\u7ed3\u678408-\u56fe - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9\",\r\n\t            \"isPartOf\": {\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/#website\"\r\n\t            },\r\n\t            \"primaryImageOfPage\": {\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/743#primaryimage\"\r\n\t            },\r\n\t            \"datePublished\": \"2022-09-15T03:41:15+00:00\",\r\n\t            \"dateModified\": \"2022-12-12T11:05:00+00:00\",\r\n\t            \"author\": {\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/805995a49645fa933cb6698b7ffd0d7c\"\r\n\t            },\r\n\t            \"description\": \"\u672c\u8282\u4ecb\u7ecd\u56fe\u8fd9\u79cd\u5178\u578b\u7684\u591a\u5bf9\u591a\u6570\u636e\u7ed3\u6784\uff0c\u4e0e\u56fe\u7684\u90bb\u63a5\u77e9\u9635\u548c\u90bb\u63a5\u8868\u8868\u793a\u65b9\u6cd5\uff0c\u4ee5\u53ca\u4e00\u4e9b\u7ecf\u5178\u7684\u56fe\u8bba\u7b97\u6cd5\uff1a\u62d3\u6251\u6392\u5e8f\u3001\u56fe\u7684\u904d\u5386\uff08\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u548c\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\uff09\u3001\u6700\u77ed\u8def\u5f84\u7b97\u6cd5\uff08\u5305\u62ec\u65e0\u6743\u56fe\u548c\u6709\u6743\u56fe\uff09\u4ee5\u53ca\u6700\u5c0f\u751f\u6210\u6811\uff08\u5305\u62ec Prim \u7b97\u6cd5\u548c Kruskal \u7b97\u6cd5\uff09\",\r\n\t            \"breadcrumb\": {\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/743#breadcrumb\"\r\n\t            },\r\n\t            \"inLanguage\": \"zh-CN\",\r\n\t            \"potentialAction\": [\r\n\t                {\r\n\t                    \"@type\": \"ReadAction\",\r\n\t                    \"target\": [\r\n\t                        \"http:\/\/localhost:8000\/wordpress\/archives\/743\"\r\n\t                    ]\r\n\t                }\r\n\t            ]\r\n\t        },\r\n\t        {\r\n\t            \"@type\": \"BreadcrumbList\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/archives\/743#breadcrumb\",\r\n\t            \"itemListElement\": [\r\n\t                {\r\n\t                    \"@type\": \"ListItem\",\r\n\t                    \"position\": 1,\r\n\t                    \"name\": \"\u9996\u9875\",\r\n\t                    \"item\": \"http:\/\/localhost:8000\/wordpress\/\"\r\n\t                },\r\n\t                {\r\n\t                    \"@type\": \"ListItem\",\r\n\t                    \"position\": 2,\r\n\t                    \"name\": \"\u6570\u636e\u7ed3\u678408-\u56fe\"\r\n\t                }\r\n\t            ]\r\n\t        },\r\n\t        {\r\n\t            \"@type\": \"Person\",\r\n\t            \"@id\": \"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/805995a49645fa933cb6698b7ffd0d7c\",\r\n\t            \"name\": \"Hello\",\r\n\t            \"image\": {\r\n\t                \"@type\": \"ImageObject\",\r\n\t                \"inLanguage\": \"zh-CN\",\r\n\t                \"@id\": \"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/image\/\",\r\n\t                \"url\": \"http:\/\/2.gravatar.com\/avatar\/e1edbd1491f244c1e5cfafed859d4426?s=96&d=mm&r=g\",\r\n\t                \"contentUrl\": \"http:\/\/2.gravatar.com\/avatar\/e1edbd1491f244c1e5cfafed859d4426?s=96&d=mm&r=g\",\r\n\t                \"caption\": \"Hello\"\r\n\t            },\r\n\t            \"sameAs\": [\r\n\t                \"http:\/\/localhost:8000\/wordpress\"\r\n\t            ],\r\n\t            \"url\": \"http:\/\/localhost:8000\/wordpress\/archives\/author\/hello\"\r\n\t        }\r\n\t    ]\r\n\t}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"\u6570\u636e\u7ed3\u678408-\u56fe - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","description":"\u672c\u8282\u4ecb\u7ecd\u56fe\u8fd9\u79cd\u5178\u578b\u7684\u591a\u5bf9\u591a\u6570\u636e\u7ed3\u6784\uff0c\u4e0e\u56fe\u7684\u90bb\u63a5\u77e9\u9635\u548c\u90bb\u63a5\u8868\u8868\u793a\u65b9\u6cd5\uff0c\u4ee5\u53ca\u4e00\u4e9b\u7ecf\u5178\u7684\u56fe\u8bba\u7b97\u6cd5\uff1a\u62d3\u6251\u6392\u5e8f\u3001\u56fe\u7684\u904d\u5386\uff08\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u548c\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\uff09\u3001\u6700\u77ed\u8def\u5f84\u7b97\u6cd5\uff08\u5305\u62ec\u65e0\u6743\u56fe\u548c\u6709\u6743\u56fe\uff09\u4ee5\u53ca\u6700\u5c0f\u751f\u6210\u6811\uff08\u5305\u62ec Prim \u7b97\u6cd5\u548c Kruskal \u7b97\u6cd5\uff09","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"http:\/\/localhost:8000\/wordpress\/archives\/743","og_locale":"zh_CN","og_type":"article","og_title":"\u6570\u636e\u7ed3\u678408-\u56fe - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","og_description":"\u672c\u8282\u4ecb\u7ecd\u56fe\u8fd9\u79cd\u5178\u578b\u7684\u591a\u5bf9\u591a\u6570\u636e\u7ed3\u6784\uff0c\u4e0e\u56fe\u7684\u90bb\u63a5\u77e9\u9635\u548c\u90bb\u63a5\u8868\u8868\u793a\u65b9\u6cd5\uff0c\u4ee5\u53ca\u4e00\u4e9b\u7ecf\u5178\u7684\u56fe\u8bba\u7b97\u6cd5\uff1a\u62d3\u6251\u6392\u5e8f\u3001\u56fe\u7684\u904d\u5386\uff08\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u548c\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\uff09\u3001\u6700\u77ed\u8def\u5f84\u7b97\u6cd5\uff08\u5305\u62ec\u65e0\u6743\u56fe\u548c\u6709\u6743\u56fe\uff09\u4ee5\u53ca\u6700\u5c0f\u751f\u6210\u6811\uff08\u5305\u62ec Prim \u7b97\u6cd5\u548c Kruskal \u7b97\u6cd5\uff09","og_url":"http:\/\/localhost:8000\/wordpress\/archives\/743","og_site_name":"\u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","article_published_time":"2022-09-15T03:41:15+00:00","article_modified_time":"2022-12-12T11:05:00+00:00","og_image":[{"width":1066,"height":802,"url":"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/09\/\u6570\u636e\u7ed3\u678408-\u56fe.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"\u4f5c\u8005":"Hello","\u9884\u8ba1\u9605\u8bfb\u65f6\u95f4":"11\u5206"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"http:\/\/localhost:8000\/wordpress\/#website","url":"http:\/\/localhost:8000\/wordpress\/","name":"\u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","description":"FrozenCandle&#039;s Personal Site","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"http:\/\/localhost:8000\/wordpress\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"zh-CN"},{"@type":"ImageObject","inLanguage":"zh-CN","@id":"http:\/\/localhost:8000\/wordpress\/archives\/743#primaryimage","url":"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/09\/\u6570\u636e\u7ed3\u678408-\u56fe.jpg","contentUrl":"http:\/\/localhost:8000\/wordpress\/wp-content\/uploads\/2022\/09\/\u6570\u636e\u7ed3\u678408-\u56fe.jpg","width":1066,"height":802},{"@type":"WebPage","@id":"http:\/\/localhost:8000\/wordpress\/archives\/743#webpage","url":"http:\/\/localhost:8000\/wordpress\/archives\/743","name":"\u6570\u636e\u7ed3\u678408-\u56fe - \u51b0\u5c01\u6b8b\u70db\u7684\u4e2a\u4eba\u5c0f\u7ad9","isPartOf":{"@id":"http:\/\/localhost:8000\/wordpress\/#website"},"primaryImageOfPage":{"@id":"http:\/\/localhost:8000\/wordpress\/archives\/743#primaryimage"},"datePublished":"2022-09-15T03:41:15+00:00","dateModified":"2022-12-12T11:05:00+00:00","author":{"@id":"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/805995a49645fa933cb6698b7ffd0d7c"},"description":"\u672c\u8282\u4ecb\u7ecd\u56fe\u8fd9\u79cd\u5178\u578b\u7684\u591a\u5bf9\u591a\u6570\u636e\u7ed3\u6784\uff0c\u4e0e\u56fe\u7684\u90bb\u63a5\u77e9\u9635\u548c\u90bb\u63a5\u8868\u8868\u793a\u65b9\u6cd5\uff0c\u4ee5\u53ca\u4e00\u4e9b\u7ecf\u5178\u7684\u56fe\u8bba\u7b97\u6cd5\uff1a\u62d3\u6251\u6392\u5e8f\u3001\u56fe\u7684\u904d\u5386\uff08\u6df1\u5ea6\u4f18\u5148\u641c\u7d22\u548c\u5e7f\u5ea6\u4f18\u5148\u641c\u7d22\uff09\u3001\u6700\u77ed\u8def\u5f84\u7b97\u6cd5\uff08\u5305\u62ec\u65e0\u6743\u56fe\u548c\u6709\u6743\u56fe\uff09\u4ee5\u53ca\u6700\u5c0f\u751f\u6210\u6811\uff08\u5305\u62ec Prim \u7b97\u6cd5\u548c Kruskal \u7b97\u6cd5\uff09","breadcrumb":{"@id":"http:\/\/localhost:8000\/wordpress\/archives\/743#breadcrumb"},"inLanguage":"zh-CN","potentialAction":[{"@type":"ReadAction","target":["http:\/\/localhost:8000\/wordpress\/archives\/743"]}]},{"@type":"BreadcrumbList","@id":"http:\/\/localhost:8000\/wordpress\/archives\/743#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"\u9996\u9875","item":"http:\/\/localhost:8000\/wordpress\/"},{"@type":"ListItem","position":2,"name":"\u6570\u636e\u7ed3\u678408-\u56fe"}]},{"@type":"Person","@id":"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/805995a49645fa933cb6698b7ffd0d7c","name":"Hello","image":{"@type":"ImageObject","inLanguage":"zh-CN","@id":"http:\/\/localhost:8000\/wordpress\/#\/schema\/person\/image\/","url":"http:\/\/2.gravatar.com\/avatar\/e1edbd1491f244c1e5cfafed859d4426?s=96&d=mm&r=g","contentUrl":"http:\/\/2.gravatar.com\/avatar\/e1edbd1491f244c1e5cfafed859d4426?s=96&d=mm&r=g","caption":"Hello"},"sameAs":["http:\/\/localhost:8000\/wordpress"],"url":"http:\/\/localhost:8000\/wordpress\/archives\/author\/hello"}]}},"acf":[],"_links":{"self":[{"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/posts\/743"}],"collection":[{"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/comments?post=743"}],"version-history":[{"count":3,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/posts\/743\/revisions"}],"predecessor-version":[{"id":921,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/posts\/743\/revisions\/921"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/media\/765"}],"wp:attachment":[{"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/media?parent=743"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/categories?post=743"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost:8000\/wordpress\/wp-json\/wp\/v2\/tags?post=743"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}